package p001;

import com.skyhand.hookhand.dialog.view.SwitchButton;

/* JADX INFO: renamed from: ۟.l5 */
/* JADX INFO: loaded from: classes.dex */
public final class C0294l5 extends AbstractC0335o4 implements InterfaceC0208f3<C0433vb> {

    /* JADX INFO: renamed from: ۥ */
    public final SwitchButton f940;

    public C0294l5(SwitchButton switchButton) {
        this.f940 = switchButton;
    }

    /* JADX DEBUG: Return type fixed from 'java.lang.Object' to match base method */
    @Override // p001.InterfaceC0208f3
    /* JADX INFO: renamed from: ۥ */
    public final C0433vb mo7() {
        SwitchButton switchButton = null;
        String str = "ۖۘ۠ۚۙ۫ۡ۫۟ۙۗۥۗۦۡۘ۠ۗۤۜۤ۟ۢۨۘۘۨۦ۠ۚۦۗ۟ۖۧۘۧۗۦۘۖۖۘۘۢ۫ۨۗۤۦۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 195) ^ 731) ^ 467) ^ 188) ^ 235) ^ 567) ^ 845) ^ (-1573059640)) {
                case -2147351293:
                    switchButton.postInvalidate();
                    str = "ۗۢۚۥ۠ۧۨۘۘۦۥۘ۬ۘۨۥ۠ۘۤ۬ۘ۬ۢ۬ۤۚۦۘۘۢۜۖۘ۬ۛۘۘۘ۫ۦۘۖۤ۫ۖۚ۬ۘۛۘۘۚۨۖۘ۟۬ۘ";
                    break;
                case -948426786:
                    switchButton.m983(false, false);
                    str = "۟ۥۘۢ۟ۗۤۢۜۥۘ۟ۙۡۨ۠ۥۛۦۦۘ۬ۨۜۘ۬۫ۧۢۗۦۘۙۙۡۘۥۨۚۡۚۛ۟ۢۙۤۛۖۘۤۦۥۨۛ۠ۘۜۘۥ۟ۦۘ۬ۥ۫ۙ۬۠ۘۥ۬ۗۛۚ۫ۢۙ";
                    break;
                case -200778857:
                    String str2 = "ۗ۫ۜۘۧۘۛۙۛۡۘۚۨۨۧۤ۠ۚۛ۫ۥ۫ۦۘ۠ۨۜۦ۫ۨۘۗ۬ۤۙۡۦۢۨۜۘ۟ۧۤۘۙۘۘۛۜۜۧۤۖۘۚۗۘۘۡۦۥۘۜ۫ۚۧۙۡۘ۟ۘۘۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 2015210153) {
                            case -2108978141:
                                str2 = "ۜۙۙۦۗۢ۬ۥۧۚ۠۬ۧۜۢۧۥۖۘۗۛۖۨۛ۟ۚۦۙۗۛ۫۫ۜۘۚۛۖۘ۬۫ۦۢۚ۠ۥۦۛۚۛۨۘ۠ۖۨۨۥ۫";
                                break;
                            case -708523591:
                                str = "ۨۢۗۨ۠ۖۙۦۙۦۗۨۘۙۧۗۡۦۢۗۡۥ۬ۚۤۚۦۧۙۢۥ۟۟ۖۘۡ۫ۖۘۗۜۨۙۡۘۨۢۥۘ۬ۙۡ۟ۛۖ۟ۘۘۖۢۨۙۗ۠ۚۨۛۦۙۛۙۨۧۥۘۢۦۘ۬۟۟";
                                continue;
                            case 161746894:
                                String str3 = "۟۬۟ۖۤ۠۟ۥۧ۫ۡۜۘ۫۠۟ۖۘۖۡۥۘۘۦۘۗۘۡۡۡۥۘۦۥۖۘ۬۠ۘۜۖۙۛۥ۫ۜۚۜۡۛۜۜۢۥۜۘۤۧ۟ۛۨۨۡۘ۟ۗۛۜۡۤۢ۟۬ۧۙۨۧۚۗۡۢۖۘ۠ۙۨۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1661392680)) {
                                        case -749127867:
                                            str2 = "ۛۙۖۘۧۧۘ۟ۛۦۘۖۧۜ۫ۖۡۘۖۨۜۘۗۡۘۛۢۥۢۗۚۗۨۗۗۚۚۖۧۨۖۜۖ۠ۥۘۛ۬ۚ۟ۚۜۘۤ۬ۡۘۜ۬ۗۙۧۤۦ۟ۢ۬ۨۚ";
                                            break;
                                        case -448643331:
                                            String str4 = "۟۟ۦۘۖۛۚۖۥۗۛۧۦۘ۠ۛۖۨۧۡۡۡۚۨۘۨ۟ۖ۫ۧۡۘۗۨۧۤ۬ۚۥۘ۬ۜ۠ۧۤۢۜۜۤۜۜ۠ۦۛ۠ۜۧۗۦۖۢۢ۬۠ۦۘۚۗۦۘۖۛۢ۬۬ۙ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1088883237) {
                                                    case -1816684235:
                                                        str4 = "ۛ۟ۘۙۛۦۘۧۡۘۘ۟ۡۙ۫ۦ۬ۦۥۘۚۖ۟ۚ۬ۢۙ۠ۗۗ۠ۨۘۙۚۦ۟۠ۜۢۨ۟ۢۢۘۘۥۥۨۘ";
                                                        break;
                                                    case -1601650575:
                                                        str3 = "۠ۜۥۘۙۖ۟ۘ۟ۥۘۛ۬ۗۨۗۖ۫ۛۡۚۤۨۢۚ۬ۨۤۨۤۗ۠ۤۨۜۘۤۛۡۘۧۜۡۘۦۗۥۥۦۤۡۛۨۢ۠۬۠ۡۚ";
                                                        break;
                                                    case 1270563722:
                                                        str3 = "ۗۤۛ۟ۛۜۘۢۤۥۤۥۡ۟ۗۜ۠ۡۦۘۖۧ۠ۦۚۘۘۛ۫ۡۘۧ۠ۦۘ۠۟ۛۥ۫ۘۖۚۘۚ۫ۗۧ۫ۜۡۧۧۜ۟ۧ۠ۧۙۧۨۘۡۚۚۜ۫ۜۚۛۤۡۨ۫ۧۗۧۗۚۙۨۦۖۜۤ";
                                                        break;
                                                    case 1749613841:
                                                        str4 = !switchButton.isChecked() ? "ۘۨۖۜۢۘۘۢۖۛۦۜۡۘ۬ۘۧۘۤۨۙۚۡۡۘۘۙۨۘ۫ۙۗۡۛۡۚۚۤۘۤۦۧۗ۠ۜۘۨۢ۠ۥۘۧۢۡۘ۠ۤۘ۫ۗۖۘ" : "۬ۗۖۘۗۙۥۘۡ۠ۗۨ۫ۛۘۖۡۘۗۜ۠ۢۖۤۜ۫ۧۙۡ۠ۛ۠۬ۤۡۚۗۙۖۢۤ۫ۛۦۛۙۧۦۨۦۚۨۘۖۢۨ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 663814574:
                                            str3 = "ۗۘۦۘۥۨۦۦۙۤۖ۟ۧۥ۠ۥۧۦ۠ۤۙۖۡۦۚ۠ۨ۫ۙۚ۠۫ۤۚۚۢۢ۫ۜۘۦۘۡۘۤۧۘۘۢ۟ۘۘۙۨۘۘۘۜۦۘۡۨۨۘۤۙۦۘۜۗۖۘۡۛۚ۫۠ۤۨۙۧۖ۠ۢۢۨۦۨۨۘ";
                                            break;
                                        case 805852836:
                                            str2 = "۬ۦۖۘۚۥۦۚۜۨۘۚ۫ۡۘۜۜ۟۠ۘۡۘۢۗۦۜۤۙۙ۟ۙۨۛ۠ۜۥۜ۟ۨۦۚۛۦۥۜۨۙۜۚۛ۫ۡۤ۫ۙ۠ۡۥۡ۠۫ۥۖۘۜۧۥۘ";
                                            break;
                                    }
                                }
                                break;
                            case 2114615507:
                                str = "ۜۤۦۤۜۥۨۢۡ۫۠ۧ۟ۘۛۘۗ۬ۥۘۡۗ۫ۦۘۥۖۗۧ۬۟ۨۡ۬ۛۨۦۘۙۛۚۡۢۥ۠ۚۦۤۙۤ۫۬ۘۘۛۖۦۘۖۧ۠ۤ۟۫ۤۘۘۦۢۗ۫۫ۚۚۘۤ";
                                continue;
                        }
                    }
                    break;
                case 659093170:
                    return C0433vb.f1163;
                case 667385851:
                    str = "ۛۙۢۦۚۥۘ۬ۘۘۤۚۚ۬ۚ۠ۥۧۖۘۨۙۘۘۘۤۘ۫۬ۙۨۨۜۥۙۨ۟ۢۖۘۛ۬ۘۘۤۙۖۘۡۛۡۜۧۚۧ۟ۨۗۢ۠ۨ۫۟ۖۗۜۘۢۢۥۥۧۦۖۘۥۘۦۦۙ";
                    break;
                case 935438700:
                    str = "۟ۥۘۢ۟ۗۤۢۜۥۘ۟ۙۡۨ۠ۥۛۦۦۘ۬ۨۜۘ۬۫ۧۢۗۦۘۙۙۡۘۥۨۚۡۚۛ۟ۢۙۤۛۖۘۤۦۥۨۛ۠ۘۜۘۥ۟ۦۘ۬ۥ۫ۙ۬۠ۘۥ۬ۗۛۚ۫ۢۙ";
                    break;
                case 1093818496:
                    switchButton = this.f940;
                    str = "ۦۘ۠ۢ۫ۢ۠۫ۡۡۤۨۘۧۢۛۚ۬ۗۜۗ۠۬ۤ۠ۚۤ۟ۘۚۛۤۘۦۨۡۖۘۥۖۘۤۗۗۥۦۨۥۡۥۙۡۚۘۧۘ";
                    break;
            }
        }
    }
}
