package p001;

import android.annotation.SuppressLint;
import android.app.Activity;
import android.content.Context;
import de.robv.android.xposed.XposedBridge;
import java.util.EmptyStackException;
import p001.AbstractC0356q;

/* JADX INFO: renamed from: ۟.l3 */
/* JADX INFO: loaded from: classes.dex */
@SuppressLint({"StaticFieldLeak"})
public final class C0292l3 {

    /* JADX INFO: renamed from: ۥ */
    @SuppressLint({"StaticFieldLeak"})
    public static Context f937;

    /* JADX INFO: renamed from: ۥ۟ */
    public static ClassLoader f938;

    /* JADX INFO: renamed from: ۥ۟۟, reason: contains not printable characters */
    public static String f1685;

    /* JADX INFO: renamed from: ۥ۟۠, reason: contains not printable characters */
    public static int f1686;

    /* JADX INFO: renamed from: ۥ۟ۡ, reason: contains not printable characters */
    public static int f1687;

    /* JADX INFO: renamed from: ۥ۟ۢ, reason: contains not printable characters */
    public static boolean f1688;

    /* JADX INFO: renamed from: ۥ */
    public static boolean m892() {
        String str = "ۥۡۨۘۜۦۘۗۙۧۙ۠ۢۖۛۨۘۜۖ۬ۗۗۚۗۚۖۥ۟ۨۦۦۘۥۖۧۙ۟ۡۢۦۡۗۨۘۡ۫ۚۙۚۙۦ۠ۥۘۖۧۚۘۘۧۨۨۧۦۖۘ";
        boolean z = false;
        boolean z2 = false;
        while (true) {
            switch ((((((((str.hashCode() ^ 134) ^ 674) ^ 519) ^ 778) ^ 110) ^ 168) ^ 558) ^ 1663599485) {
                case -1919844491:
                    z2 = true;
                    str = "ۨۢۙۙ۫ۚۧۜۜۚۛۜۚۘۙۥۖۘ۠ۘۘۜ۬ۙۗۦۡۘۖۥۚۤۨ۬ۥۜ۫ۡ۠ۘۘۖۙۗۚۢۡۘۨ۫ۡۘۨۡۥۘ۫ۗۖ";
                    continue;
                case -1777493513:
                    String str2 = "ۦ۬ۖۘۜۦۧۗۛۧۘۗۦۘۖۛۥۗۨۖۦ۠۟۟۬۫ۚۛۙۦۙۥۘۚۗۘۦۡۙۜۖۥۘ۠۫ۤۤۜۥۤ۫ۘۘۘۛۗۚۨ۫ۧ۟۫ۧۦۛۘۨۥۢۜۦۜۛۧۗۜۙۜۤ۫ۥۤۚۖۧۙ";
                    while (true) {
                        switch (str2.hashCode() ^ (-870478775)) {
                            case -868418558:
                                str = "ۨۢۥۨۖۛۚ۬ۧۨۚۚۙۜۧۘۖۧۦۡۨۧۘۜۛۖۘۤۥۜۛ۟ۨ۬ۡۘ۬ۜۖۨۘ۟ۨۛۘۧۡۘۥ۬ۢۢ۬۫ۜۜ۫ۖۜۜۘۘۜۗۨ";
                                break;
                            case -215657018:
                                String str3 = "ۢۧۚۡۛ۠۬ۥۖ۠۠ۛۖۡۡۗۢۦۜۤۚۡۢۥۥۨ۬۬۟ۗۖۘۧۧۡۜ۬ۙ۠ۛۖۘۗۧۡۥۥۥۘۗ۬ۖۛ۠ۚۜۗۘۘۘۙۚ۫ۙۦۘ۫۠ۜۘ۠ۨۜۘۦۢۦۘۜ۬ۖۘۨۜۗ۠ۢۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1491288180)) {
                                        case -777120902:
                                            String str4 = "ۧ۟ۙۛۥۛۘۛۘۘۜۜۧۥۜۖۤۖۘ۬۠ۨۘۛۗۡۘۗۦۦۘ۬۬ۨ۟ۘ۠ۢۥ۫ۛ۟ۢۨۨۘۚ۬ۘۖۨۚۦ۠ۤۤۘۨۘۥۚۢۧۡۘۖۘۡۧۚ۟ۥۛ۟ۖۛۡ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1399552754)) {
                                                    case -582435820:
                                                        str4 = "ۨۡۖۘ۬ۡۜ۠۟ۚۙۡۢۛۘۦۙۘۘۤ۬ۦۘ۫ۧۥۖۦۗۦ۠ۘۙۛ۠ۡۛۦۦۜۦۗۚۖۘ۟ۤۧ";
                                                        break;
                                                    case -571966813:
                                                        str4 = !m893().isFinishing() ? "ۖۤۖۛۧۧۙۛ۟۬ۗ۟ۤۡۥۧۢۘۘۘ۠۟ۘۘ۠ۛۖۚۙۛۧ۬ۖ۠۬ۨ۟۬ۨ۟۬ۖۖۘۘۘ" : "ۘۨۖۘۙۦۧۨۥۥۘۙۧۡۨۡۙ۠ۡ۠ۘ۟ۗۖۗ۫۫ۜۖۘ۫ۗۢۛ۫۬ۡۡۙۜۜۚۜۖ۟ۖۚۗ۠۠ۤ۠ۤۛۥۧۚ۬ۗۖ۫ۨۘۥۘۢ۠ۡ۟۫۟ۘۘۡۜۦۡۘۜۘۙ۫ۚۤۗۘ";
                                                        break;
                                                    case -413797560:
                                                        str3 = "ۧۛ۬ۗۘۢۤۜ۫۠ۛۖۘۨ۬ۙ۫ۦۙۧ۬ۜۖۡ۬۬ۚۤۛۡۘۦۖۡۡۦۛۜ۬ۗ۠ۚ۫ۥۡۘ";
                                                        break;
                                                    case 1105474417:
                                                        str3 = "ۛۗۧۢۜۧۘۡ۬ۛۙ۫۬ۗۚۜ۠ۥۧۖۚۧۡۧۜ۠ۧۜۘۤ۠۬ۘۘۢ۠۟ۧۢۡۗۙۢ۬";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -360863186:
                                            str2 = "ۥۙۙۢۦۘۥۥ۫ۨۨۘۘ۫ۧۦ۟ۦۨۢۢۘۘۘۘۙۗۨۚۘۘ۠ۢۛۗۗ۬۟ۤ۫ۡۘۙۦۧۘۛۘۧۦ۫ۥۥۡۜۘۨ۟ۜ۬ۥۥۘۜۨ۟ۡۧۤۦۘۘۚۤۘۤۤ۟ۚ۠۬ۖ۫ۖۘۡۧ";
                                            break;
                                        case -340580701:
                                            str2 = "ۥ۫ۨۘۚۤۤۘۜۤۙۧۜۘۧۖۖۘ۬ۙ۬ۘۘۙۧۜۘۧۥۙۢۚۨ۬ۢۤۘۗۚۚۚۨۨۛۡۥۘۢۨۥۥۧ۠ۧۨۤۥۦۛۘۗۛ۫۟ۛۘۦ۫ۥ۟ۡۙۚ۠ۦۛ۠۬ۙۖ۟ۘۖ";
                                            break;
                                        case 422270491:
                                            str3 = "ۜۜۤۦۢۨۘ۫۟۟ۡۧۛۗۤۖۜۖۜ۟ۜۘۘۗۧۙۖۧۜۜۦۧۘۜ۠ۖۘۢۗۜۘ۫ۖۨۢۧۤ۟ۖ۬";
                                            break;
                                    }
                                }
                                break;
                            case 169659292:
                                break;
                            case 298747985:
                                str2 = "۬ۚۜۗۨۤۜۦۘۧۖۧۗۚۡۜۤۤۧۗۗۙۡۥۘۥۙۡۘۨۤۗ۬ۨۙ۟ۙۡۘۖ۟ۗۙۦۗۛ۫ۘۖۡ۟۠ۦۡۥۨۘۘۘۧۡ۬ۖۢۙۛ";
                                break;
                        }
                    }
                    break;
                case -1635579597:
                    str = "ۢۧۜۘۚۨ۬ۧۘۡۡۙۥۘ۬۬ۦۘۖۜۖ۟۠ۘۘ۬ۚۘۗۢۙۘ۠ۘۘ۬ۨ۫ۡ۬۬۫ۖۚۖ۟ۨۦۗ۟ۤۤۥۘۡ۠۬ۨۛۥۗ۟ۚۗۦۨۘۦ۟۟ۧۖۡۘ۠ۦۗ۬ۛۘۘ";
                    z = z2;
                    continue;
                case -1157190823:
                    String str5 = "ۦۙ۬ۖ۬۬ۨ۠ۖۚ۟۫۬ۢ۫ۜۧۤۡۗۨ۠۫ۡۖ۠ۥۜۥۚ۟ۖۦۤۢۖۙۡ۟ۛۖۜۘۖۤۗۡۨۘۖ۫ۢۦ۬ۢۧۢۛۙ۟۬۫ۨ";
                    while (true) {
                        switch (str5.hashCode() ^ 1158093232) {
                            case -1682485876:
                                String str6 = "ۘۖۖۖۜۥۛۨۦۘۗۨۛۙۘ۬ۚۖۖۘۛۛۤۦۜۦۥۘۛۜۗۨۛۡ۬ۦۤۤ۟ۨ۬ۗۦۘ۬ۛ۠ۥۘ۫ۨ۬ۡۘ۟ۜۜۘۙۖۘۥۗۛۘۖۘ۫ۢ۫ۡۚۘۘۤۛۗ";
                                while (true) {
                                    switch (str6.hashCode() ^ (-237566319)) {
                                        case -1629567586:
                                            str6 = "۫ۘۘۘۨ۫ۜۖۜۙۙۥۥۧۙۨۘۤۢ۬ۙۥۥۦۢۦۘۛۨۘۘ۬۟ۖۦۛۖۙۧۛۚۙۦۤۘۢۥۢ۠ۥۨۗ۟ۛۡۜ۬ۨۘۥ۠ۥۘ۠ۡۦۘ۬ۤۧۧۤ۬ۧ۠ۛۜۤ";
                                            break;
                                        case -941288354:
                                            str5 = "ۤۙۘۙ۠ۙۡۜۨۦۖۜۘۡۧۘۛۦۖۘۢ۠۫ۜ۬ۡۘۢۨۚۘۤۦۘ۫ۢ۫۠ۖۚۜۥۘۘۧۨۜۖۦۥ۟ۥۖۛۗۘ۫ۧۡۘۜۛۥۘۢ۬ۚۤۤ۫ۛۡۥۘ۠ۛۡۘۨۤۥۘۗۖۦۗ۟ۥۘۚۢۨۘ";
                                            break;
                                        case -696486528:
                                            str5 = "۫ۖۤۖۡ۠۠ۧۢۧۘۘ۫۟ۘۘۜۜۨۘۡۨۛۚ۬ۥۡ۫ۦۘۨۧۙۛۘۡۘۛۡۤ۫۫ۖ۫ۤۗۢۦۖۘۗۘۘۘۨۢۙۖۥۦۦۘۙۚۗ۠ۛۜۧۘۦ۠۬ۢۜۥ۟ۛۡۘۙۤۖ۬ۦۤۦۢۨۘ";
                                            break;
                                        case 679939351:
                                            String str7 = "ۧ۬ۨ۠ۧ۫ۖ۬ۦ۠۫ۧۨ۟ۨۘۧۙ۬ۧ۬ۖ۬ۨ۟ۗۨۨۛۢ۟ۢۨۖ۠ۛۢۧۛۜۘۖۡۥ۠ۖۗۧۨ۠ۘۨ۟ۗ۟۬";
                                            while (true) {
                                                switch (str7.hashCode() ^ (-385519243)) {
                                                    case -1435095880:
                                                        str7 = !m893().isDestroyed() ? "۟ۗ۬ۜۛ۫ۥ۟ۚۜ۬ۨۜۢۚ۬ۛۗ۬ۨۘۙۢۨۨۗۗۚۧۚۤۥۘۙۨۚ۫۫ۛ۫۬ۦۘۛ۬۫ۦۚۨۘۧ۫ۨۘ۟ۜۧۥۦۤۚۛ۠ۡۗۡۘ" : "۟ۤۛۤ۟ۘۘۧۢۥۚۖۘۖۧۗۤۨۨۛ۟۠ۥۗۙۡ۟ۖۘ۫ۧ۫ۗ۟۬ۘۥۦۢۤۖۘۛۛۘ۬ۛۡۗۖ۫ۡۢۢ۬ۧۥۚ۠ۜۦۦۘ۠۫ۦۘۗ۟ۚۚۖ۫ۚۜۘۧ۠ۘۘۘۧۛۥۗۖۘ";
                                                        break;
                                                    case -1083973158:
                                                        str7 = "۠ۖۦۙۤۛۙۨۡۘۙۗۙ۬ۙۧۚ۟ۦۘۘۦۥۘ۟ۧ۟ۤ۫ۖۘۧۥ۟۬ۗۛۜ۫۬ۚۘ۬ۨۤۢ۟ۦۘ۠ۙ۫ۚۘۚۨۖ۬ۦۖ۠ۡۨۨۥ۟";
                                                        break;
                                                    case 104761369:
                                                        str6 = "۬۟۫۠ۦۘۡۗۖۜۘ۠ۗۙۥۘۢۥۢۙۜۙۦۘۘ۬ۨۨۘۚۖ۠ۚۘۥۚۙۨۖۢ۠ۢۗ۬ۡۧۘۧ۠ۤۢۦۦۘ۠۟";
                                                        break;
                                                    case 106303364:
                                                        str6 = "ۜۦۥۘۧۙۜ۫ۙ۠۟ۦۘۘۢۖۡ۠ۛۘۘۨۘۢۥۡۖۘۥ۠ۢۘۥ۟۫ۗۨۦۘۤۨۨۦۙۙۧۥۦۘۚۢۜۘۦۡۛ۟ۥۨ۬ۢۜۘۤ۟ۙۦۙۥ۠ۨۧۧۢۨۨ۠ۢ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case -850856098:
                                break;
                            case 1151756883:
                                str5 = "ۚۢۙۚۢۨ۠ۖۘ۬ۦۢۚ۠ۨۨۦۘۥۡۘۦ۬ۨۙۖۚۨۗ۬ۦۜۡ۟ۡۚۚۚۙۜۘ۠ۘ۬ۙ";
                                break;
                            case 1463709930:
                                str = "ۢ۠ۨۨۛۥۘۤۡۘۙۨۧۘۦ۫ۨۘۛۤۙۜۜۚۥۚۥ۟۠ۚۤ۠ۧۙۡۢۡۤۚۜۗۤۖۚۜۡۦۜۘۥۚۤۙ۫ۖۡۥۙۖۦۨۚۨ۫ۧۖۘ";
                                break;
                        }
                    }
                    break;
                case -583445671:
                    return z;
                case 858246353:
                    str = "ۦۜۦۥۘۙۗۖ۬۫ۜۨۘۚۡۦۘۙۜۗۛۡۡۘۡۡۜۘۢ۫ۨۘۥۦۧ۫ۦۘۘ۬ۦۘۙ۬ۦۘ۫۬ۤ۠ۦۚۛۥۥۚۨ۫ۛۘۛۙۥۘۡۚۦۧۗ";
                    z = false;
                    continue;
                case 986275346:
                    str = "ۦۜۦۥۘۙۗۖ۬۫ۜۨۘۚۡۦۘۙۜۗۛۡۡۘۡۡۜۘۢ۫ۨۘۥۦۧ۫ۦۘۘ۬ۦۘۙ۬ۦۘ۫۬ۤ۠ۦۚۛۥۥۚۨ۫ۛۘۛۙۥۘۡۚۦۧۗ";
                    continue;
                case 2109785143:
                    str = "ۚۧۘۘۜۤۧۛ۬ۦۘۧۘ۫۠ۨۥۘۙۢۤ۬ۢۛۡۜۗ۫ۜۨ۠ۧۡۤۖۥۤۘۡۚۖ۫۟ۨۜۡۛۘۘ";
                    continue;
            }
            str = "ۥۥۘۛۖۖۘۥۙۘۖۚۛۘۛۜۙۡۗۘۧۡۧۦۖۘ۠۬۬۠ۚۥۦۜۧۨۨۜ۫ۡ۫ۢۦۖ۠ۖۧۤ۟ۖۨۘۜۘۙۨۗۨ۟ۛۗۤۚۖۢۙۦۙۖۧۛۘۘۚۖۦۘ";
        }
    }

    /* JADX INFO: renamed from: ۥ۟ */
    public static Activity m893() {
        try {
            C0286kb c0286kb = AbstractC0356q.f1031;
            Object objPeek = AbstractC0356q.c.m920().peek();
            C0237h4.m1089("peek(...)", objPeek);
            return (Activity) objPeek;
        } catch (EmptyStackException e) {
            XposedBridge.log(new Throwable("Activity为空，退出"));
            System.exit(0);
            throw new RuntimeException("System.exit returned normally, while it was supposed to halt JVM.");
        }
    }

    /* JADX INFO: renamed from: ۥ۟۟, reason: contains not printable characters */
    public static ClassLoader m1137() {
        String str = "۬ۛ۟ۗۥ۬ۖۥۡۙۗۤۥۖۨۘۥۜۦۚۥۥۘۛۥۢۘ۟ۗۨۗۡ۠ۦۜۨۡۨۚۦۘ۠ۦۖۜۙۗۗۖۜۥۤۧۢۦۤۨۢۛۜۗۨۗۡۜۢۜۦۘۚۤۦ۟ۡۘۘۖۖ۬ۦ۠۠ۚ۫۟";
        ClassLoader classLoader = null;
        while (true) {
            switch ((((((((str.hashCode() ^ 408) ^ 699) ^ 117) ^ 52) ^ 812) ^ 853) ^ 39) ^ 1735417227) {
                case -802484415:
                    C0237h4.m1092("cl");
                    str = "ۙۥۜۘ۟ۜۘۘۗۗۢۥۗۡۢۘۦ۬ۛۘۨۨۤ۠ۜ۬ۧۗ۠ۦ۠ۦۚۛۦۛ۠ۖۘۥۤۛۤ۠ۢۥۖۛۛۜۖۙۘۦۗ";
                    break;
                case -82585015:
                    throw null;
                case -7774729:
                    classLoader = f938;
                    str = "ۧۦۘۘ۠ۙۜۤ۬ۨۜۘۗۚ۟ۛ۬ۥ۫ۖۡ۬ۡۚۜۘۗ۬ۨۙۨ۠ۤۗۥۚۥۗ۟ۜۧۘۢۘۡ۟۫۟ۗۡۚۚ۠ۨۘ۬ۙۥ";
                    break;
                case 1403739098:
                    return classLoader;
                case 1500022700:
                    String str2 = "ۛۚۥۦ۫ۧۢۡۖۘۧۦ۠ۚۨۙۥ۠ۨۙۜۧ۟ۜۤۘۢۘۦ۫ۙۖۜۢۦۖۨۘۖۥۜۤۛۘ";
                    while (true) {
                        switch (str2.hashCode() ^ (-1105447738)) {
                            case -1660449573:
                                str2 = "ۖۡ۬ۡۛۖۘۡۦۜۘۜۜۘۘۢ۫ۦۛۙۘۘۛۨۖۘۘۙۘۗۥۢ۬ۦۢۦۡۧۘۙۦۜۘ۫ۙۨۘۙۡۡۘۦۙۚۡۡۦۘۗۖۘۨۘۧۨۛۚۙ۟ۜ۠ۥ۬ۗۨۢۗۘۘۥۧۛۛۛ۫ۢۥۡ۟ۥۡۘ";
                                break;
                            case 305632503:
                                str = "ۘۢ۟ۢ۬ۙ۬ۥۙۚۦۢۖ۫ۗ۫ۚۦۘۧۘۖۘۧۥۦۗۖۖۘۡ۟ۦۘۚ۫ۡۘۨۖۜۥۖۘۘۜ۫۠";
                                continue;
                            case 417427712:
                                str = "۟۠ۢۜۖ۠ۡۚۤ۫ۗۜۛۧ۬۬ۛۘۛۢ۠۟ۡۤۤۥۘۜۚۡۡۥۚۥۡۥۨۛۦۨۙۚۛۢۚۢ۫ۙ۠۬ۜۘۛۛۖۖۚۗۙۗۗ۠ۨۦۘ۬۬ۥۘ۬ۨۗۘ۬۟ۗۜۘۘۗۥ۬";
                                continue;
                            case 1442230727:
                                String str3 = "۠ۗۥۘۨۜۤۡ۫۟ۤۨ۠ۡۧۘ۠ۙ۫ۘۚۡۘۜ۫ۘۤ۬ۚ۬ۜ۫۬ۛۗۜ۫ۧ۬ۨۘۦۘۦۥۢ۟ۦ۫ۥۡۢۦۤ۠ۜۚۙۡۙۤۜۢۤۥۥۚۨۘۦۗۢۜۢۜۛۨۡۙۡۥۥۢ۬";
                                while (true) {
                                    switch (str3.hashCode() ^ 1429747273) {
                                        case -1696361539:
                                            str2 = "ۡ۠ۛۘۨ۫ۤۨۘ۠ۘۡۘۘۥۥۘۙۚۧۘۦۤۙۛۜۘۖ۬ۥۘۜۨۡۘۤۜۦۚۡۜۜۥۦۙۜۥ۫ۨۘ۟ۨۖۦۦۢۛۛۜ۬ۤۦۘ۠ۗۗ۟ۥۡۘ";
                                            break;
                                        case -1621944196:
                                            String str4 = "ۘۨ۟ۨۖۘ۫ۛۥۘۧۗۜۘۚۧ۬ۦۚۡ۠ۜ۫ۧۖۘۘ۬ۤۙۤۗ۬۠ۨ۫ۘ۟ۡۧۘۚۛۜۘۢۢۙۛۘۨ۬ۜ۬ۤۥۘ۠ۜۖ۫ۡۘ۠۟ۦۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-657894247)) {
                                                    case -1103918014:
                                                        str3 = "ۢۙۤۧۜ۬ۡ۫ۦ۠ۜۤ۬۬ۡۘۢۜۡۘۛۗۖۢۤۘۘ۬ۘۧۘۗۘۥۘۢۨۜۘۚ۟ۚ۫ۢۘۘۨۙۚۜۙۥ۬ۗ۬۫ۧۘۘۗۖ۫ۧ۟ۨۥۘ۫۠۠ۘۘ";
                                                        break;
                                                    case -749731734:
                                                        str4 = "ۛ۟ۙۖ۟ۛ۟ۗۥۘۥ۟ۥۦۚ۟ۘۘۖۘۚۤ۟ۛ۬ۤ۬ۨۡۛۦۧۡۧ۫ۥۧۦۘۗ۟ۥ۠۬۟۟ۛۥۘۜ۬ۢ۟ۡۤۘۗۢۗۤ۟ۧۥ۫ۨۙ۫ۧ۠ۧ۟۫ۨۥۧۘ";
                                                        break;
                                                    case -287640316:
                                                        str3 = "ۢۗۗۖۥۡۘۜۧ۬ۛۜۜ۫ۙ۬ۧۡ۫۟ۜ۫ۜۥۦۘ۫ۢۧۧ۠ۚۦۤۜۘۖۜۦۘۜ۫ۦۙ۬ۦۙۚۦۚۚۦۘ۫ۥ۬ۧۡۤ";
                                                        break;
                                                    case -177849168:
                                                        str4 = classLoader != null ? "ۡۨۡۘۦۛۘۘۧۤۙۚۙ۬ۢ۟ۚ۫ۛۥۧ۫ۤۦۘۛۘۜۘۗۡۡۘۡۘۨۘۧۦۨۘ۠ۨۦۘۥۛۚۘۘۖۧ۠ۗۡۥۤۚۙ" : "ۗ۬ۢ۬۠ۦۘ۠۫۟ۨۙۨۜ۠ۤۛۤ۫ۢۙۖۘۥۜ۠ۛۦۚۢۦ۬ۤ۫ۗ۟ۢۛۦۖ۟ۘۘۤۘ۠۫ۙۦۘ۫ۗۘۘۢۗۖۘۨۤۡۚۜۜ۬ۥۡۢۛۦۥۚۦۛۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -809785451:
                                            str3 = "۠ۡۢۗۖۜۘۤۘ۠۟ۛۧۦۦۘ۫ۦۡۘۛۡۧۜۘۦۧۜۘۜۗۡۘۖ۠ۗ۟ۚۖۢۚۤ۟ۨۜۥۖۧۘ";
                                            break;
                                        case -164059464:
                                            str2 = "ۜۥۦۘۙۤ۟۟۬ۛ۬ۘۨۘ۠ۗ۬ۙ۠۟ۗۚ۠۠ۡۖۘۨۦ۫ۢۧۜۘۥ۟۫ۦ۟۟ۥۦۥۤۤۥۘ۫ۧۢ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟۠, reason: contains not printable characters */
    public static Context m1138() {
        String str = "ۖۖۧۙ۫۫ۚۗۘۘۜ۫ۘۘۜۚۖۘ۬۫ۦۖۚۦۗ۠ۧۙ۠ۖۛ۠ۘۡۧۥۖ۟ۗۨۘۘۘۖۙۜۘۛۦۨۤۨ۠۠ۗۧۡۧۘۤۘۥۘۘۡۙۖۘۖۘ۠۬ۧ۠ۛۡ۫ۘ۫";
        Context context = null;
        while (true) {
            switch ((((((((str.hashCode() ^ 110) ^ 213) ^ 449) ^ 867) ^ 644) ^ 711) ^ 26) ^ (-1762320170)) {
                case -2099807976:
                    context = f937;
                    str = "ۥۜۨۘۚ۬ۤۚۛ۫ۘۨ۫ۢ۟ۙۜۖۘ۟ۧ۬ۖۥۨ۬ۤۢۚۛۥۢۗۜۤۙۗۡۨۚۢ۠ۡۨ۫ۢۨۜۘۛ۟ۦۘ۫ۦۢۜۗۤۤۜۨۘ۬۬۫";
                    break;
                case 1129831068:
                    throw null;
                case 1205225180:
                    return context;
                case 1511389574:
                    C0237h4.m1092("context");
                    str = "ۤ۟ۥۘۛۧۗ۠ۖۘۘۗۛۛۗ۟ۜۘۛۖۤ۬ۗۘۘ۬۫ۜۘۨ۟۠۫ۤۜۘ۠ۗۘۘۡۥۜۖۧ۟ۙۖ۬ۤۘۘۘۤۚ۟ۥۖ۟ۚۖ۫۠ۚۜۘۥۦ۟۟ۗۡۘۦۚۜۨۗ۬۬ۙۦۡۛۢۢۛۖۘ۠ۧۜ";
                    break;
                case 2090608856:
                    String str2 = "ۖۛۡۧ۫ۛۡۡۦ۠ۧۥۘ۠ۥ۟ۘۙۦۘ۫ۥۢ۟ۜۘۖ۠ۢۜۙۦۘۢۗۤۗۧۚ۬ۦ۟۟ۖۥۜۗۘۘۖ۟ۨ۟ۗۛ۠ۤۙ";
                    while (true) {
                        switch (str2.hashCode() ^ 1366308883) {
                            case -1180494913:
                                str = "ۛۗۙۚۨۢۗۗۜۘۥۘ۬ۘۨۙۧ۫ۖۘۖۗۧۖۥۜۗۦۤۧ۟ۜۡۧۖۘ۠۬ۗۡۢۥ۟ۡۗ۟ۜۜ";
                                continue;
                            case 401899090:
                                str2 = "ۚۜۥۘ۠ۙۛۗۗۨۖۖۢۧ۫ۦۨ۟ۗ۟ۡۡۤۙۨۚۨۡۘۗۖ۬ۧۧۗ۟ۗ۬ۛۥۘۡ۬۠ۜۥۛۙۛۥۧۥۧۘۚ۫ۥۙۚۖۘۙ۬۟ۨۨۛۤۗ۟۬ۛۡۘۧۗۨۘۥ۠ۡۘۨۡۦۘۥۗۚ";
                                break;
                            case 492311906:
                                str = "۬ۜۘۥۤۖۚۨۥۘۡۨۨۘ۬ۚ۫۠۟ۡۛۜۡۨ۬ۡۘۧ۬۠۟۟۫ۥ۫ۥۨۗ۠ۗۡۘ۫ۨۜۘۧۢۜۚۨۖۜۙۜۘۥ۟";
                                continue;
                            case 1237603125:
                                String str3 = "۠ۥۖۘ۠ۛۙۛۙۖۨۜۗۥۨۥۘۥۡۛۥ۬ۗۢۙۖۘ۠ۥ۠ۛۧۜ۠ۦۥۡۦۘۘ۫۬ۖۘۘۨ۠ۨ۫ۤ۬ۥۖۘۘۨۗۗۥ۫ۛ۫ۦۧۗ۫ۗۙۦۜ۟ۦۤۚۢۘۖۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-899258292)) {
                                        case -714027160:
                                            String str4 = "ۥ۠ۛۜۘۖۘۙۖۥ۫۬ۡۘ۫۬ۛ۬ۙۥۛ۬ۧۡ۫ۢ۫ۛۘ۠ۢۘۘ۬ۥۤۤۚۘۘ۫ۚۘۘۙۙۘۥۘۥ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 967641457) {
                                                    case -1395885182:
                                                        str3 = "ۜۢ۬ۘۦۥۘۦۥۖۘ۫ۜۗ۟ۦ۠۬۬ۥۘۨ۬ۥۜ۫ۗۢۥۛۙۛۚۡ۟ۘۘۥۘۥۙۥۜۧۡ۟۬ۗۗۡۚۤ۟ۗۢۥۨۡۘۚۨۗۖۚۜۙۜ۬";
                                                        break;
                                                    case -1048503642:
                                                        str3 = "ۨۨۨ۫ۚۘۨ۫ۡۢۤۥۘ۠ۥ۟ۗ۬ۜۘ۟ۙۤۙ۫ۢۨۨۨۘۗۤۦۛۦۘ۟ۦۜۛۘۘۧ۫ۜۛۥ۬ۢۜۛۜۜۘ۟ۨۨۘۗۛۨۘۥۡۥۚ۠ۘۙۗۚ۠ۖۜۘۧۢۗ";
                                                        break;
                                                    case -703915053:
                                                        str4 = context != null ? "ۧۚۦۘۦۨ۫ۗۧ۫ۗۢۗۛۚۧۗ۠۠ۥۜۘ۬ۦ۬ۡۡ۠ۘۧ۬۫ۥۥۘ۠ۧۨۘۖ۟ۚۛ۟۫۠ۙۤ" : "۫۟۬ۘۡۦۘۨۢۧۚۘۚۡۙۖۙۡۨۘ۫ۦۨۘۜۧ۟ۜۦ۠ۛۜۛۤۚۡۧۢۦۨ۟ۜۨۢۢۚۥۘۤۖۦ۠ۡۥ۠ۥۡۚۜ۟ۡ۠ۖۢ۠";
                                                        break;
                                                    case -650367506:
                                                        str4 = "۟ۖۙۨۢۙۥۧۡۥۙۥۙۥۘۢ۫۠ۛۥۨ۟ۙۘۙۦۘۘ۠ۡۥۚۜۘۖۨۤۢۘ۫ۢۨۘۡۧۡۦ۫۠ۢ۠ۚۥۨۜۗ۬ۧ۬ۡۜۜۖۨۘۙ۬ۘۘۢۡۚۜۥۜۗۥۡۘۤۖۗۛۦۥ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -546830366:
                                            str3 = "ۚ۠ۖۦ۠ۛ۬ۙۡۖۗۛ۠ۗ۬ۡ۟۟ۦۚۧۘۥۨۦۦۖۘۖۤۢ۟۫ۦۘ۟ۢۢۖۨۗۦۢ۟ۗۛۦۘۥۨۜۡۨۖ۟۟ۥ۬ۢۖۤ۠۬ۤ۟ۥۘ";
                                            break;
                                        case -408562541:
                                            str2 = "ۥۦۗۚۗۖۘ۬ۢۘۖۥۥ۟ۡ۫۫ۥۡ۬۫ۧ۟ۨ۬ۦ۠ۥۘۥ۠ۤۢۛۡۛۛۙۧۖۢۛ۠ۡۦۘ۬ۛۦۘۤۤ۫ۤۖۗ";
                                            break;
                                        case 946390277:
                                            str2 = "ۦۚۖۜۛۨۙۥۡۘۤۡ۟ۥۢۦۨۥ۠ۥۦۘۧۢۢۗۚۙۛۚۡۢۖۘۘۗۦۨۘۘۗۦۘۘۡۘۘۡ۟ۜۘۦۚۗۚۗۡۘۦۦۚۙۧ۟ۤۗۗۗۗۜ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۡ, reason: contains not printable characters */
    public static String m1139() {
        String simpleName = null;
        String str = "۫ۖۖۧ۫ۨۗۧۙۧۦۤ۫۠۬ۨۥۢۥ۬ۡۛۜۡۘۛۛ۫۟ۙۗۤۢۥۘۘۦ۟ۤۗ۠ۛۛۚۥۗۡ";
        while (true) {
            switch ((((((((str.hashCode() ^ 583) ^ 310) ^ 994) ^ 850) ^ 50) ^ 551) ^ 294) ^ 1306965705) {
                case -144134438:
                    "getSimpleName(...)";
                    str = "ۘۡۤ۠ۦۢۚۧ۬ۥۚ۬ۢۨۥۢۜ۬ۤۦ۫ۥ۟ۦۨۛ۟ۨۡۘۡۜۖ۠ۜۘۡ۠ۚۦۡۨۘ۠ۚۘۦۦ۠ۘ۟ۜۘۚۖۥۤۧۢۥۜۘۦۡۗۦۗ۟۫۫ۜۘۜۜۚۨ۠۟۟ۧۜۘۢۡۡ";
                    break;
                case 363611320:
                    simpleName = m893().getClass().getSimpleName();
                    str = "ۤۖۖۘۨۙۢۗۖۧۜ۫ۨ۬ۤۤۡۨۡۢ۠ۦۘۘۤ۬۠۟ۘۜۚۜۚۙۦۡ۠۫ۜۙ۟ۗۦ۬۬ۡۨۘۛۙۜۙۨ۠ۡ۫ۙۨۗ۬۬ۥۘۙۥ۬ۧۢۖۘۧۛۜۘ۬ۧۥ۫ۧۘۥ۫ۜ۬ۥۧۘ";
                    break;
                case 1088524987:
                    return simpleName;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۢ, reason: contains not printable characters */
    public static String m1140() {
        String str = "۬۟ۙۡۘۙۤۧۗۥۨۨۘۚۧۖۜۛ۟۠ۧۢۗۤۡۘۡۜۨۥ۫ۦۦۗۚۧۧۥۘۢ۫ۗۨ۬۫ۚۜۖۚ۟۫ۧ۠۠ۥۥۖۘۤۥۨۘۡۛ۟ۗۥ۬";
        String str2 = null;
        while (true) {
            switch ((((((((str.hashCode() ^ 469) ^ 26) ^ 994) ^ 218) ^ 397) ^ 183) ^ 24) ^ 1394603292) {
                case -1928664980:
                    C0237h4.m1092("vn");
                    str = "ۢۦۡۢۨۢۛۤۗۢ۬۬ۤۨۤ۠۠ۚۘۨۧ۫۫ۘۘ۬ۜۥۛ۟ۨۘۡ۠ۘ۫ۧۚۢۨۘۤۙۖۘۥۙۡ۠۠ۚ۟ۦۡۚۦۚۤۖۥۘۥۗۨۛۧۢ";
                    break;
                case -821729694:
                    throw null;
                case -255028865:
                    String str3 = "۠۠ۡۘۘۡۘۥۦۘۧۨۗۘۨۡ۟ۗۥۘ۬ۡۖ۟۠ۘۥۦۧۘ۬۫ۜۘۤ۠ۖۙۧۘۘ۫۠۠ۧۜ۬۫۬ۚۚۡۢۘۚۗ۟ۡ";
                    while (true) {
                        switch (str3.hashCode() ^ 1119157752) {
                            case -999337834:
                                str3 = "ۖۖۥۘۜۛۘۧ۬۬۬ۨۘۗۙۨۘ۫ۦۖۘ۬۠ۢ۫ۛۖۖۤۜۘۡۡۖۙۚۢۜۨۥۘۢۚۘ۠ۘۘۥۢۤ";
                                break;
                            case -556742959:
                                String str4 = "۟ۨ۬ۨۥۘۛۛۗ۬ۨۖۘۘ۫ۡۘۛۗ۠ۧۘۦۘ۬ۥۤۡۘۤۢۖۡۜ۟ۜۘۢۤۡۘ۬ۧ۠ۡۖۡۘۙۚۨۧۤ۫ۚۤۗۗۜۘ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1543876461)) {
                                        case -1672845432:
                                            String str5 = "ۙۦۙۗۥۚۛۙۤۧۧۚۘۖۦۢۥۖۨ۟ۧۦۥۘ۟ۛۡۘۛۗۖۘۢۙۦۘ۫ۤ۠ۙۤۖۘۨۧۖۖۧۘ";
                                            while (true) {
                                                switch (str5.hashCode() ^ 1954270049) {
                                                    case -1792418813:
                                                        str5 = str2 != null ? "ۡۜۚ۫ۙ۟ۢۚۜۘۤ۠ۗۖ۠ۧۙۚۙ۬۟ۜۧۘۙۚۚ۬ۧۡۘۗ۫ۥۘۜ۫ۢ۫ۗۚۦۦۚۖۦۖ۬ۚۤ۬ۧ۬ۧۧۜۘۡۚۗۤ۫ۢ۟۬ۡۘۘ۬ۗۙ۠ۦۦۡۚۘۘ۟ۨۚ۫۬ۨۘ" : "ۛۙۜۚۧ۬۬ۤۢۛۡ۠۠ۜۜۙ۫ۘۢۜۧۥۜۗۢۛۧ۟ۧ۬ۖ۬ۘۘۗۜۙۤۘۧۨۢ۫ۗ۟ۨۘۡۡۧۡۦۢۘۨۘۖۘۜ۬ۚۢۤۢۤۦ۠ۘۦۖۦ۠ۡۘۧ۬ۨ۠ۗۛۢ۫ۛ";
                                                        break;
                                                    case -1389506623:
                                                        str4 = "ۙۤ۫ۗۦۦۥۜۨۤۜ۟ۦ۫ۜۖۘۘۘ۫۠ۨۛۥۥۘ۟ۧۨۙۡۘۚۛۦۘۗ۟ۦۘۢ۬۟ۥ۟۫ۛ۫ۛ۬ۚۥۘۚ۬ۛۤ۫۬ۖۗۖۡۛۢۗۤۧۚۥۘۛۗۨۘۢۢۧۧۖۘ۠ۖۥۗۜۨۘ";
                                                        break;
                                                    case 122858791:
                                                        str5 = "ۚ۬ۥۘۙۢۛۖۧ۫ۚ۟ۖۜۛۜۘ۟۬۬ۤ۠ۚۚۛ۟ۚۦ۟۠ۘۖۘۤۖۘۘۜ۫ۖۘۙ۫ۙۗۡۜۘۘۢ۠ۡۦۨۖ۠ۤ۫ۙۜۗۦۧۘۜۚۜۘۧۚۚۤ۠ۙۗ۬ۨۘۗۢۤۡۜۜۚۢۦۘ۫۬۠";
                                                        break;
                                                    case 662967019:
                                                        str4 = "ۘۛۦ۟ۛۙۖۨ۠ۗۡۧۥۤ۟ۥۥۘۛۦ۠ۗۤۗۖۡۡۘۦۡۙۤۡۡۘ۠۠۫ۘۙ۫۠ۘۘۢۛۙ۠ۧۘۥۦۘۚۖۥۗۤۥۘ۬ۛۗ۠۠ۦ۠۟۟ۖۥۜۜۡۢ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -66466373:
                                            str4 = "ۦ۠ۖۧۥۖۘ۠۟ۡۘۤۛۖۤۨۜۘۤۙۡۢ۬ۜۘۧۨۦۘۛۗۚ۠ۜۨۘ۠۟ۛۜۖۗۧ۫ۨۘۧ۫ۜۘۘۢۘۘۛۛۦۡۙ۫۬ۖۦۘۗۜۥۘۘۡۥۘ۬ۙۙ۠۠ۘۘۦۧۥۘۢۥۧ";
                                            break;
                                        case 705914881:
                                            str3 = "ۧ۟۠ۚۜۛ۠ۖۦۚۦۘ۬ۨۧۘۡۦۘۢۤۡۘۨۛۨۘۧ۬ۨۘ۟ۢۙۡ۬ۨۚۤۖۜۨۘ۟ۦۥۥ۬۫ۘ۬ۗۦۚۜۘۘۗۨۘۚۥۦۜۦۘۦۚۜۘ";
                                            break;
                                        case 1314895446:
                                            str3 = "ۥۡۡۘۢۜۘۘۡ۟ۗۧۘ۫۟۠ۦۥۜۖۤۜۖۘۖۢ۫۫ۙۖۘ۫ۙۘۘ۬ۤۥۘۡۜ۠۠ۥۢۜۚۛۥۚ۠";
                                            break;
                                    }
                                }
                                break;
                            case -298966860:
                                str = "ۡۜۦۘۨ۠ۥۘۤ۬ۨۘۥ۬ۚ۟ۜۡۖۚۦۘۥۧۨۘۖۖۜۢۚۘۤۖۛۖ۠ۨۗۜۢ۫ۧۨۘۢ۠ۨۘۖۡۤۥۗۙ۟ۛۡۨۘۗ";
                                continue;
                            case 1640981705:
                                str = "ۚۘۖ۬ۛۖۘ۬۟ۚ۟ۛۙۨ۟ۛۖۦۘ۬ۙۥۘۘۤۥۘۦۧۡۡۢۖۜۘ۫ۡۦۦۜۥۘۗۘۖۗۡۖۘۗۗۡۘۖ۬ۦۘ۟ۙۤ";
                                continue;
                        }
                    }
                    break;
                case -53280775:
                    return str2;
                case 1990261781:
                    str2 = f1685;
                    str = "ۚۦ۫ۖۜۙۖۡۤۦ۬ۜۘۖۜ۬ۘۜۢۚۡۧۘۙۗۥۧ۫۫ۢۖۥۘ۠ۘ۬ۚۗۥۜۚۗۛۨ۬ۗۖۜۘۚۧۘۘۗۛۢۦۢۗۦ۟ۢۨۡۘۡۦ۫ۚ۟ۙۙۚۜۗۘ۠ۗۨۨ۟ۤۘ۟ۨ۠";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥۣ۟, reason: contains not printable characters */
    public static void m1141(InterfaceC0222g3 interfaceC0222g3) {
        String str = "ۛۛۖ۠۟ۗۖۥۖۘ۟ۙۜۘ۫ۙۜۘۦۥۙۚۜ۬ۤۖۤ۬ۤۗۧۙۡۘۚۥۖۙ۬ۡۘۘۢۘۘۜۨۨۘۚۖۘۘۘۗۗۖ۫ۥۘۖۘۥۘۖ۬ۜۤۨۖۢ۟ۘۨ۟ۦۘۢۚۗ۬ۨۜۘۛۡۘۨۤۦۨ۠ۧ";
        while (true) {
            switch ((((((((str.hashCode() ^ 404) ^ 970) ^ 312) ^ 603) ^ 603) ^ 223) ^ 469) ^ (-733914799)) {
                case -1883049352:
                    String str2 = "ۤ۟ۢۖۤۖۜۖۗۗۥۘۗۛۨۘۜۦۧۙۙ۠ۨ۟۠۬ۧۚۡۢۦۙۧۥۢۦۘۛۦۢۧۡ۠ۦ";
                    while (true) {
                        switch (str2.hashCode() ^ (-1863946632)) {
                            case -1502327493:
                                str = "ۚۨۦ۟ۛۨۘۡ۟ۙۗۘۗۜۢ۫۠ۦۚۘۛۡۚۗۖۗۡۤۤۜۦۨۖۦۚۜ۬۠ۢ۠ۚۙۧ۫ۨۘ۬ۢ۠۬ۘۦۘۚ۠ۜۨۛۤۜۦۧ";
                                continue;
                            case -1198367542:
                                str2 = "ۖۦ۫ۘۤۜۘۨۥۨۘ۬۟ۤۙۦۙۜۡ۫ۜۜۡۘۨۢۦۘۦۘۢۤۜۡۡۦۗۗۜۖ۬ۧ۬ۤۘۥۦۜۡۙۧۘۘ۟ۙۘۘۦۤۦۖ۟ۘۘۤۤۢ۫۟ۚۜۙ۠۠ۖۗۛۙۗ";
                                break;
                            case -333428824:
                                String str3 = "ۖۡۧۘۙۖۤۥۨ۬۫ۛۗ۫ۖ۬ۥۧۢۦ۟ۖۜۘ۫ۜۨۦۘۖۘ۬ۡۨۚۗۦۢۛۤۢ۟ۡۘ۫۠ۜۜ۠ۖۘۡۙ۟ۙ۠ۡ۫ۦۨ۬ۥۦۘۤۖۥۥۘۜۧۖۘۜ۬ۦ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-887790938)) {
                                        case -1022739280:
                                            str2 = "ۖۜۡۘۢ۫ۥۙۘۨ۟ۗۥ۫۫۫۠ۡ۟ۦۡ۟۠ۘ۬ۗۤۨۦ۫ۥۦۦۘۗۖۘۖۖ۬۟ۡۥۘۗۖۧ۟ۡۤۥۗۢ۬ۘ۫ۙ۠ۦۘ۠ۛۦۘۡۢۖۤۜۚۤ۠ۢۙ۠ۥۥۤ۟ۧۡۙۡۖ";
                                            break;
                                        case -222171511:
                                            str3 = "ۘ۠ۖۖۡۖۘۙ۟ۦۙۖۘۜۡۡۘۤۢۦۘ۬ۧۘۢۜۧۘۨۤۖۧۦۦ۠ۚۦۘ۫ۙۢۢۢۥۘ۠ۚۤ۫ۡ۠ۙۢۡۙۥۨۙۚۥ";
                                            break;
                                        case 172140350:
                                            str2 = "ۡۛۚۡۤۨۘۤ۫ۘۗ۫۬۟ۙۧ۬۠ۚۨۘ۠۠ۦۘۢۦۨۘۛۛۧۙۚۨۘۡ۟ۦۙۜۘۥۘۘۥ۬ۤۙۚۢۨۢۙ۬ۖۧۘۡۙۚۡۘۙۗ۬ۜ۠ۖۨۧۡۘۜ۠ۜ";
                                            break;
                                        case 446504012:
                                            String str4 = "ۥۤۦۘۢۥۨۜۡۡۘ۬ۤۢۗۚۚۛۚۖۧۚ۬ۗۘۚۖۥۘۙۘۨۧ۬ۨۤۖۨۘۖۦۙۥۙۥۤ۫ۜ۟ۨۡ۫ۤۧۧۧۡ۠ۢۖۘۧ۟۫ۢۨ۫ۧۗۘۘۢۘۦۤۦۡ۠ۤۡۘۨۛۨۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-101027197)) {
                                                    case -2091689957:
                                                        str3 = "ۡ۫ۘۘۜۖۡ۫ۤۨۘۧ۟ۥۢۢۘۢۦۥۗۗۗ۟۫ۚۚۖۖۨۖۘۘۘۡۗ۟۬ۥۧۖ۟ۥ۟۟ۚۘ۬ۜۤۜۘۛۚۡۘ۠ۨۖۘ۟۫ۖ۠۫ۗ۬ۥۖۘ";
                                                        break;
                                                    case -1978529982:
                                                        str3 = "ۗۖۦۧۙۖۘۢۢۨۘۛۢۦۘ۫۠ۖۚۢۘۚ۟ۦۖۨۘۤۖۨۘۧۜۨۛ۬ۢۜۘۛۤۢ۟ۙ۬ۛۨۜۘ";
                                                        break;
                                                    case -1157056309:
                                                        str4 = "ۗۥۜۘۜۖۛ۟ۧۖۘۨۥۥۧۢۙۤۡ۫ۥۜۖۥ۬ۗۖۜۘۨۡۥۨ۠ۧۥ۟ۜۘۦۢۤ۫ۨ۫ۗۤۡۘ۬۟ۜۧۗ۬ۛۧۜۚۚۘ۠ۢ۬ۚ";
                                                        break;
                                                    case 209281727:
                                                        str4 = m892() ? "ۤۨۡۘۘۧۡۙۘۢۖۧۛۡۘۡۘۤۘ۬ۢۥۚۥۤۤ۬۬۫ۤۖۚۖ۠ۗ۟ۢۨۘ۫ۧ۬ۚۤۡۘۧۜۜۘۚۢۤ۟ۤۦۘ۫۫ۜۜ۫ۦۘۢۚۢۦۧ۟۫ۨ۠ۨۖۘۘۢ۫۫" : "ۡۡۖۙۤۖۘۦ۬ۨۘۧ۫ۡۘ۬ۧۛۨۗۦۖۡۧۜۜۘۙۖ۟ۢۨۨۥۚۧۢۛۖۘۚۡۧۘۨۛۥۤۤۤۚ۠ۢۧۚۢۜ۠۠ۚۢۙ۬۠۠ۙۧۨ۟ۖۗ۠ۥۧۦۧۖۘۙۘ۠ۦۘۛۡۥۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 1649247301:
                                str = "ۙ۬ۖۘۙۖۧ۠ۛ۠ۨۙۨۘۜۗۙۙۙۚ۠ۛۥۢۧ۫ۧۦۙۢۧۙ۬ۗۖۢ۠ۨ۠ۡ۫ۘۜۨۦۚۖۧۦۡ۠ۖۚۛۛۡۖۗ۟۟۟ۧ۬ۧ۫۟ۦۤۥۘۙۘۥ";
                                continue;
                        }
                    }
                    break;
                case -1815986751:
                    m893().runOnUiThread(new RunnableC0278k3(interfaceC0222g3, 0));
                    str = "ۙ۬ۖۘۙۖۧ۠ۛ۠ۨۙۨۘۜۗۙۙۙۚ۠ۛۥۢۧ۫ۧۦۙۢۧۙ۬ۗۖۢ۠ۨ۠ۡ۫ۘۜۨۦۚۖۧۦۡ۠ۖۚۛۛۡۖۗ۟۟۟ۧ۬ۧ۫۟ۦۤۥۘۙۘۥ";
                    break;
                case -151726436:
                    str = "۟ۡ۠ۛۛۜۘۥۚۨۘۚۦۗۛۦۦۛ۠ۖۘۜۤۜۘۦۘۨۘۡۤۥ۬ۥۦۘ۬ۙۖۘ۟ۢ۟ۧۡۦۘ۟ۛۖۘۙۘۡ۫ۗۨۖۧۡۧۡۜۜۦۨۧۜ۟۟ۙۖۘ";
                    break;
                case 660175975:
                    "action";
                    str = "ۚۨۧۙۧۧۙۤۘۘۙۤ۬ۙۗۡۘۥۙۘۘۘۜۙۨۦۚۙۜ۠ۨ۟ۙۘ۟۬ۙۢۧ۟ۗۖ۫ۥۦۘۡۙۨۛ۬۠۫ۘۘ۟ۧۨۘۤۡۦۘۥۚۡۘۨۥۜۤۖۘۘۘ۠ۥ";
                    break;
                case 1879131385:
                    return;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۤ, reason: contains not printable characters */
    public static void m1142(int i) {
        String str = "ۤۙۜۙۚ۠ۚۚۗۡۖۡۖۥۖۤۢۥۛۗۧۧۗۥۘ۬۟ۡۡ۟ۦۘۚۥۥۘۨۨۦۗۛۢۤ۬ۗۥۚۧۨۨۧۙۦۗۘۥۘۤۤۡۚۛۨۘۡۢۡۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 935) ^ 327) ^ 538) ^ 664) ^ 486) ^ 59) ^ 173) ^ 873359582) {
                case -439501458:
                    return;
                case 1690569716:
                    str = "ۖۙۜۡۡ۬ۘۧۘۘۢۧۜ۠ۦۧۘۧ۠ۨۘۨ۠ۜۨ۬ۜۦ۠ۚ۫ۧۨۗۦۢۡۙۦۘۘۡۦۘ۫ۢۢۡ۬ۛ۟ۘۙۦۧۛۦۥۡۘۨۢۙۗۗۦۘۛۢ۠ۤۡۤۨ۠ۘۘۘ۬ۚ";
                    break;
                case 1769278059:
                    f1687 = i;
                    str = "ۗۡۙۘ۬ۥ۠ۚۘۜ۫ۤۜۡۨۘ۬ۦۗۡۗۘۘۙ۬ۡۥۚۡۧۖۖۚۧۡۖۙۥۥۚۥۚ۫ۨۘۤۧ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۥ, reason: contains not printable characters */
    public static void m1143(Context context) {
        String str = "ۢ۟ۡۨۘۜۨۚۨۘۛ۫۫ۨ۬ۨۘۡۗۥۘۧۙۙۙۤۦۘ۫ۨۡۘۘۘۥۛۢ۟ۖۜۛۡ۫ۨۨ۬ۤ۫ۜۘۡ۟ۧ۬ۚۖ۟۫ۖۘۥ۬ۘۘ۟ۦۧۘۗ۠ۙۢۛۨۘ۬۬ۖۜۡۘ۠ۘۤۚۥۥۘ۠ۙۦۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 247) ^ 315) ^ 732) ^ 738) ^ 450) ^ 287) ^ 483) ^ (-969817040)) {
                case -1686468188:
                    str = "ۜۦۧ۟ۗۥۘۨۘۤ۬ۘۘۗۙۢۜ۠ۖۘ۫۟ۦۗ۫ۡۘۡ۫ۨۤۚۤۢۨۦۨۚۘۘۘۗۚۤۨ۠ۥۡ۟ۙ۬ۖۦ۫ۥۘۥۡۚ";
                    break;
                case -70923455:
                    f937 = context;
                    str = "ۥۦۜۘۢۘۢۦۦۘۙۤۧۥۗۛۤۜۨۨۡ۟ۜۜۡۘ۬ۘ۬۫۠ۨۡۦۗۚۥۤۘۘۘۘۧۖۙۖۚۖ۟ۥۘۧۜۘۤۨۚۨۖۧۛۦ۟ۘ۟";
                    break;
                case 1878783806:
                    return;
                case 1990862630:
                    C0237h4.m1090("<set-?>", context);
                    str = "۠ۛۤۦۢۡۘۡۙۖۙ۫ۥۘۥۘ۟۫ۨۖۦۤۜۤۚ۠ۦۜ۬ۥۦۨۘ۟ۡ۬ۗ۬۫ۦۚۙۛۖۖۘۜ۬ۜ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۦ, reason: contains not printable characters */
    public static void m1144(String str) {
        String str2 = "ۢۘۚۘۧ۬۟ۤۖۘۧۤۡۙۡۛۛ۬ۛۥ۠ۖۜۡۖۘۡۛۦۨۘۘ۬ۥۡۘۚۚۨۘۤ۫ۡۘۜۤ۠ۛۨۘۖۧۖۘۢۡۦۤۥۚۧۖۨۘۤۤۥۘۘ۬ۦۘۧۦۗ۬ۦۘۛۦۦ۟ۥۧۙۥۨ۠ۧ";
        while (true) {
            switch ((((((((str2.hashCode() ^ 433) ^ 455) ^ 203) ^ 561) ^ 599) ^ 865) ^ 516) ^ (-1464082529)) {
                case -685319329:
                    "<set-?>";
                    str2 = "ۜۙۧ۠ۢۨۦۨۨۛ۟۫ۢۦۥۘۖۗۘۡۧۘۜۙۘۘۡۨۖۘۛ۬ۗۖۨ۠ۘۘۡۖۧۜۡۥ۟۫۟ۨۘۗۙۧۗۨۢۢۥۘۘۨۘۘۢۛۧۙۢۡۘۧۖۥ۫ۨۘۘ۟ۘ";
                    break;
                case -621574553:
                    str2 = "ۘۡۘۘۨۚ۟۟ۗۡۘ۠ۜۥۘ۬ۘۥۦۛۡۘۖۡۙ۠ۙۙۗۥۖۘ۬ۘۘۦ۬ۦۘۖۖۡۡ۠ۥۘۖ۟ۦۘۡۗۦۘۖۦۘۘۖ۬ۜۗۖ";
                    break;
                case 545010804:
                    return;
                case 1038059646:
                    f1685 = str;
                    str2 = "ۦۦۖۘۥۖ۫۟۬ۨۘ۬ۤۧۦۦۦۘۙۚۢۛۚۜۘۡۗۥۘۢۛۜۧۘۤۙۥۛۦۜۘۨۡۘۖ۟ۘۘۦ۬۠۟ۡ۬ۖۧۥۘۥۚ";
                    break;
            }
        }
    }
}
