package p001;

import android.os.Bundle;
import android.view.View;
import de.robv.android.xposed.XC_MethodHook;
import java.util.Set;

/* JADX INFO: renamed from: ۟.lb */
/* JADX INFO: loaded from: classes.dex */
public final class C0300lb extends AbstractC0484za {

    /* JADX INFO: renamed from: ۥ۟ */
    public static final String f946;

    /* JADX INFO: renamed from: ۥ۟۟, reason: contains not printable characters */
    public static final String f1689;

    /* JADX INFO: renamed from: ۥ */
    public Set<String> f947 = C0207f2.f778;

    /* JADX INFO: renamed from: ۟.lb$a */
    public static final class a extends AbstractC0335o4 implements InterfaceC0222g3<XC_MethodHook.MethodHookParam, C0433vb> {

        /* JADX INFO: renamed from: ۥ */
        public final C0300lb f948;

        public a(C0300lb c0300lb) {
            this.f948 = c0300lb;
        }

        /* JADX DEBUG: Method arguments types fixed to match base method, original types: [java.lang.Object] */
        /* JADX DEBUG: Return type fixed from 'java.lang.Object' to match base method */
        @Override // p001.InterfaceC0222g3
        /* JADX INFO: renamed from: ۥ۟۟ */
        public final C0433vb mo984(XC_MethodHook.MethodHookParam methodHookParam) {
            String str = "ۜۚۤۥ۫ۙۖ۠ۧ۬۠ۜۘۖ۠۫ۜۡۘۘۢۤ۟ۖۙۧۥۦۢۦۘۥۘۨۨۘۘۛۘۖۡۛۥۘۘۨۗۛۨۜۘ";
            String str2 = null;
            Set<String> set = null;
            String str3 = null;
            Set<String> set2 = null;
            View viewM1159 = null;
            C0300lb c0300lb = null;
            XC_MethodHook.MethodHookParam methodHookParam2 = null;
            while (true) {
                switch ((((((((str.hashCode() ^ 153) ^ 286) ^ 984) ^ 131) ^ 454) ^ 745) ^ 17) ^ (-530559547)) {
                    case -2037876940:
                        C0237h4.m1090("it", methodHookParam2);
                        str = "ۖۧۨۖ۟ۘۘۡۚۢ۬ۡۢ۟۫۫ۜۘۘ۫ۖۧۙۥ۟۟۬ۖ۬ۖۦۚۛۦۙ۫ۨ۟ۜۖۘ۠ۡۙۚۘۗۦۦۥۗ";
                        break;
                    case -1980023278:
                        C0300lb.m1145(viewM1159, str3);
                        str = "ۖۤۗۡۗۥۜۛۢۧۥۘۗۢۘۘۥۨۧ۠ۘۨۘۗۥۢۧۛۗۛۗۜۘۧ۫ۥۥۖۘۘ۬ۥ۫ۛۗۖۜ۟ۦ۫۠۬ۡۡۡۘ۟۠ۖ۠ۖۗ۫۟ۘۘۤۚۛۘۖۚۨۙۚۧۨ";
                        break;
                    case -1902898720:
                        return C0433vb.f1163;
                    case -1892778286:
                        C0300lb.m1145(viewM1159, str2);
                        str = "ۢ۟۟ۛۨۘۛ۬ۖۘۢۘ۟ۗ۫۠ۧۖۢۧۦۘۦۦۥۙ۬ۨۘۗ۬ۦ۫ۨۢۗۨۦۘۦۦۦۘۙۧۛۗۛۖۘ";
                        break;
                    case -1195237431:
                        str = "ۛۖۛۗۜۖ۠ۨۙ۬۫ۖۥۘۧۦۧۘۜ۬ۦ۟ۧۡۛۚۙۥۙۨ۫ۚ۬ۖۦۘۚ۠ۨۢۨۤ۟ۘۘ۠۬ۡۡۙ۟ۨۦۡ";
                        c0300lb = this.f948;
                        break;
                    case -903994758:
                        str = "ۡۗۖۘ۫ۤۥۨۛ۠ۜ۬ۦۥ۫ۜۚۜۘۖۢۘۘۡۨ۫ۛۢ۫ۦۛۥۗۥۧ۟۠ۤۖۥۘۡۚۛۢۦۖۙۥۡ۟ۙۛ۫ۤۡۘۦۧۙ۟۟ۙۥۦۦۧۥۦۤۦۤۚ۠ۖۘ";
                        break;
                    case -868457703:
                        String str4 = "ۘۨۥۘۢۖۢۨۗۤ۬ۦۜۘۗۖۙ۬ۘ۟ۜۛ۟ۡۢۦۘۙۛۖۤ۫ۗۜۧۘۘۢۘۘۜۗۨۨ۠ۚۚۢۨۥ۟ۘۥ۠ۡۘۚۥۡۘ۫ۙۨۘۛ۟۟ۚۧۧ";
                        while (true) {
                            switch (str4.hashCode() ^ (-16202642)) {
                                case -542723826:
                                    str4 = "ۨ۟ۖۘ۟ۗۦۢۢۡۘۤۖۚۙ۠۟ۨۘۙۙۢ۫ۢۡۚۨۘۘۧ۫ۥۘ۫ۨۧۘۜۜۥۖ۠ۘ۟ۙۤۨۜ۫ۙۜۙۤۡۖۘۙۡ۟ۚ۫ۢۨۨۖۖۥۙۢۙۧۘ۬ۡۦ۫۫ۚ۬ۜ۬ۗ۠۫ۘ";
                                    break;
                                case -404857589:
                                    String str5 = "ۙۥ۠ۢۥۘۘۥۚۘۛۢۚ۠ۚ۫ۙ۫ۖۦ۠۫ۘۘۛۦ۬ۜۗۧۜۜۘۜۘۦۛۖۤۧۨۘۛۤۡۥ۬ۢۜ۬۠ۙۧ";
                                    while (true) {
                                        switch (str5.hashCode() ^ (-130467793)) {
                                            case -1744157990:
                                                str4 = "ۨ۠ۜۘ۠ۜۜۧۨۨۥۢۥ۠۠ۗۙۗۘۙۧۖۗۗ۟ۛۨۤۢ۫۠ۦۗ۬ۚۚۚۖۧۘۡۡۜۡۖۘ۬۬ۜۘۨ۠ۘۘۚۢۤ";
                                                break;
                                            case -1380878659:
                                                str5 = "ۚ۬ۛۚۢۦۘۘۚۖ۠ۙ۫ۦ۫ۦۘۤۚۙ۫ۢۢۦۜ۠ۤۤۚ۫ۡۨۦۡۧۚۨۘۘ۟ۖ۬ۡۢۨۘ۠ۤۧ";
                                                break;
                                            case -456081275:
                                                str4 = "ۨۛۡۘۥۢۖ۟ۜۛۡۚۖۘ۟۫ۦۘۡۧۛ۟۠ۡۖۦۗ۬ۡ۬ۥۘۦۘۥۢۚۨۗ۟۫ۙۡۘۦۡۡۘۗۥۜۚۥ۬۟ۗۚۖۗۥۘ";
                                                break;
                                            case 2116402038:
                                                String str6 = "ۚۛۡۚ۫۫ۖۦۜ۬ۡ۫ۛۤۡۛ۠۟۬۟ۤۛۦۘۗ۫ۢۖۗۘۛۙۖۘۦۨۥۘۖۢۧۧ۟۬ۥۤۨۗۢ۠ۧۢ۫۟۟۟ۥۢ۠۫۟ۦۦۙۙۖۚۚۘۧۧۗۨۡۢۡۧ۫ۤ۬ۤ۫ۘ";
                                                while (true) {
                                                    switch (str6.hashCode() ^ 1864412174) {
                                                        case -784260676:
                                                            str6 = "ۦۜۘۘ۫ۖۤۡ۫ۗ۠۫ۘۘۜۡ۬۟ۢۛۡ۬ۖۗۛۤ۬ۦۘ۫ۢۧۙۛۢۙۜۥۦ۬ۡۢۛ۟ۥ۠ۖ۫ۨ۬۟ۡۘۘ۫ۚ۫۟ۧۦۧۦۚۙۡۘ";
                                                            break;
                                                        case 753812085:
                                                            str6 = set2.contains(str3) ? "۠ۚۜ۫ۦۧۡۘۧۘۨۚۙۜۛ۬ۜ۬ۜۛۧۗۜۖۥ۟ۥۧۜ۠۠ۧۖۘۘۛۨ۟۟۠ۦ۫ۖۙۧ۟ۖ۟ۙۢۥۘۤۛۥۚۘۘۗۧۜۘ۬ۚۜۜۗۨ۫ۜۤۧ۟۬" : "ۗ۫ۤۗۘۖۚۦۖۜۢۡۗۦۨۘ۬۠ۥۘۢۦۨۦۦۜۜۗ۠۬۬۟ۢۢۦۨۙۖۘ۠ۚۧ۬۠ۖ۠ۢۦۨۖۘۚۦۥۜۙۘۥۤۖۘۡۥۥ۫ۚۡۦ۟ۥۘۛۢۚۤۦۖۘ۟ۧۨۥۛۨۧۡۨ";
                                                            break;
                                                        case 1258874025:
                                                            str5 = "ۗ۫ۘۘۙ۬ۘۘۙ۫۬ۜ۠ۥۥۧۚۥۘۘۢۧۖۧۧۦۨ۫۟ۡۘۘۛۚۛۚۙۖۤۥۘۙۢۨۘۚۢۛ۫ۗۡۘۙۖ۟۫ۙۡۘۨ۠ۡۘۜۦۥ۫۫ۛۛ۟ۧ۬ۢۜۘۥۨۧۙ۠۠ۛۘۘۤۦۥ";
                                                            break;
                                                        case 1859200485:
                                                            str5 = "ۧ۬ۘۘۥۧۙۧۤۢ۫ۨۙۤۘۜۙۦۤۤۘۙۛۘۡۘۥ۫ۜۘ۠ۜۦۛۧۡۘۧۘ۫ۤ۬۬ۧۖۥۡۙۜۘۤ۬ۛۙۦۢۧۥۖۛۨۘۘ۠ۛۥۙ۬ۚۢۙۖ۬۬ۖۘ۬ۚ۬ۡۖۥۗۢۨۢۨۨۘ";
                                                            break;
                                                    }
                                                }
                                                break;
                                        }
                                    }
                                    break;
                                case -63913953:
                                    str = "ۖۤۗۡۗۥۜۛۢۧۥۘۗۢۘۘۥۨۧ۠ۘۨۘۗۥۢۧۛۗۛۗۜۘۧ۫ۥۥۖۘۘ۬ۥ۫ۛۗۖۜ۟ۦ۫۠۬ۡۡۡۘ۟۠ۖ۠ۖۗ۫۟ۘۘۤۚۛۘۖۚۨۙۚۧۨ";
                                    continue;
                                case 2137936821:
                                    str = "ۦۚ۬ۤۘۡۗۚ۠ۜۚۥۘۖۡۥۘ۠ۘۘۘۖ۫ۤ۠ۢۚ۟ۘۘۧۖۤ۫ۨۥ۫ۙۖۘۘۛۚۤ۫۬ۘۡۦ۠ۛ۬ۦۨۜۜۜۘۙۛۖۘۧۢۢۙۘۘۘۙۛۘۤۧ۫ۨۗۜۘ";
                                    continue;
                            }
                        }
                        break;
                    case -762707289:
                        str2 = C0300lb.f1689;
                        str = "۠ۤۛۙ۟ۜۦ۬۫ۛۗۨۘۙ۬ۨۘۦۡۦۘۡ۬ۚ۠۠۠ۗ۬ۨۘ۟ۥۡۘۦۘۘۚۜۦۛۢۤۚۢۨ۬ۦۘۖۧۘۤۨۜۙۢۦۘۜۜ۟ۡ۫ۛۗۘۖ";
                        break;
                    case 71878327:
                        C0325n8.f994.getClass();
                        str = "ۦۗۖۘۜۨۘۡ۫ۘۛۚۤۖۗۡۘۙ۫ۧۤۚۦۘۜ۬ۥۡۤۥۘۨۙ۬ۖۗۦۜۡ۠ۨۤۖ۠ۢۨۘۘ۟ۜ";
                        break;
                    case 544230078:
                        str = "ۨۢۤۦۛۦۢۧۚ۫ۦۜۢ۫ۦۘۤۡۘۗۥ۫۠۬ۤۦۖ۠ۜ۫ۚۖۘۚۨۧۘۖ۫ۛۚۥۘۚۜۥۘ";
                        set = c0300lb.f947;
                        break;
                    case 926454984:
                        String str7 = "۬ۨۧۚ۟ۙ۫۫ۥۘۘۥۢۛ۬ۦ۠۬ۨۘۧۥۘۘ۬ۜۚۢۨۘۗ۟ۨۚۜۜۘ۠ۨۦۘۢۤ۟ۦۨۛۜۜ۠";
                        while (true) {
                            switch (str7.hashCode() ^ 168272399) {
                                case -1419598314:
                                    str7 = "۟ۢۘ۬ۤۚۖۙۗۜۚۢ۟ۥۘۨۛ۠۫ۖۢۗۖ۬ۥۡۧۥ۠ۧۛۧ۬ۜ۫ۤۙۡۘۘۗۦۙ۠ۚۙۥۢۡۘۙۢۤۤ۠ۢ۬۠ۚۢۦۛۡۘۜ۬ۜۙۚ۬۬ۖۚ";
                                    break;
                                case -64967195:
                                    String str8 = "۟۫ۜۢۥۘۢۜۘ۠۟ۡۦۦۘۘۗۨۥۧۧۨۛۡۘۨۨۙ۫۟ۡۤۖۦۘۜۗۢۡۤۘۘ۠ۜۦۢۦۧ";
                                    while (true) {
                                        switch (str8.hashCode() ^ (-345793178)) {
                                            case -400475160:
                                                str7 = "ۦۢۚۤ۟ۡۚ۬ۨۢۚۘ۫۫ۤۥ۟۟۬ۜۦۘۜ۬ۡۘۙۘۥۢۖ۫ۨۜۙۦ۫ۢ۟ۡۡۨۨۘۘۖ۫ۛۗۡۧ۠ۥۘ۟ۥۛۥۢۨۚۜۧ۫ۙۡۢۙۘۘۧۡۡۘ";
                                                break;
                                            case -351768385:
                                                str7 = "ۦۘۨۘ۬۟ۤۨۚۛۛۧۛۘۘۧۘۘۙۚۥۨۢۛۜ۫ۧۡۧۘۦ۫ۘۘۥۤۤۖۙ۬ۧۨ۬ۡۛۛ۬ۖۤۤۤۜۥۥۘۨۨۘۛ۠ۚۡۦۦۘۘۢۛ۬ۧ۠ۧۘۖۜۧۘۗۖۡۘۛۖۥۘ۬۫ۚ";
                                                break;
                                            case 704546450:
                                                str8 = "ۧۛۤ۟ۢۚۛۚۘۘۤۤۗ۬۠ۨۜ۫۬ۨ۫ۖۘۧۘۜۢۡۘۗۨ۟ۚۛۗۦۙۛۙۦۘۗۜۗۙۗۡۡۛۡۦ۠۟ۡۖۦۥۙ۠۠ۚۜۘ۫ۗۨۘۢۜۦۘ۠۫ۨۘۢ۠";
                                                break;
                                            case 2145001712:
                                                String str9 = "ۧۗۡۘۧۙۥ۟ۜۖۘۤۗ۬ۥ۟ۦۤۗۦۙۛۡۗۢۡۘۦۨۥۘ۠ۥۨۙ۫ۛ۟ۗۙۧ۬۟ۤۥۡۘۦۥۨۘ۫ۧ۫ۥۙ۟ۢ۫ۨۘ";
                                                while (true) {
                                                    switch (str9.hashCode() ^ 1569524835) {
                                                        case -2140340961:
                                                            str9 = set.contains(str2) ? "ۤۨۢۚۚۖۧۙ۠ۢۛۡۛۦۖ۫۬ۜۘۘۨۧ۟۠ۨۙۢ۠ۨۧ۟ۧۡۡۙ۫ۖۗۨۗۜۥۘۗۚۜۘۧۢۘۧ۫ۥۘۚۗ۬ۦۛۥۘۤ۟ۛ۬۠ۤ۬ۦۦۘۤۦۛ۟ۚۖۖۖۛۖۦۥۘۦۤۨ" : "ۦۚۦۘۗ۫۬ۚۜۖۘۛۤۛ۫ۛ۟ۤۢۖۨۚۤۗۡۦ۠ۚۤۧۗۜۤۗۨۢۖۖۘۙ۫ۘۘۥۡ۫ۦۛۧۨۗۥ۬ۦۜۜۦۘۙۚۦۤۨۖۘ۠۫ۦۚۥۛۙۨ۠ۧۨۜۘ";
                                                            break;
                                                        case -657539091:
                                                            str8 = "ۧ۫ۡ۠۬۬ۡ۟ۖۤۦۜ۟ۛۥۤۜۘۧۘۦۘۨ۬ۖ۠۟ۛۤۧۧۚۙۨۨ۠ۡ۟ۢۗۖۤۦۗۦ۟ۚۛۨۘ۬ۧۛۖۥۛۤۢ۟ۥۤۤۛۢۧۦۥۚ۟۫ۘۤۡۖۨۙۜۦۥۘۡۥ۠";
                                                            break;
                                                        case 1414726722:
                                                            str9 = "۬۫ۘۘۙۡۘۘۛۨۜۘۥۙۙۦۥۨۧۢ۠ۤۥۥ۫ۗ۠۬ۥۗۛۖۡ۟ۨۥۗۖۛ۟ۦۥۘ۠ۖۘۘۥ۬۟ۡۜۥۘۛۖۡۘۚۥۘ";
                                                            break;
                                                        case 1438497282:
                                                            str8 = "ۚ۠ۜۘۗۤ۫ۢۢۗۡۖۥۘۢ۠ۜۘ۟ۛۜۧ۫ۨۥۚۦۥ۟ۥۘۖۧۦۙۦۘۘۗۙۦۛۗۖۘ۟ۛ۬ۦۡ";
                                                            break;
                                                    }
                                                }
                                                break;
                                        }
                                    }
                                    break;
                                case -52420319:
                                    str = "ۢ۟۟ۛۨۘۛ۬ۖۘۢۘ۟ۗ۫۠ۧۖۢۧۦۘۦۦۥۙ۬ۨۘۗ۬ۦ۫ۨۢۗۨۦۘۦۦۦۘۙۧۛۗۛۖۘ";
                                    continue;
                                case 1116031558:
                                    str = "۬۫ۘۧۡۨۘۗۨۘۖ۬ۨۘ۟ۛۥۖ۠ۦۖۙۘۘۘ۠ۡۘۤۡ۬ۘ۫ۥ۟۫ۗ۟ۤۖۘ۠ۥۖ۬۫۠ۜۖۗۗۜۤۗۚۦۥ۫ۢ۠ۜ۬ۦ۠ۗۙۦ";
                                    continue;
                            }
                        }
                        break;
                    case 1014357066:
                        str = "ۡۧۦۘۤ۠ۡ۠ۙ۠ۤۧۥۘۧۚۨۘۗۨۘۜۖۦۘ۬ۦۜۡۧۨۘۢۧۜۘۚۚۜۘۛۚ۬ۥۗ۫ۘۢۨۚۙ۟۬ۨ۠ۤ۬ۘۘ۫ۦۢ";
                        str3 = C0300lb.f946;
                        break;
                    case 1115196932:
                        str = "ۖۤۙ۠ۖۗۨۥۡۘۤۢۛۙۛۢۜۜۧۘۙۙ۟ۥۜۖۛۙۗۦۖۙۚۗۦۘ۫۬ۚ۫ۘۘۗۧۧ۠۠۟ۛۢ۠ۢۜۦۢۚ۟";
                        break;
                    case 1409588387:
                        str = "ۜۖ۫ۖ۠ۦۚۙۧۘۥۥۘۘ۬ۨۗۨ۟۟۫ۡۚ۫ۚۚ۠ۡۘۗ۫ۜۘۚۦۜ۫ۦۥۚۙۡۙۙ۫ۛۘ۫ۡۢۥ۫۠ۜۘۜۤۤۗۡۖۘۚۢۜ۬ۨۦۘۢۘۥۘۡۢۜۜۖۦۘ";
                        viewM1159 = C0325n8.m1159(methodHookParam2);
                        break;
                    case 1420450693:
                        str = "ۖۜۦۘۛۢۡۚۚۤۨ۠۫ۚۘ۠۟ۦۘۛۖۛۚ۬ۧ۠ۦۘ۟ۡۧ۠۟ۤۜۘۙۦۘۡۨۦ۠ۥ۫ۧۦۚ۫ۡۖۘۛۨۘۡۘۧۘۙۖ۫ۢۦۖۛۧۤۗۚۙۚۙ۠ۙۛۨۘۢۢۢۦۗۦۘ";
                        set2 = c0300lb.f947;
                        break;
                    case 1984086981:
                        str = "۠ۤۜۘۗۨ۬ۤۙ۬ۚۢۜۡۜۜۘۦۖۨۘۤۦۤۨۜۦۘۡۘۨۦۜۥۘۗ۫ۥۗۦۤۘۢۗۢۘۥۖۚۛۡۨۘۜۘۖۘۛۚۢۧۡۘۗۙ۫ۙۗ۠ۧۛ۬ۜۜۘۜۚۖۘ";
                        methodHookParam2 = methodHookParam;
                        break;
                }
            }
        }
    }

    static {
        String str = "۫ۙۜۜۨۜۘ۠ۖ۟ۛۥ۫ۙۖۘۢۖۧۘ۫ۚۨۘ۟ۨۡ۬ۤۦۘ۫ۗ۟ۛۡۡۛ۟۟ۜۙۛۢۘۡۘۖ۬ۡ";
        while (true) {
            switch ((((((((str.hashCode() ^ 516) ^ 818) ^ 691) ^ 33) ^ 474) ^ 651) ^ 962) ^ (-157899523)) {
                case -17743393:
                    f1689 = "index_post";
                    str = "۟ۦۘۘۧۤ۟۠۬ۘ۠ۥۚۜۨۘ۫ۨۘۤۙۖۡۗۘۘۡۛۖۘۘۘۘ۠ۜۛۡۘۤۨۙۛۚۗۨۚ۫ۥۥۢۢ۠ۚۢۘ۠ۛۖۗۚۛۛۤۡۨ";
                    break;
                case 204023935:
                    return;
                case 593294952:
                    f946 = "index_store";
                    str = "ۖۨۢۧۡۦۚۛۢۥ۟ۨۘ۬ۢۘۘۘۢ۫۟ۛۜۘۦ۟ۦ۬ۤۜۘ۠ۢۤۖۦۨۙۥۚۧ۠ۜۧۤۥ۟ۖۗۖ۠ۢۥۡۨۗ۠ۦۖ۟۫ۚۙۥ۠۫۟ۖ۠ۨۘۥۗۖۘۜۛۙ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟۟, reason: contains not printable characters */
    public static void m1145(View view, String str) {
        String str2 = null;
        View view2 = null;
        Class clsM1199 = null;
        Integer numM1205 = null;
        int iIntValue = 0;
        int i = 0;
        int i2 = 0;
        View viewFindViewById = null;
        View view3 = null;
        String str3 = "ۨ۬ۢ۬۟ۡۤۡۘۡۚۙ۟ۤۡۖۥۨۘۡۙۜۘۥۢ۬ۡ۟ۘۘۧ۠ۢ۟ۥۚۤۧۦۨ۫ۥۘۗۤۚۢۢۜۘ";
        while (true) {
            switch ((((((((str3.hashCode() ^ 36) ^ 884) ^ 936) ^ 151) ^ 532) ^ 304) ^ 136) ^ (-864610925)) {
                case -2054572526:
                    str3 = "ۥۘۘۘۨۥۦۖۛۖۘ۫ۜۦۦۢۥۢ۠ۡۘۧۖۘۖۨ۠ۧ۬ۢۤ۫ۦۘۜۧۛ۠ۨۜۧ۫ۙۜۚ۬ۢۢۥۜۧۘۘۗۚۥۡۖۡۘۖۘۜۘۖ۫ۤ۫ۥۥ۟ۡۘۨۢۦۛۦۤۥ۟ۦۘۖۖۜۘۥۥۥ";
                    view3 = view2;
                    break;
                case -2051051454:
                    view2 = null;
                    str3 = "ۢۨۗۗۦۘۜۚۙۥۤۛۚ۟ۦۘۨۤ۟ۧۙۦ۠ۚۘۘۙ۬۬۟ۦۥ۫ۡۘۨ۬ۦۘۥۤۥۘ۠۬ۗ۟ۦۜۘۛۛۗ۫ۙۨۘۖ۫ۚۤۥۦۘۧ۠ۘۤۛۘ";
                    break;
                case -1685470121:
                    String str4 = "ۥۤ۠ۙۥۨۘۘۨ۫۠ۗۘۘۤۖۛۢ۟ۖۘۘۚۘۘۘۛۦۘۥۘۜۘۨۤۧۧ۫ۦۘۥۡۜۘۨۚ۠۫ۘۧۨۤۨۦۡۧۘۦ۟۟۬ۧۜۖۘۜۘۛۜۧۘۗۥ۬۠ۚۛ۬۬ۘۘ۫ۥۦ";
                    while (true) {
                        switch (str4.hashCode() ^ 1936381129) {
                            case -1735669403:
                                str4 = "ۢۢۚ۟ۧۗ۟ۘۥۦۛۗۜ۫ۘ۟۬ۢ۫ۧۦ۠۠ۛۚۥۘ۫۠ۜۘۖۛ۫ۤۨۨۘۚ۟ۘ۟ۖۘۘۚۦ۟ۡ۫۠ۡۖۚۛۖ۬";
                                break;
                            case 1533475515:
                                String str5 = "ۘ۫۟۠ۢۘۘۡۘۡۦ۠ۧۖۨۘۙۢۧۢۦۦۖ۠ۥۘۦۦۧۘۘۛۡۘۧ۫ۜۜۘۚۢ۟ۧۡۘۛ۟۟ۘۘۨۙۤۚۖۘۘۘۤۢۦ۠ۨۘۛ۠ۖ۠ۡۢۢۛۖۙ۟ۖۙۗۢ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-1770831071)) {
                                        case -203157458:
                                            String str6 = "ۖ۬ۖۘۦۡۛ۫ۚۡۘۚ۬۟۟ۗۚ۬ۚۡ۟ۧۨۡۥۖۘۨ۟ۥۜۘ۟ۛۚۥۘ۬ۗۥۘۥۧۘۘ۠ۦۧۡۘۡۙۦۧۜۙ۟ۨۙۨۖ۬۠ۙ۫ۥۘۚۤۜۦۡۙ۟ۨ۫ۤۡۧۨ۟۠ۥۢۜۥۡۘۘ";
                                            while (true) {
                                                switch (str6.hashCode() ^ 399014611) {
                                                    case -795298753:
                                                        str6 = numM1205 != null ? "ۛۡۨۥۦۖۗۜۢۨۤۜۘ۫ۖۥۘۖۜۦۘۙۗ۬ۚۦۚۧۖۘ۫ۚۦۘۥ۟ۡۘۙ۬ۤۧۛ۠ۢۨۡۙۨۘۨ۠ۧۨۚۜۘۡۛۜۘ" : "ۚۙۨۚۙۗ۬۫ۦۘۚۜۜۥۧۦۚۜۡۘۚۡۘۘۚ۟ۚۘۡۦۘۚۡۨۨۨۡۘۥ۫ۦۘۥۧ۬ۧۘۗۜۥۡ";
                                                        break;
                                                    case -562561343:
                                                        str5 = "۫ۢۡۘۛۢ۫ۦۗۖۦۜۤۛۡ۟ۤۘۜۘۘۨۡ۫ۘۛ۬ۗۘۘۖۢۘۘۛۡۚ۟ۖۘۥ۫ۚۗۗ۬ۥۤۧۨۧۜۘۢۨۦۘۜۦ";
                                                        break;
                                                    case -206586691:
                                                        str5 = "ۦۚ۬ۨۤۜۦۘۡۘ۟۟ۚۗۤۛۜۖۥۘ۟ۥۜۥۗۨۛۚۚۛۛۖ۟ۢۤۨۜۘۢۙۡ۟ۡۖۜۜۧۘۥۧۡۘۖۡۨۘۤۢۦۘ";
                                                        break;
                                                    case 1673652404:
                                                        str6 = "ۜۗۘۘۥۖۤۢۗۥۢ۟ۨۡۜ۫۠۠ۘۛ۟ۤۢۥۤۢۚۖۘ۠ۛۡۘۘ۠ۨۘۢۡۜۘۚ۟ۗۖۢ۟۬ۢۛ۠ۨ۬ۧۨۡ۠ۙ۬";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 902262435:
                                            str4 = "۟ۘۡۘ۫۠ۖۡۚۨۤ۫۬ۜۜۙۛ۬ۥۘ۬۠ۘۢۗ۫ۜ۠۬ۛۛۜۘۜۗۗۢۢۨۛۥۘ۬ۘۥۘ۫ۙۙۖۙۨۛ۟۟ۨۙۨ";
                                            break;
                                        case 1005857294:
                                            str5 = "۫ۨۦۘ۟ۦۘۘۢۜۤ۬ۨۖۚ۬ۖۡۘۦۖۘۘۧ۟ۢۨ۬ۛۤۢۜۜ۫۫ۗ۟ۦۘۗ۟ۢۡۘ۟ۗۗ۟ۤ۬۬ۗۛۘۙۘۘ";
                                            break;
                                        case 1257873635:
                                            str4 = "ۘۥۚۢۧۤ۫ۘ۫ۗۙۦۨ۬ۚۢۙۦۡۘ۫ۗۦۡۖ۟ۘۚ۠ۘۘۡ۬ۗ۠۠ۧۥۨۦۘ۠ۤ۠ۡۨۡ۠ۘۨۤۜۘۨۗۗۙۗۙۤ۟ۙۗۜۜۦۚۜۧۢ۟";
                                            break;
                                    }
                                }
                                break;
                            case 2028410748:
                                str3 = "ۦۡۤۨۥۛۨۤ۬ۢ۫ۖۧ۟۬ۙۘۡۘۜۥۥۘۖ۟ۦۘۢۚۦ۫ۜ۬ۦ۠ۧ۟ۜۡ۬ۦۨۘۖۢۡۡۘۢۙۘۗۡۦۧ۬ۨۘ";
                                continue;
                            case 2080829778:
                                str3 = "ۖۤۙۥ۬ۙ۬ۚۨ۠ۛۦۛۦۨۘۛۛۤۜۨۦۥۢۙۜۦۦۘۙۚ۫۬ۘۘ۬ۧۜۘ۫ۦۜۤۢۥۘۥۘۘۘۜ۫۫۬ۨۨۘ۫ۨۖۘۜۤۥۖۥۜۨۙۦۡ۟ۙۨۙۦۦۖۘۘۧۛۧۤۛ۬۠ۘ";
                                continue;
                        }
                    }
                    break;
                case -1235283147:
                    str3 = "ۛۡ۟ۗۙۥۘۙ۫ۡۢۤۗۛۘۘۘ۟ۖۛۜۘۘۗۡ۠ۚۧۘۘ۟ۜۘۘ۫ۤۘۘۘۦۨۘ۬ۙۜۖ۟ۤۥۦۗۘۡۡۡۛۡۗۨۤۥۦۥۦ۟۠ۖۚۘۘۘۧۢۜ۫ۨۙۧۡۘۙ۬ۚۤۛۛۨ۟ۘۘ";
                    break;
                case -1154905597:
                    C0237h4.m1090("id", str);
                    str3 = "ۜۡۡۘۗۗۙۧۡۘۘۡۨۢۗۗ۬۬ۙۛۥۦۤۚۥۡۗۜۘۗۘۡۨۧ۠ۧۢۦۘۥۘۦۜۡۨۥۛۚۢۙۡ۬۫۫ۙۘ۟ۥۛۦۤۨ۠۫ۤ۬";
                    break;
                case -1115996417:
                    str3 = "ۘۗۧۧۛۡۥۙۜۛ۠ۥ۬۬ۚۚۛۜۧۡۘ۬۟ۘۗۤۤۗۦۘۥۛۡۦۥۛۜۘ۟۬ۜۘ۟ۧۨۨۢ۟ۗۥۨۘۡ۠ۧۙۨۘۨۛۜ۫ۢۧۗۥۦۘۘۖۥۜ۠";
                    break;
                case -872334741:
                    numM1205 = C0373r3.m1205(clsM1199, str);
                    str3 = "ۦۙۥۖۥۦۘۜۜۡۧۜۛۖۡۨۥۥۘۧ۫ۖۘۘۛۢ۠ۢۢۤۙۘۘۦۛۘ۟۬۫۟ۚ۬ۡۜۡۡۘۘۛۗ۫ۤۧۖۧۗۖۗۙۡۘۦۙ۠ۤ۫ۥۛۢۖۘۗۥۨۘۜ۫ۖۤ۬ۘۘۚۤۨۘۚۧۖۘ";
                    break;
                case -417174663:
                    clsM1199 = C0373r3.m1199(str2, null, 3);
                    str3 = "۟ۛۥۡۜۧۢۙ۟ۡ۟ۤۧۤۧ۬۫ۨۘۤۘۢۡۡۥۥۨۡۘۤ۫ۘۘ۬۫۠ۨۨۜۢۡۨۡ۟ۤۛۨۦۘ";
                    break;
                case -309032631:
                    C0237h4.m1089("HomePageRIdCls", str2);
                    str3 = "ۖ۟ۧ۠۠ۨۗ۠ۘۘ۬ۗۨ۠ۨۡۘۧۗۥۘۚۚۨۤۡۦۘۙۦۖۡۘ۬ۖۘۘۗۚۘۧۗۧۧۥ۠ۙۦۡۘۗۚۡۘ۟ۚۙۦ۫ۥۖۨۜۘۖ۬ۢۖ۫ۤ";
                    break;
                case -292489677:
                    str3 = "ۤۨۡۘۙۜۡۘۛ۠۠ۡۢ۬ۥۤۥۦۙۘ۬ۢۛۗۤۘۘ۟ۚۛ۬ۥۧۘۚۙۖ۫ۗۛۢۖۘۧۗۛۜۢۜۘ";
                    i2 = iIntValue;
                    break;
                case -264452770:
                case 158788454:
                    return;
                case -172893680:
                    viewFindViewById = view.findViewById(i2);
                    str3 = "ۚۥۚۨۤۖۘۙۜۦۜ۬ۖۨۧۧۧۖ۬ۜ۟۫ۖۥ۟۠ۜۗ۫ۚۖۖۥۘۘۗۡۨ۫ۤۜۘۢۗۚ۠ۗۧۚ۬ۖۥ۫ۥۘۙۦۢۛۗۜۦ۠ۘۘۨ۠ۘۘ";
                    break;
                case 69663700:
                    str3 = "ۘۖۥۘۘۦۙۦۛۘۙۢۘۙۖۧۘۤۙۖۘۥۡۡۘۙۥ۟ۘۚۗۥۤ۫ۗۘ۠۬ۤۦۘۨۡۚ۬ۙۖۘۗ۫ۘۘ";
                    view3 = viewFindViewById;
                    break;
                case 83682447:
                    str3 = "ۛۨۜۘۥۜۡۘۨۢۘۘۢۜۡۘۗۨۡۘۗۨۘ۠۬ۤۛ۟ۖ۬ۧۘۡۤ۬ۦۜۦۢۧ۬ۧۘۨ۟ۙۖۘۦ۬۟";
                    i2 = i;
                    break;
                case 1064219742:
                    view3.setVisibility(8);
                    str3 = "ۛۡ۟ۗۙۥۘۙ۫ۡۢۤۗۛۘۘۘ۟ۖۛۜۘۘۗۡ۠ۚۧۘۘ۟ۜۘۘ۫ۤۘۘۘۦۨۘ۬ۙۜۖ۟ۤۥۦۗۘۡۡۡۛۡۗۨۤۥۦۥۦ۟۠ۖۚۘۘۘۧۢۜ۫ۨۙۧۡۘۙ۬ۚۤۛۛۨ۟ۘۘ";
                    break;
                case 1294832894:
                    str3 = "ۧۥۜۘۢۥۢۦۨۖۘۢۖۖۜۨۛۚۢۘۢۜۙۚ۟ۨۦۡۦۘۘۥۚۜ۟ۧۢۗۖ۬ۖۦۘ۬۟ۛۜۨۧۛۖۧۘ۠۠۠ۤۚۥۘ";
                    break;
                case 1418500495:
                    iIntValue = numM1205.intValue();
                    str3 = "ۦ۠ۜۘ۟ۨۡۘ۬ۢۡۥۨۥۦۨۥۜۦۨۘۧۘ۬ۘ۟ۥۘۗۚ۠ۥۤۥۘۖۘ۫ۘ۠ۨۘۧۖۗ۬ۚۡۘ۬ۛ۠ۡ۟ۥۗۘۛ۬ۨۗۚۚۡۖ۟ۥۗۜۘۦۜ۫ۖۦۧۨ۟ۧ";
                    break;
                case 1463711767:
                    String str7 = "۫ۥۛۜ۟ۜۡۘۨۡۗۦۤ۫ۘۥۛۦۢۙ۬ۜۖۗۛۢۧۥ۠ۤ۫۟ۚۚ۟ۡۡۖۚۙۥۘۥۢۡۗ۫ۖۘ۫۫ۢۗ۫ۥ";
                    while (true) {
                        switch (str7.hashCode() ^ 96890493) {
                            case -2011221805:
                                str7 = "۠ۖۜ۬ۡۦۘۡۘۖۚۘۛۗۦ۬ۤ۬ۜۘۡۗۥۘۧۜ۫ۢۖۢ۟ۚۨۦ۟ۚۤۗۛۙۚۜۢۡۘۘۜۚۗۥۤۦۗۡ۟ۢ۫ۚۙۗۖۢۚ۫۬";
                                break;
                            case -462008233:
                                str3 = "ۙ۠ۤۤۘۛۨ۬ۤ۫۫ۘۘۡۤۧۜۥۦۖۘ۟۬ۙۚۢۜۤۛۦ۠ۚۙۛۡۤ۠ۥۤۨۦۢۦۨۡۘۘ";
                                continue;
                            case 226318325:
                                str3 = "ۥ۟ۢۢۙۥۤۚ۟ۡۤۖ۟ۖۗۨۖۖۜۖۜۘ۬ۗ۠ۗۛ۬ۦۤۚۥ۫ۚۤۘۛۡۛۡۚۗۛ۬ۖۡۘۘۥۜۗ۠۠ۖ۬ۜۘۥۜۘ۫۫ۖۧۨۚ۠۫ۦۥۢۗۦ۫ۖۘۘۨۨۖۤۖۚ۬ۚ";
                                continue;
                            case 1930091544:
                                String str8 = "ۥۤۢۡ۟ۧۜۡۛ۫ۧ۠ۧۖۤۗۦ۠ۡۜۗۜۖ۟ۚۤ۫ۤۖۦ۫ۙۜ۬ۛۛۛۖۘۥۨۘ۬۠ۢ۬۫ۧ۟ۛۘۘۙۦۚ";
                                while (true) {
                                    switch (str8.hashCode() ^ 1793189355) {
                                        case -943450739:
                                            str7 = "۬ۨۛۤۙۖۘۦ۟ۨۘۦۖ۠ۛ۠ۢۜۛۛۙ۫ۗۡۜۨۘۡۡۥ۠ۨۙۘۡۘۡۧۜ۬ۢۦۘ۟۫۟ۛۙۙۥ۟ۦۨۘۘۡۤ۫ۨۚۨۜۛۜۧۙۘۘ۬ۛۥۚۥ۬۠ۗ۬";
                                            break;
                                        case -841425985:
                                            str7 = "ۡۖۛۛۢۖۗ۠ۨۗ۬ۘ۠ۜۦۨۗۖۘۦ۠ۡ۬ۥ۬ۤۡۜۙۖۘۚۤ۫۫ۡۘۘۘۥۥ۠ۧ۬۠ۢۢۗۙۛۤۜۘۜۦۗۥۜۦۘۥۖ۫ۦۦ۫";
                                            break;
                                        case -764503138:
                                            String str9 = "ۡ۬ۥۘ۫ۗۨۘ۠ۚۘ۬ۥۘۘۥۡۦۘۗۗۜ۠۠ۚۗ۫۬ۦۨۥۘۨۤۘۘۛۘۛۤۢۤۙۥۦۙۛ۬ۜۤۜۜۘۜۘۘۛ۠ۢ۬ۨۖۢ۫۬۫ۢۥۧۧۥۙ۠ۗ۠ۛۧۖۘۢۗۤۙ۫ۗۧ۟ۘۘ";
                                            while (true) {
                                                switch (str9.hashCode() ^ (-72482285)) {
                                                    case -2126810250:
                                                        str9 = view3 == null ? "ۢ۠ۢۢۚۚ۫ۘۢ۬ۜۤ۟ۦۚۤۧۘ۟۟ۧ۟ۦ۬ۥ۟۠ۖۧۘۤۡ۟ۥۥۚۢۥۨ۠ۨ۫۟۠ۖۤۦۚۖۦۢۘۘۜۧ۟ۥۘۖۥ۫۟ۛۢۜۨۨۘۤۗۙۥۡۜ" : "ۢ۠ۡ۟۟۫ۨۨۧۘۦۜۖۨ۬ۨۖۜۘۥۤۗۖۨۜۘ۠ۙۛ۬ۘۤۨ۠ۚۛۧۡۙۥ۠ۢۥۨۘۚۗۙۡۨۨۘۜۥۢۗۤۜ";
                                                        break;
                                                    case -597746961:
                                                        str8 = "۫ۡۙۡۜۖۘۜۚۜۘ۬ۧۛۢۧۢۖۗۖۦ۠ۗۥۡۡۙۨۚۤۡ۠ۤ۟ۛۦۦۡۘۨۥ۠۠ۗۗۚ۟ۙۖۖ۠ۤۥۙۗۥۖۘ";
                                                        break;
                                                    case -436505325:
                                                        str8 = "ۙۧۧۢۨۛۚۛۜۘۚ۬ۤ۟ۧ۟ۘۢۨۚ۫ۗ۬ۤۨۘۜۛۖ۬ۗۖۦ۬ۘۥۧۛۙۗۦۘۤۛۖۘ۟ۛۘۙۜ۬ۡ۟ۧ۟۟ۦۘۤۚۥ۟ۙۖۖۡۦۘۨۧۛۦۗۜۗۧۡۡۥۛۜۘۚۦ۬۟";
                                                        break;
                                                    case 1514944415:
                                                        str9 = "۫ۗ۬۠ۗۜۘۛۤۧۦۜۘۘ۬ۚ۟ۘۜۜۤۙۤ۠ۦۡۦۛۛ۬۟ۗۢ۠ۚۦۗۖۘۘۚۘ۠۫ۥۘۦۧۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 70371741:
                                            str8 = "ۢۡ۫ۢۖۢۗۛۦۘۡۥۚۚۜۖ۠ۗۥۢۚۙۖ۟۟ۧۢۦۜۢۖۥۧۖۘۥۚۙۘۥۘۘۨ۬۠ۘ۬ۜۘ۠ۡۧۥۗۘۘۧۘۜ۟ۘ۬ۥۤۦۜۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1691021591:
                    String str10 = "ۘۖۘۧۛۥۘۘۦۦۨ۫ۡۧۨ۠ۚۗۙۗۢۘۘۙۢۙۤۨۘۨۡۡۘۢۨۙۡ۬ۛۛۥ۬ۚ۟ۜۦۢۜۘۗۤۗۛۗۡۘۖۜۛ۬ۘۡۥ۟ۜۘۗۧۥ";
                    while (true) {
                        switch (str10.hashCode() ^ 416322422) {
                            case -1550094857:
                                str3 = "ۧ۠ۧۗۙۡۚۨۜۘ۫ۤۘۘ۬۫ۚۛۚۙۘ۬ۨ۫ۨ۬ۗۥۗۗ۫ۨۘۤۚۨۛۛۖۘ۟۫ۧ۫ۚۘۘ۬ۛ۠ۧۢۚۖۘۜۙۡ۠ۗۜ۠۬ۤۖۨ۬۠ۗۥ۠ۡ۫ۤۦ۫ۛ";
                                continue;
                            case -1003486183:
                                String str11 = "ۚۧ۫ۨۥۢ۟ۤۥۘۛ۬ۖۢۥۙۛۡۨۗ۟۟ۘۥ۬ۜۨۢۨۥۢۤۛۨۗ۬ۨۧۥۖۖۗۥۛ۫ۨۖۡۜ۫ۖۘۛ۬ۗ۟ۙ۟۫ۘۘۛۖۚۗۦۘۘۖۜ۠ۘۢ";
                                while (true) {
                                    switch (str11.hashCode() ^ (-694069960)) {
                                        case -1442925379:
                                            String str12 = "ۤۛۨۦۤۗۛ۬ۦۘۢۥۥۢ۬ۤۘۙۧ۠ۘۧ۬ۜۡۙۦۧۘۘۗ۫۬ۙ۬ۡۨۢ۬ۡ۫۠ۖۥۜۘ";
                                            while (true) {
                                                switch (str12.hashCode() ^ 820223081) {
                                                    case 202272997:
                                                        str12 = "ۧۜۡۦ۠ۚ۬ۜۦۘۚۘۘۖۨۧۘ۟ۚۜۘ۬۠ۘۘۨۢۥۘۤۘۡۚۨۡۘۚۜ۬ۨ۠ۖۘۛۚۖۘۛۤۘۘۦۙ۠ۗۗۘۘۗۥۧۡۢۦۘ";
                                                        break;
                                                    case 284481682:
                                                        str11 = "۟۟ۤ۬ۡۤۤ۟۠ۛۨۘۨۖۦۢۙۨۖ۫ۥ۫ۖۖۘۢۜ۫ۜ۬ۦ۬۫ۨۗۘۥۘۨۡۤ۬ۘۘۧۡۥۘۡۙ۟ۡۡ۟ۗۛۤ۟ۥۡۘ۟ۨۘۘ۫ۥۦ";
                                                        break;
                                                    case 794255795:
                                                        str11 = "ۢ۟ۦ۫ۤۙۛۡۛۡۘۧۙ۟ۚۖ۬ۨۧۢۜ۟ۚۚ۫ۖۘۘ۟ۜۘۧۢۜۛۥ۫ۧۧۧۥۨۦۘۖۖۤۙۦۥۘۥۢۜۘۖ۫ۜۘ۠ۦۤۥۚۙۦۛ۫ۤۥۘۤۨۜۡۦۢ";
                                                        break;
                                                    case 1400471635:
                                                        str12 = clsM1199 == null ? "ۧۜ۠ۨۤۜۘۤ۬ۜۘۤۜۥۘۡ۠ۗ۬ۨۖۘۗۗۡۘۦ۫۫۟ۖۚۗۚۦ۟۫ۡۘۛۦۗ۟ۢ۠ۤۛۡۢۡۦۘۦۗۜۘۛۖۙۚۤ۫" : "ۦۜۛۨۨۗ۫ۤۚ۠ۗۜۘۢ۬ۖۧ۠ۦۘ۠ۢۦۘ۠ۛۦۘ۬ۧۗ۬ۢۜۨۜۥۖۨۘۘ۫۫۫۠۠۫ۜ۟ۡ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -252627639:
                                            str10 = "ۡۙۛۡ۠۬۫ۤۦۘۢۡۢۖۚۡۘۛ۠ۧۙ۟ۡۚ۬ۤۦۥ۬ۖۨۘۘۨۗۗ۫ۧۤۖۧۘۧ۬ۢۖ۬ۖۘۨۤۚ۬ۙۡۡۘۗۗۨۘۜۤۘۘۛۧۤۢۚۖۨۛۢ۟ۙۜۘۙۛۗۙۢۗ۠۠ۨۘ";
                                            break;
                                        case 705728960:
                                            str10 = "۫ۜۨ۬ۨۘ۫۟ۧ۟ۧۜۛ۠ۥۚ۠ۤۨۢۨۦۡۘۢۦۖۙۚۦۘۤۜۡۘ۟ۧ۬ۛۧ۟ۘۖۨۘۚۨۘۖۧۦۘۤۡۚۖۗۨ۠۫ۜۘۛۖۘۛ۟ۨۘۛۨۛۗ۟ۘۘۖۛ";
                                            break;
                                        case 1438738552:
                                            str11 = "ۛۚ۟ۗۚۘۘۙۧۖۘۡ۬ۧۙۥۖۤۤۜۘۛۥۡۘۧۧۨۧۖۘۘ۫ۙۙۜۢ۟۠ۥۥۡۥ۬ۧۚۜۙۗۘۖۦۘۡۘ۫ۚۥۘ۫ۨۡۘۜۛۢۦۖۘۧۛۥۘۨۜۤۥ۟ۡ";
                                            break;
                                    }
                                }
                                break;
                            case 1783053424:
                                str3 = "ۧ۟ۜۘۚۖۚۜۡۜۚۦۥۘۗۗۛۨۚۜۘۗۢۦۘۨۖۧۘۨۚۖ۬ۥۛۥۙۙۨۢۖۚ۬۫۬ۖۡۖۡۘۧۡۧۚ۟ۛۙ۬ۘۖ۬ۧ۬ۜۘ۠۟ۥۡۛۜۘۚۖۨ۟ۡۦۘۖ۠ۜۗ۟ۖۗۖۧۘ";
                                continue;
                            case 2088570748:
                                str10 = "۟ۦۖۘۥۚۜۘۜۘۧ۠ۦۡۘۢۦۨۚۗ۫۫ۚ۫۟ۚۨۘۖ۠ۦۘۜۗۧۥۘۖۙۤۥۗۙۜ۬ۢ۠ۢۧۤۥۤ۬ۖۧ۬ۦۡۢۦۡۘۖۧۚۧۜۦۚۖۖۘۖ۫ۛۤ۠";
                                break;
                        }
                    }
                    break;
                case 1695582285:
                    str3 = "ۛۨۜۘۥۜۡۘۨۢۘۘۢۜۡۘۗۨۡۘۗۨۘ۠۬ۤۛ۟ۖ۬ۧۘۡۤ۬ۦۜۦۢۧ۬ۧۘۨ۟ۙۖۘۦ۬۟";
                    break;
                case 1897166373:
                    str2 = C0283k8.f1632.f1539;
                    str3 = "ۘۚۜۘۨۨۖۘ۬ۘۖ۠ۤۛۗۤۙۖ۫۫ۦۨۗۤۥ۟ۨۗ۬ۛۘۙۘۦ۫ۙۨۥۨۧۛۧۛ۫ۚ۟ۙۗۥۖۘۘۚۖۜ";
                    break;
                case 1899215343:
                    i = -1;
                    str3 = "۟ۘۖۘۢۘۥۢۧ۬ۙۡۦۘ۬ۥ۫ۦ۫ۨۘۚۖۥۘۖ۬ۦۚۚۖۘۤۤ۠ۤۥۜۘۖ۬ۘۖۙۤۘۥۗۚۦۘۦ۟ۜۛ۠ۤۗۧ۠";
                    break;
                case 2136540586:
                    String str13 = "ۤۙۘۘۘۥۗ۫۬ۛۨۛۖۗ۬ۘۙ۬ۙۧۗۘۘۤۙۤ۟ۨ۬ۖۘۛ۟ۛ۬ۥۖۨۘۘۖۛ۬ۨ۟۫۬ۢ۫ۥۗ۟ۨۦۤ۫۬ۦۘ۟ۚۜۘۚ۫ۜۥۡۛۡۦۦ۠ۜ۫۟ۢۗۢۘۘۥ۫ۙ";
                    while (true) {
                        switch (str13.hashCode() ^ (-1151338378)) {
                            case -1687853425:
                                str3 = "ۘۖۥۘۘۦۙۦۛۘۙۢۘۙۖۧۘۤۙۖۘۥۡۡۘۙۥ۟ۘۚۗۥۤ۫ۗۘ۠۬ۤۦۘۨۡۚ۬ۙۖۘۗ۫ۘۘ";
                                continue;
                            case -364742427:
                                String str14 = "۟۟ۢ۬۠ۤۜۢۨۘۥۢۛۦۦۖۘۙۡۘۛۢۘۛ۟ۘۨۘۦ۬ۥۗۧ۫ۘۘ۠ۨۨۘۨۚۙۦ۬ۡۘۖۦۖۘ";
                                while (true) {
                                    switch (str14.hashCode() ^ (-936989403)) {
                                        case -1482786288:
                                            str13 = "ۘۢۖۥۨۘۡۡۥ۬۬ۗۤۤۤۢ۠ۗ۟ۜۗۥۦۧۘ۬ۜۚۛۦۜۘۘۤ۠ۗۚۦۡۥۤۨ۫ۘۘ۬ۘ۫";
                                            break;
                                        case -1125707614:
                                            str13 = "ۜۗ۠ۢۖۦۜۡۡۛۢۛۤۖۥۢ۟ۦۘۡۢۜۘۗۢۦۡۨۚۘۢ۠ۤ۬ۥۘۧۤ۫ۘۨ۬ۢ۬ۗۨ۬ۚۧۗۛۙۘۜۖۚۧۥۦۦۘۨۛۚ۬ۙۥۘ";
                                            break;
                                        case -308101482:
                                            str14 = "ۧۖۜۚۖۜۘۤۥ۟ۤۙۜۘ۬ۨ۠ۤۢ۟۫ۗ۠ۚ۫ۜۘۢۥۗۦۜۖۘۜۤۗۢۖۚ۫ۜۡۦۗۜ۬۫۫ۖ۟ۜۗۖۖۙۧۤۛ۬ۨۥۨۡۤۨ";
                                            break;
                                        case 985759614:
                                            String str15 = "۬ۥۦۘۡۧۨۖۡ۫۫ۚ۫ۜ۫ۚۥۤۥۘۙۗۛۢۧ۟ۜۜۗ۠ۤ۠۠ۖۘۖۡۖۘۖۜۡۘۤۜۚۢۧۗ۬ۢ۬۬۠ۧۨۗ۫";
                                            while (true) {
                                                switch (str15.hashCode() ^ (-1071007108)) {
                                                    case -576185773:
                                                        str15 = view != null ? "ۢۨۘۥۤۨۙۘ۠ۤۥۥۛ۬۬۬ۛۦۗۢۥ۫ۥۙۗۘۥۥ۟ۘۛۢۘۘۡۨۤۦ۬ۙۖۛۖۘۢۡۗۛۘۖۘۙۢۚۛۛۘۘ" : "ۘۛۡۘۙۘۡۛۙۖۘ۟ۘۛۤۢۤۢۛۥ۟ۚۤۛۘۨ۫ۜۖۘۦۙۘۘۡ۟ۨۚۢۚ۠ۡ۬ۖۖۥ۫ۖۧۘۦۡۜۘ۟ۡۗۤۨۥۘۗۜۢۦۤۚۗ۟ۗ۬ۢۖۙۖۖ۫ۛۨۙۥۘۗۜۨۘۚۚۛ";
                                                        break;
                                                    case 801613685:
                                                        str14 = "ۥ۟ۘۘۘۥۡۗۚۥۘۙۖۥۘ۠ۥۜۚ۠ۥۘۘۙۥۛۚۦۖ۠ۙۧۜۢ۠ۨۡۨۤۡۧ۟ۥۦۧۘۘ۠ۜۖۘۙۦۜ۟ۦۘۡۖۗۖ۫ۨۘ۬ۚۡۜ۫۟۬ۨۡۢۖ۬ۨۢ۫۟۠ۛۙۜۡۘۤ۟ۗ";
                                                        break;
                                                    case 948312868:
                                                        str14 = "ۡۨۙۜۘۦۛۤۥۘۗۧۢۗ۟ۢۘۚۨۗۦۘۗۗۖۨۥۦۘۛۨۘۤۖۡۘ۟ۥۡۘۙۖۖۘۧ۬ۛۙۢۦۘ";
                                                        break;
                                                    case 1100199183:
                                                        str15 = "ۦۦۖۘ۬ۜ۬۫۟ۜۖ۠ۗۜ۠ۨۥ۫ۚ۫ۤۜۘۗۧۜ۫ۜۙۨۜۘۤۛۜۘۜۤۡۛۚۨ۠ۡۨۘۡۖۘۧۗۨ۠ۤۦۘۢۗۥۢۤۚۧۛۜۘ۟ۖۖۘۜۧۗ۫ۢۛ۫ۙۤۤۦۘۥ۫۫ۤۢ۠";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 157369002:
                                str3 = "ۧ۫ۨۗ۫ۗۡۧ۫ۛۧ۬ۗۡۨۘۧۖۨۘۗۦۥۘۚۛۨۘۢۛۗۗ۠۫ۖ۟ۡۡۦۖۘۙۚۚۜۙ۬ۨۘۡۦۦۢۛۤۡۘۥ۠ۦۘۘۘۜۘۛۦۖۘۦۗۗ۟ۨۢۙۤۡ۬ۤۤ";
                                continue;
                            case 620328662:
                                str13 = "۬ۨ۫۠ۛۧ۫ۘۦۙۡۧۥۜۜۘۤ۬ۜۘۤ۬ۨۘۚۛۘ۟ۖۡۘۗ۟۠ۛۗ۠ۛۧ۫ۜۨۖۘ۬۠ۧۙۢۢۗۚۨۖۙۚۨۤۥۨۘ۬ۥۘۘۢۤۚۢۛ۠ۜ۠ۨۤ۟۟ۥۥۖۘۗۤۖۡۡۨۘ";
                                break;
                        }
                    }
                    break;
            }
        }
    }

    @Override // p001.InterfaceC0139a4
    /* JADX INFO: renamed from: ۥ */
    public final void mo802(String str) {
        String str2 = "ۛ۫ۗۢۤۖۧۤ۬۬ۘ۟ۗۛۜۘۥۛۜۧۜۥۜۧۥۚۖۗۜۡۛۧ۫ۦۢۤۨۘۚۢۥۘ۬۫ۡۦۥۘۘۖۚۙ۫ۚۛ۟ۖۛۤۢۧۦ۬ۨۦۖۘۘ۬ۜۚۜۦۘ۬ۙۡ";
        a aVar = null;
        String strM915 = null;
        String str3 = null;
        Set<String> setM1053 = null;
        while (true) {
            switch ((((((((str2.hashCode() ^ 444) ^ 226) ^ 55) ^ 818) ^ 382) ^ 257) ^ 953) ^ 733543122) {
                case -2039015287:
                    str2 = "۬ۧ۟ۛۧۨۘۜۡۧۗۜۦۘ۫ۨۘۘۙۘۘۘۥۗۛۤۗۡۨۚۙۧۧۨۦۦۥۘۜ۬۬ۖۨۤۚۗۦۘ۠ۨۦ";
                    break;
                case -1896007767:
                    C0237h4.m1090("processName", str);
                    str2 = "ۨۘۥۙ۬ۧۧۜ۟ۡ۫ۘۘۖۚۥۘۦ۠۟ۚ۠ۡۢۤۜۘ۬ۗۗ۫۫۫۬ۧۥۤۦ۟۬ۢۜۗۛۧۛ۫ۘۨ۟ۡۘۛۚۤۡ۟ۗۧۢۥۘۢۦۜ۠ۧۡ";
                    break;
                case -1804980560:
                    C0237h4.m1089("TabBarControllerCls", str3);
                    str2 = "ۛۡۖۛۛۧۚۥ۫ۦ۬ۥۤۜۙۘۗۦۘۢ۟۟ۚۥۦۙۡۨۘۖۗۚۦ۫ۛۢۙۘۘۗۜۚۖۤۖۘۥۛۖۨۘۚۘۧۘ۫ۦۢ۫۠۟ۦۚۨۦۡۨ۬۟ۧۖۢۨۘ";
                    break;
                case -1273480279:
                    this.f947 = setM1053;
                    str2 = "ۢۜۛۤۛۥۘۗۙ۠ۥۜۡۘۚۡۜۥۨۙۡۘۧۜۘۛ۟ۡۘ۫ۖ۫ۢ۠ۖۢۨۡۘۚۢۙۧۦۡۘ۟ۥۜۘ";
                    break;
                case -1195806001:
                    aVar = new a(this);
                    str2 = "ۙۚۘ۠ۢۦۘۡۚۥۘۗۜۙۤۦۙۡۛۦۘ۟ۛۨۘۢۨۘۤۗۡۤۛۡۙ۠ۦ۬ۛۘۘ۠ۦۤۙۖۘۛ۟ۡۤ۬ۜۦۛ۟ۢۖۨ۬۟ۜۘ۬ۖۘۘۡۧۘۚ۠ۗۗۘۘۜۘۖۘ";
                    break;
                case -510212702:
                    C0373r3.m1208(str3, strM915, new Object[]{Bundle.class}, aVar);
                    str2 = "ۥ۫۫ۙۥۜ۫ۥۚۛۛۨۘ۫ۛۖ۫ۤۘۘ۬ۛۛۖۦۤۖۤۥۗۘۘۦۖۘۛۨۡۘۛۨۘ۬ۙۢ۠ۘۘۘۨۧ۬ۚۘۡ۟ۖۖۘ";
                    break;
                case -504342332:
                    str2 = "ۤۤۦۘۥۡۙۚۤۖۛۧۡ۠ۧ۫۠ۦۢۤۘۦۘۙ۫ۙ۟ۨۡۖۡۘۚۦۜۘۥ۟ۦۛۨۜۚۜۘۜ۫ۤۘۘ۫ۦ۫ۦ۬ۛ۟";
                    setM1053 = C0192e1.m1053(EnumC0164c1.f724);
                    break;
                case -438215132:
                    str2 = "ۜۜۦۘ۬ۘۛۙ۫ۙۖ۫ۛۖۨ۬ۧۨۥۘۜ۟ۧۢۡ۬ۤۡۥۥۘۨۖۗۥ۬ۜۛۚۚۛۢۡ۬ۖۙۖۘ";
                    break;
                case 165701844:
                case 1794511348:
                    return;
                case 584209718:
                    str2 = "ۜ۠۠ۥ۬ۤۙۖۤۡۗۢۦۥۤۧۧ۟۬۟ۥۛۨۧۜ۬ۛ۬ۥۘ۟ۦۜۥۙۜۤۗ۫ۙۨۨۦۜۡۢۨۖ۠ۛ۟ۙۡۗ";
                    strM915 = "onAttach";
                    break;
                case 1492942000:
                    str2 = "ۡ۟۠ۨۢ۫۫ۘۡۘۧۨۖۘۙۘۗ۬ۢۦۡ۫ۥۜۛۤۚۛ۠ۥۤۨۘ۠ۥۧۤۧۚۡۙۦ۠ۥۡۨۨۘ";
                    str3 = C0283k8.f1632.f1599;
                    break;
                case 1548770976:
                    String str4 = "ۤ۠۬ۡۦۖ۟ۥۘۙۡ۠ۚۜۘۙۧۛۥۗۖۙۜۘۘۡۦۜۘۦۛۧ۫ۘۥۖۚۘۘۦۧۨۘۦۜۛۖ۬ۙۜ۟ۡۘۖۗۗۤۡۨۘۡۛۧۦۗۘۘۚ۫ۥۘ۫ۗۡۘ۬۫ۤۘۘۨۘۧۥ۬ۤۙۥۘۢۧۚ";
                    while (true) {
                        switch (str4.hashCode() ^ 236769487) {
                            case 452393914:
                                String str5 = "ۧ۫ۨۙۗۦۘۢۗۢۚۜۖۘۘۙۢۜۘۥۘۖۜۦۘ۟۠ۚۦ۟۫ۧۢۦۘۢۢۚۛۧۢۖ۠ۧۨ۬ۗ۠ۘۦ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-830653676)) {
                                        case -1836775649:
                                            String str6 = "ۛۜۗۘۤۥۘۗۙ۟ۜۥۙ۟ۢۙۖۡۢ۫ۘۚۚۗۧۨۦۡ۬ۛۘۙۗۙۚۧۗۢۜۡۧ۫ۚۥۙۖۜۨ۠ۗۛۢۖۛۡۥۖۘۥ۠ۙ۟ۥۨۘ۬۫ۜۘۨۢۘۘۨۜ";
                                            while (true) {
                                                switch (str6.hashCode() ^ 1684049521) {
                                                    case -303374562:
                                                        str5 = "ۤۖۨۘۨۜ۟ۖۖۡۢۥۧۥۗ۬ۥۚۥۘ۬ۜ۬ۘ۟ۙۙ۬ۜۢ۟ۗ۫ۥۥۘۥۚۦۘۨ۠ۧ۬ۢۢ۬ۖۚۘ۫ۨۦۡ۟۟۟ۖۘ";
                                                        break;
                                                    case 744935457:
                                                        str6 = setM1053.isEmpty() ? "ۥۚ۟ۙۨۥ۟ۡ۟ۧۗۜۘ۬ۘۦ۠ۚۗ۬۬۟ۛ۟۬ۢ۫ۘۘ۟ۧۛۙۦۢ۬ۤ۠ۤۙۚۢۨۖۘۚۤ۫ۗۙۨۘ۬ۡ۫۟ۜۧۘۙۗۨ۫ۖۢۨۦۙۦۨ۠۟ۙ۠ۧۖ۠۠ۗ۫ۡۛۘۘۡۜۨ" : "ۘۘۤۨۖۦۚۢۢۖۜۥۘۤۧۦۡۛ۬۬ۗ۟ۖۘۖۛۦۘ۟ۙۥۖۢۙۨ۫ۗۗۢ۟ۚ۟ۚۛۧۦۚۖ۠ۜۦۘ۟۫۫";
                                                        break;
                                                    case 772610018:
                                                        str5 = "ۜ۟ۡۥۙ۬ۡ۬ۙۛ۠ۗۗۢۤۚۧۖۘ۫ۗۥۘۥ۫ۜ۬ۥۙۗۤۤۖ۠ۜۘۦۨۨۤۚۙ۫۬ۨۘۖ۠۠";
                                                        break;
                                                    case 1487474069:
                                                        str6 = "ۘۜۛ۬ۙۜۘۖۦۡۘۛۚۜۘۧۨۜۘۙۖۜۥۘۜۘۧۤۥۙۘۦۥ۟ۜ۠۬ۤۧۤۡ۠ۚۗۦۡۨۘۜۘ۫۟ۨۗۨۜۙ۬ۘۤۥۡۘۧۦۘۘۙۙۦۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -536894553:
                                            str4 = "ۦۦ۫۠ۨۧۙۦۖۚۛ۟۫ۜۥۘۖۘۘۤ۫۠ۗۨ۫۠ۗۖۘۛ۬ۨۧۥۥۚ۫۠ۡۡۖ۫ۨ۠ۧۤۢۢۤۢۥۚۚۡۦۙ۫ۖۚۡۚۥۤۦۘ";
                                            break;
                                        case -522363030:
                                            str5 = "۫ۧ۬ۦ۫۠ۨ۠۠ۖۚۤۨ۠ۘۘۧۖۜ۬ۧۜۛۗۙ۠۟۫ۦۘۦۗۖ۟ۡۛۧۙۢۨۗۤۡۘۦ";
                                            break;
                                        case 435285522:
                                            str4 = "ۙۡۡۘۨ۠۬ۧۥۡۘۦۘۦۨۗۥۡ۠ۥۘۘ۬ۚ۬ۗ۫ۘۛۗۚۨۘۖۨۘۘۦۜۨۘ۟ۡۘۡۨۛ۟ۦۤۤۡۦۘۡۢۗۖۛ";
                                            break;
                                    }
                                }
                                break;
                            case 724656457:
                                str2 = "ۦۜۨۤ۫۫۟ۥۥۘۘۚۘۘۖ۫ۦۙۧۨۘۜۖۦۘۨۛ۬ۡۖ۬ۥۘ۟ۖ۠ۜۙۘۚ۠ۙۢ۠ۘۘۨۡۡۘۨۧۢۤۘۘ۟۫ۛۢ۫۬۬ۦۥۘۡ۟۬ۤۧۗۛ۠ۙۛۛۛ";
                                continue;
                            case 1399329733:
                                str2 = "ۘۦۜۘۤۚ۫ۛ۟ۡۘۨۡ۬ۙ۫ۜۢۗۡۚۡۦۘ۟ۡۤ۫ۤۖۦۥۜۙۢۥۤۗۨۤۥۙۗۙۙ۟ۖۘ۠ۛۡۘۚۦۧۘۡۖۙۗۘۖۢ۫ۘ۠ۡۦۘۤۧ۟ۤۙۦۨ۫ۨۘ";
                                continue;
                            case 1493259452:
                                str4 = "ۛۨۡۘۖۜۗۦۨ۬ۖ۬ۢۦۚۘۘۙ۠۬۠ۘۗ۬ۙۡۘۤۜۢۗۦۙۜۥۚۧۢۛۖ۬ۤ۫ۤ۟ۥۢ۫ۥ۠ۛۨۜۦۡۡۜ۟۠۟۫ۛ۫ۙۥۗ";
                                break;
                        }
                    }
                    break;
            }
        }
    }
}
