package p001;

import de.robv.android.xposed.XC_MethodHook;

/* JADX INFO: renamed from: ۟.mc */
/* JADX INFO: loaded from: classes.dex */
public final class C0315mc extends XC_MethodHook {

    /* JADX INFO: renamed from: ۥ */
    public InterfaceC0222g3<? super XC_MethodHook.MethodHookParam, C0433vb> f980;

    /* JADX INFO: renamed from: ۥ۟ */
    public InterfaceC0222g3<? super XC_MethodHook.MethodHookParam, C0433vb> f981;

    public C0315mc() {
        this(0);
    }

    public C0315mc(int i) {
        super(50);
    }

    public final void afterHookedMethod(XC_MethodHook.MethodHookParam methodHookParam) {
        InterfaceC0222g3<? super XC_MethodHook.MethodHookParam, C0433vb> interfaceC0222g3 = null;
        String str = "۬ۤۜۘۦۦ۟ۖ۫ۡ۬ۜ۬ۜ۠ۚۘۡۚۘۤۘۘۢ۬ۖۢۡۥۘۨۥۧۘۢۨ۟ۜۖۢۢۛۖۤ۫ۥۢۙۜۘۛۖۥۤۢۧ۠ۘ۠ۜۙۨۨۚ۟۟۟۠ۘۙۥۘ۠ۗ۟ۚۦۡۘۖ۬ۦۘۡۜۤۙۛۥ";
        while (true) {
            switch ((((((((str.hashCode() ^ 837) ^ 364) ^ 341) ^ 6) ^ 357) ^ 400) ^ 833) ^ 1601480521) {
                case -1165677298:
                    str = "ۘۗۚۛۛۨۥۜۧ۫۟ۤ۠ۥۘۡۘۖۙ۠ۥۧۚۛ۠ۨۧ۫۟۬ۗ۟ۡۘۢۤ۬ۢۤۚۛۖ۬ۗۥۚۛۖۜۘۥۜۗۗۗۚ۬۠ۦۙۖۦۥۢۘۘۛۗۦۨۡۖۘۜۨۚۤۚۙۨۦۚ۫۫ۖۘ";
                    break;
                case -858315920:
                    String str2 = "۬ۘۜۛۧۨۨۤۡۘۚۤۛۗۧۨۘۗ۫ۜۘۜۥۜۘۘۦۗۗ۟ۥۘ۠ۖۛۗ۬۟ۧ۫ۘۚۨۧۨۦۦۜۥۘۧۦ۬۟ۙۘ۠ۥۡۢۛۜۜۧۤۜۘ۫۫ۙۦۘۛۙۘۨۥۜۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 782000688) {
                            case -1273562476:
                                str = "ۡۨ۟ۡۦۖۖۘۙۚۡ۫ۦ۟ۘ۬ۡ۟ۚۚۖۦۡۧۧۡ۟۠ۡۤۥۦ۬۫ۛۦۙۚۤۡۜۡ";
                                continue;
                            case -1224995257:
                                String str3 = "ۛۗۗۡۦۦۗ۠ۜۘۧۚۡۘۧۗ۟ۤۦۡۚۖ۬ۚ۟ۤ۟۠۟ۚ۫۬ۘۙۢۖۦ۫۬ۚۘۘ۠ۥۨۘۦ۬ۨۢۨۙۧۧ۬ۖۘۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1328865051)) {
                                        case -1726596030:
                                            str3 = "ۚ۫ۥۘۡۦۚۗ۬ۢۛ۫ۥۦۧ۬ۜۖۜۘ۟۠ۢۢۘ۠ۤۢ۫ۙۢۨۘۙ۬ۤۢ۟ۙۥۦۘ۫ۛۡۥ۟";
                                            break;
                                        case 176872341:
                                            str2 = "ۤۜ۠ۥۦۥۦۚۘۘۤ۠ۡۘۢ۬ۧۢۤۜۘ۫۬۟ۚۜۘۘۘۦۛۛۚ۬ۙۘۘۛ۠ۖۛۖۚۡۘ۠ۨۛۜۛ۠ۛۧ۠۫ۤۛۖ";
                                            break;
                                        case 1139317612:
                                            String str4 = "ۚ۬ۦۗۢۚ۬ۖ۠ۗ۬ۜۡۤۛۤۡۜۘۗۤۦۤۦۨۘۥۜۖۜۡۧۘۘۜ۫ۦۘۚ۟ۥۥۚ۟ۥۘ۫ۧۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1050100805)) {
                                                    case -1821266286:
                                                        str3 = "ۖۦۧۨۖۜۘۢۤۘۘ۬۬ۥۘۚ۬ۜۘۤۧ۠ۤۥۜۖۚۨۚ۟ۖۘۧ۬ۨۛ۫ۤۘۦۜۘۚۦۤ۠ۨۗۨۙۘۘۦ۟ۧۧۙ۟ۚۧۦۚۦۘۦۧۡۘۧۥ۬ۥۢۚۦۨۤۥۚۦۗۙۦۢۤۥۘۢۘ۫";
                                                        break;
                                                    case -1010776434:
                                                        str4 = interfaceC0222g3 != null ? "ۤۨۜۘۙ۠۟ۡۘۖۘۗۤۘۘ۫ۘۧۥۥۜۘۛۦۧۘ۟ۗۥۘۧۜۡۘ۠ۗۡۘۙ۠ۡۥۨۘۨۛۧ۠ۤۦۜۦۖۘۚۨۚۘۨ۟ۥ۟۬ۡۢۘۘۗۡۦۘۥۗۗ۠ۤۙۘ۠۬ۚۢ۟" : "ۖۤۥۘۧۜۥۘ۟ۢۜۘۚۥۨۘۦ۟ۖ۠ۥۜ۟ۘۘۧۖ۠ۛۡۦۘۜۜۛۢۥۥۡۥۡۘۜۦۗۜۨۖۛۦۤ۫ۢۜۘۥ۟ۛۗ۟ۙ۠ۖۜۢۜۜۛۧۖۛۙۖۙۜۥۡۨ";
                                                        break;
                                                    case 731036751:
                                                        str3 = "ۚۡۧۦۚۢۦ۬ۨۘۥۜۛۧۤۛ۟۠ۡۘۗ۠ۥۘۙۤۖۛ۫ۦۘۡ۟ۛۛۡۨۡۛۖۘۥۡۧۘۜۘۛۡۨۘۥۚۘۘۨۚۗۡۥ۠";
                                                        break;
                                                    case 1760467290:
                                                        str4 = "ۥۚۗۜ۠ۦۘۗ۫ۖۘۚ۠۟ۜۜۘۢۦۖۜۛۗۘۧ۟۠ۙۨۤۗۨۖۜۜۢۜۤۚۙ۟ۡۥۦ۫۬ۦۘ۫ۨۤ۟ۜۙۜۘۡۢ۠ۦۘۢۚۖۘ۫۫ۤ۠ۡۥۘۗۘۚ۬ۛۖۘ۟ۘ۟ۙۧۥۗۚ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1592705905:
                                            str2 = "۫ۥۖۙۙۗ۠ۜۘۘ۬ۜۛۥۛۡۦۧۘ۠ۢۚ۫ۛۛۗ۠ۨ۬ۜۧۘۘ۫ۡ۫ۡۘۘۤۖۜۤ۟ۤ۟۟ۨۘۘۗۢۛۨۤۛۤۨۘۖ۬ۨۘۜ۬ۥۘ۟ۜۖ";
                                            break;
                                    }
                                }
                                break;
                            case -1171744055:
                                str = "۫ۘۛۥۚۜۘۚۡۘۘ۠ۨۡۨۦۘۦۜ۟ۡۛۦۗۛۙۗۗۚۛۖۥۘۗۚ۫ۥۡۙۖۘۘۘۛ۫ۗۢۗ۟ۢۡۧۘۛۧۖۘۥۘۥۙۘۛۛۧۡۘۗۖۥۤۜۧۘۦ۟ۛۗۧۡۘ";
                                continue;
                            case -1025702579:
                                str2 = "ۗۖۢۙۢ۠۫۬ۗۗۧۖۘۜۤۧۤۚۡۘ۟ۘۦۘۡۗۥۛۛۚۙۗۘۘۢۚۡۘ۟۠ۘۘۙۦۘۢ۠ۡۘۢ۬ۢۜۖۢۡۗۙۤۤ۟ۨ۠ۦۘ۟ۖۙۡۦۦ";
                                break;
                        }
                    }
                    break;
                case 111817331:
                    interfaceC0222g3 = this.f981;
                    str = "۟ۡۧۘۖۜۥ۟۟ۥۘ۫ۤۗۜۘۜۘۗۗۗۘۘۨۘۡ۠ۨۛۡۚ۟ۘۡۤۨۗ۬۟ۗۡۖۛۗۗۙۦۘۤۡۢۨۦۘۜۧ۠ۗۜ۬ۢۚۘۘۙۡۡۧۙۙ۬ۖ۠ۗۚ۠";
                    break;
                case 254364906:
                    C0237h4.m1090("param", methodHookParam);
                    str = "ۦۤۘۡۙۡ۠ۢ۬ۡۘۢۥۜۗۗ۟۫ۙۧۨۡ۬ۖۘۤ۠ۡۘۦۢۖۘ۟۟ۜۘۘۧۖۗ۟ۖۥۥۛۛۦۨۥۨۧۧۛۡۛۛۖ۬ۦۙۢۥ۠ۖ۠ۜۘ۬ۖۜۖۥۘۗۦۦۘ۠۠ۙ۠ۧۛ۬ۤۦ";
                    break;
                case 406342011:
                    interfaceC0222g3.mo984(methodHookParam);
                    str = "ۡۨ۟ۡۦۖۖۘۙۚۡ۫ۦ۟ۘ۬ۡ۟ۚۚۖۦۡۧۧۡ۟۠ۡۤۥۦ۬۫ۛۦۙۚۤۡۜۡ";
                    break;
                case 1114095348:
                    return;
                case 1842387632:
                    str = "ۧۖۨۘۙۗۥۘۥۗۧۘۡۘۚۥۘۘۛۜۥۤۛۙۨۙۨۘۙۡۙۦۖۘ۫ۗۘۜۤۜ۫ۘۦۤ۠۫ۘۤۨۘۦ۠ۘۥۙۨ۠ۖۘۢۚۖ۬۠ۢۨۢۨ۟ۛۖۘۙۤۗۛۢ۟ۗ۫۟ۢۡۛۜۜۡۘ";
                    break;
            }
        }
    }

    public final void beforeHookedMethod(XC_MethodHook.MethodHookParam methodHookParam) {
        InterfaceC0222g3<? super XC_MethodHook.MethodHookParam, C0433vb> interfaceC0222g3 = null;
        String str = "ۨۖۦۘۛۖۗ۬ۙۙۦۛ۠۠ۤۘۘۖۖ۟ۛۛۜۘۥۨۜۘ۬۫ۡۘۢ۟ۨۜۨۚ۬۫ۥ۟ۙ۟ۤۤۖۗۙۡۛۖۙۡ۟ۥۛۨۡ۟ۗ۬ۚۙۘۡۙۥ۫ۧ۫ۤۘۛۖۜۘۨۙۡۛۦۧۘ۟ۧۡ";
        while (true) {
            switch ((((((((str.hashCode() ^ 353) ^ 1015) ^ 322) ^ 256) ^ 495) ^ 982) ^ 253) ^ 1909579229) {
                case -1867603717:
                    return;
                case -313785757:
                    str = "ۜۥۜۜۥ۫۫۫ۚۚ۠ۙ۠ۤ۟ۥ۠ۡ۫ۥۖۘ۬۟ۢۚۛۦۤ۠ۜۘۦۜۘۘۖۥۦۘۡ۬ۘۘۡۥۜۨۘۙۤ۟ۥۚۛۜۘۖۥۡ۟ۦۤۘۛ۟۬۫ۙۚۧۦۘۚ۫۬ۧۦۗ";
                    break;
                case -285776475:
                    String str2 = "ۗۛۗۧ۠ۦۘ۬۠ۘۥۘۘۤۨ۬ۛۢۥۘۥۥۛۙ۬ۜۘۛۗۤۡۦۖۘۦ۬ۖۖ۟۫ۥۚ۠۠۟۬ۘ۟۫ۖۛۜۘۤ۬ۘۛۘۦۥۥۨۘۚۛۡۙۢۦۨۢ۬۟ۢۦۘۦۦۤ";
                    while (true) {
                        switch (str2.hashCode() ^ 152173174) {
                            case -1694142292:
                                str = "ۢۚۡ۬ۧۗۤۡۡۘ۫ۦۚۤ۠ۜ۠۫ۛۧۘۥۘۘۖۥۡۙۥ۬ۗۚۤۛۤ۠ۙۛۧۦۥۖۥۦ۫ۜۧۗۥۘۖۘۖۖ۟ۖۘۤۧ۬ۦۖۦ۟۬۬ۤۖۤۖۘ۫ۢۚۗۖۧۘۚۨۖ۬۠ۡ";
                                continue;
                            case -1352671293:
                                str = "ۗۨۨۘ۫ۛۚۙ۟ۦۘ۫ۢ۠ۦ۟ۙۡۙۚۤ۠ۙ۫ۘۨۘۘۦ۠ۛۚۘۘۦۛۥۘۙۗۘ۟ۤۤۜۤۨۛۧۖۘۥ۠ۜۘۙۤۥۘۛۡۚۢۧۨۥۢۖ۬ۡۛ۬۟ۨۜۥۜ۬ۡۦۘ";
                                continue;
                            case 69208762:
                                String str3 = "۠ۧۜۘۥۡۖۘۡۢ۟ۜۤۗ۫ۘۤۘۢۥۛۧۗ۟ۦۛۤۨۘۘۧۜ۫ۙۤۙۡۨۘۘۘۙۗۡۧ۠۫ۘۚۡ۠ۚۢ۟ۖۥۘۗۧۧۚۡۢۛۜۨ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1832826502)) {
                                        case -1951948271:
                                            String str4 = "۟ۦ۠۟ۦۦۜ۟ۙۘۦۧۢۨۧۘۘۚۧ۫ۢۤۨ۟ۖۘۙۥ۬ۖۢۖۘۜ۬۬ۜ۠ۜۘۘ۟ۙ۟۬ۨۙۦۜۡۧۦۘۖۥۖۘۘۛۥۘۧ۬ۖۙ۠ۜۘۢۘۜۘ۠۬ۗۥۨۧۖۢۨ۠ۧۧۨۤۦۡۛ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1191937776) {
                                                    case -1722155552:
                                                        str3 = "ۦۜۖۜۛۖۘۦۗ۬ۧۥۘۘۜۦۧۛ۟۫ۙۦۛۤۗ۬ۛۢۛ۟ۜۘ۟ۧۛۘۖۤۚۖۜۘ۟۟ۙ۠ۥ۟ۙۖۘ۠ۛۨۘۧۢۛ";
                                                        break;
                                                    case -1556137752:
                                                        str4 = "ۙۨۗۖۛۚۘۚۖۥۜۘۗۧۥۘۨۤۡۘۗ۟ۗۦۜۨۘ۠ۦۗۗۤۗ۠ۘۜۡۛ۠ۧۢۘۘۖۖۦۘۦۗۤۨۨۜۦۜۥۡۛۜ۬ۥ۟۟ۘۡۚۜۛۦۥۨۘ۟ۧۡۥ۠ۨۧۦۨۘ۫ۥۥۘۚ۟ۡ";
                                                        break;
                                                    case -505162745:
                                                        str4 = interfaceC0222g3 != null ? "ۤۙۘۘ۠ۡۜۘۛۧ۫ۥۘۙ۫ۧ۟۫ۚۥۘۦۥۧۥۖۧۘۤ۠ۤۘۛ۫ۥۢۚۤۚۛۡۦۜۘ۟ۥۜۘۖۖۜۘ۬ۙۥۘ۠ۥۢ۬ۧۦۗۘۥۘۡۛۦۦۗۖۘ" : "ۡۘۛۢۖۨۧ۟ۧۖۖۨۘ۟۟ۨۥۨۜۘۛۧۤۗۗ۟ۢۜۖۘ۟ۙۙۦۥۖۛۘۨۗ۟ۧۛۜۛۗۙۛۨۥۢۧ۟ۨۗۥ۫ۚۖۛۧ۠ۦۘۘ۫ۢ۬۠ۖۤ۫ۙ۟ۜۦۘ";
                                                        break;
                                                    case 566423455:
                                                        str3 = "ۚۥۘۢۖۘۗۙۘۢۘۖۙۦ۫ۢ۫ۚۘۦۦۘۜۢۙۖۙۦ۠ۤۧۚ۫ۨۦۡۖۜۖ۫ۧۢۨۚۨۖۘ۬ۙۖۘۚ۠۠ۨۦۦۧۙۖۘۡۤۢ۟ۦۥۘۘ۫ۗۢ۟ۗۗۤۛ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -63865435:
                                            str2 = "ۥ۟ۧ۬ۨۥۜۛۥۘۙۜۥۤۨۘۗۧۢۨۨۚ۬ۨۘۖۦۘۙۧۖۘۘۘ۬ۗۙۡۛۨ۫۫ۚ۠۠ۢۗ";
                                            break;
                                        case 1438840800:
                                            str2 = "ۙۖۘۘ۫ۜۥ۬ۘۘ۠ۖۦۤۥۜۜۜۖۜۗۦۥۥۧۛۙۦ۬ۚ۫ۗ۠ۛ۫ۖۛۘۜۘۙۨۛۖ۠ۥۗۗ۠۬۠ۥۘۙۙ۫ۨۥۖۘ۟ۖۘۤۨۜۘۙۛۨۢۦۢۛۘ";
                                            break;
                                        case 1673501029:
                                            str3 = "ۦۨۡۗۗ۠ۡۗۧ۠ۥۖۘۜۦۤۡۜۜۘ۟ۘۥۘۤۡۜۤ۠ۦۢ۬ۗۗۤۙۗۤۦۘۤۛۖۘ۠ۜۧۘۖۢ۠";
                                            break;
                                    }
                                }
                                break;
                            case 1460375069:
                                str2 = "ۛۥۥۘۛۗۗ۬ۛۥۘۥۗۛۚۥۨ۬ۖۦۧ۫ۖۜۨۥۘۛۡۦۧۧۜۘۦ۟ۘۘۥۢ۠ۦۙۤ۟ۦۨۨ۫ۨۘ";
                                break;
                        }
                    }
                    break;
                case 278897561:
                    C0237h4.m1090("param", methodHookParam);
                    str = "ۨۙۡ۬ۙۦۘۛۦ۟ۚ۠ۖۘۨ۠ۦۘ۬ۨۖۘۚۗۙۤ۠ۡۘ۟۟ۦۧۘۖۜۢۘ۟۠ۦۥۤ۬ۡۧۙۜۘ";
                    break;
                case 853729571:
                    interfaceC0222g3.mo984(methodHookParam);
                    str = "ۗۨۨۘ۫ۛۚۙ۟ۦۘ۫ۢ۠ۦ۟ۙۡۙۚۤ۠ۙ۫ۘۨۘۘۦ۠ۛۚۘۘۦۛۥۘۙۗۘ۟ۤۤۜۤۨۛۧۖۘۥ۠ۜۘۙۤۥۘۛۡۚۢۧۨۥۢۖ۬ۡۛ۬۟ۨۜۥۜ۬ۡۦۘ";
                    break;
                case 1427394161:
                    str = "۠ۦۨۘۤۚۦۗۗ۫ۥۜ۟ۜۙۢۙۤۗۥۖۚۡۛۦۡۖۥۖۨۖۡۘۨۛۚۤۨۦ۟ۚۡۥۤۜۢ۟ۢۥ۫۠ۗۨۘ";
                    break;
                case 1754265091:
                    interfaceC0222g3 = this.f980;
                    str = "ۢۖۙۗۜۘۘۙ۟ۘۤۘۨۘ۟ۛۘۘ۬ۦۡۘۢ۟ۗۥۜۢۨ۟ۘۡ۠۟ۨۥۡۢۚۡۧۦۤ۟ۘۘۧۗۡۘۧ۬ۗۢۥۡۙۛۧۦۦ۬۫۟ۦ۟ۗۦ۠ۡۘۘۚۘۚ۬۫ۜۤۛ۟ۗۙ۟ۚۢۥ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ */
    public final void m900(InterfaceC0222g3<? super XC_MethodHook.MethodHookParam, C0433vb> interfaceC0222g3) {
        String str = "۠ۥۜۤۖۨۡۨۘۧ۬ۙۚۤۥۘ۬ۖۜۘ۫ۜۖۘۜ۫ۢۡۢۛۢۙۧ۫ۙۖۖ۫ۡۨۡۖۘ۠ۧۨۤۨۛۙۨۖۘۨ۠۬ۛۙۨ";
        while (true) {
            switch ((((((((str.hashCode() ^ 74) ^ 6) ^ 856) ^ 756) ^ 686) ^ 54) ^ 896) ^ (-1473760956)) {
                case -1845750767:
                    str = "ۥ۫ۦۘۨ۬ۡۘۛۨۥۛ۫ۘۘ۫ۢۛ۟ۧۜۘ۫ۚ۬ۨۢۦۘۡۛۘۧۚۚۢۖۨۘۖۖۘۘۦۜۢۚۢ۠ۛۙ۬۬ۘۜۘ۠ۢۥۢۤۡۘ۫۬۟ۤۜۧۚۚۡۘۘۘۢۛۘۖۗۗۗۘۨۘۘۖ۬ۛ۫ۙ۬";
                    break;
                case -1328279074:
                    return;
                case -1167116949:
                    this.f981 = interfaceC0222g3;
                    str = "ۧۙۤۧۙۜۤۛۙۗۧۥۘ۫ۢۗۤۧۜۧ۟ۛۥۧۘۡ۠ۢۛۗۢ۠۟۠ۤۚۘۘ۫ۚۦۘ۟ۜۥۗۤۘۘۙۨۘ۠ۧۚۗۖ۫ۙۜۘ۠ۙۚۖ۬ۡۘ";
                    break;
                case -858165128:
                    C0237h4.m1090("after", interfaceC0222g3);
                    str = "ۛۚۦۢۚۨ۬ۥۧۦۘۙۖۜۦۛۥۘۦۛۜۘ۬ۘ۬ۥ۠ۛۤۜۘۘۘ۬ۜ۟ۘۡۦ۫۠ۗ۠ۦ۟ۥۡۨۜۤۥۘۚۧۦۘۚۨۧۘۜۢ۟ۘۢۙ";
                    break;
                case 1856561904:
                    str = "۫۟ۘۘۤۘۤۡ۬ۖۙ۠ۤۤۛۛ۟ۥۙۚ۟۬ۡۖۖۤۥۗ۫ۡ۬ۜۨۡ۫ۜۘۥۚ۫ۤۥۖۡۢۜۧۡۘۥۙ۬ۡۘ";
                    break;
            }
        }
    }
}
