package p001;

import android.view.View;
import de.robv.android.xposed.XC_MethodHook;
import p001.C0283k8;

/* JADX INFO: renamed from: ۟.ma */
/* JADX INFO: loaded from: classes.dex */
public final class C0313ma extends AbstractC0335o4 implements InterfaceC0222g3<XC_MethodHook.MethodHookParam, C0433vb> {

    /* JADX INFO: renamed from: ۥ */
    public static final C0313ma f969;

    static {
        String str = "ۦۘ۬ۗۗۡۙۚۛۥۧۡۧۗۧۨ۫ۡۜ۫ۨۧ۟ۗۨۤۜۘۧۜۙۨۙۜۘۛۖ۫ۢۗۤۜۙۦۖ۫ۖۘۥۦ۬ۨۗۜۘۜۙۡ";
        while (true) {
            switch ((((((((str.hashCode() ^ 357) ^ 260) ^ 880) ^ 111) ^ 328) ^ 327) ^ 555) ^ (-1737342755)) {
                case -1604074191:
                    return;
                case -1121279000:
                    f969 = new C0313ma();
                    str = "ۢۥۡۦۦۨۦۖۖۘۜۚۤ۟ۦۖ۟ۚۙ۬ۘ۠ۥۨۖۤۧۖ۬ۥۘۖۡۢۦ۠ۖۘ۫۫ۨ۠۠ۖ۫ۖۘۜۡۘۡۦۜۘ۬ۘۦ";
                    break;
            }
        }
    }

    /* JADX DEBUG: Method arguments types fixed to match base method, original types: [java.lang.Object] */
    /* JADX DEBUG: Return type fixed from 'java.lang.Object' to match base method */
    /* JADX WARN: Failed to find 'out' block for switch in B:4:0x0033. Please report as an issue. */
    @Override // p001.InterfaceC0222g3
    /* JADX INFO: renamed from: ۥ۟۟ */
    public final C0433vb mo984(XC_MethodHook.MethodHookParam methodHookParam) {
        XC_MethodHook.MethodHookParam methodHookParam2 = null;
        ViewOnClickListenerC0271ja viewOnClickListenerC0271ja = null;
        View viewM1159 = null;
        String str = null;
        Class clsM1199 = null;
        Integer numM1205 = null;
        int iIntValue = 0;
        int i = 0;
        int i2 = 0;
        Integer numM12052 = null;
        int iIntValue2 = 0;
        int i3 = 0;
        int i4 = 0;
        View viewFindViewById = null;
        View viewFindViewById2 = null;
        String str2 = "ۤۚۙۛ۠ۥۥۧۢ۠ۦۤۢۛۖۘۖۛۢۖۚۗ۠ۨۘۘۖۘ۬۠ۛۘۙۢ۬۬۟ۨۨۢۖۘۧۧۥۤۙ۠ۡ۬ۘۘ۠۟ۥۗۘۢ";
        while (true) {
            switch ((((((((str2.hashCode() ^ 84) ^ 1000) ^ 144) ^ 107) ^ 979) ^ 894) ^ 592) ^ 423645687) {
                case -2094467440:
                    str2 = "۟۟ۡۘۦۧ۫ۜۢۖۧۚۜۘۨۨۢۧ۫ۦۜۢۜۘۙۥۖۘۙۤۙۤۜۨۘ۫ۨۛ۟ۢۜۘۜۦۖۙۥۢۚۘۤ";
                    i2 = i;
                    break;
                case -2066606876:
                    str2 = "۟۟ۡۘۦۧ۫ۜۢۖۧۚۜۘۨۨۢۧ۫ۦۜۢۜۘۙۥۖۘۙۤۙۤۜۨۘ۫ۨۛ۟ۢۜۘۜۦۖۙۥۢۚۘۤ";
                    break;
                case -1792410119:
                    String str3 = "ۤۚۨۘ۠۫ۧۨۜۘۦۗۥۘۧۢۨ۫ۤ۬ۧۢۛ۠۫۬ۜۥۘ۠ۤۚ۟ۘۨۘۚ۫ۡۘ۠ۡۘۘ۠ۜۜۘۜۚۘ۠ۚۦۛۚۨ۬ۖ۠۬ۙۦۘۜ۫ۗ";
                    while (true) {
                        switch (str3.hashCode() ^ (-1124697374)) {
                            case -1149876713:
                                str2 = "۟ۜ۟ۨ۟ۜۘۥۦۤۥۘۜ۠ۦۥۘۗۛۘۜۥۧۘۙۦۥۦۥۘۡۛ۠ۘۡ۠ۜۥۦۘۛۗۜۘ۠۟ۦۧ۫۟";
                                break;
                            case -755494197:
                                break;
                            case 684472418:
                                String str4 = "ۢ۬ۧ۟ۚۖۘۘۧۛۜۛۖ۫ۤۨۘۦ۟ۖۘۗۦ۫۟ۘۚۡ۬ۦۘ۬ۨۛ۬ۜۧۘۛۤۜ۠۫ۨۘۨۘۛۤۤۖۚۙۖۖ۠ۙ۬ۢۧۛ۫ۜۘۤۤۚۨۗ۬";
                                while (true) {
                                    switch (str4.hashCode() ^ 1572688018) {
                                        case -2106112570:
                                            str3 = "ۢۜ۟ۘۚۛۘۤۨۛۨۨۘۦۛۜۦۥ۬ۚۢۧۧۖۨ۬ۗۦۘۢۥۨۙۛۗۨۡۨۘۤۚۚ۟ۖ۟ۚ۟ۥ۠ۘۡۘۚ۟ۢۡۢ۫ۡۡ۠ۖۚۚ۬ۙۢۜۨ۠ۙۗۢۥۧۘ";
                                            break;
                                        case -834569770:
                                            String str5 = "ۤۧۥۘ۠ۦۖۚ۬ۜۘۧ۟ۚۨۗۨۘۙۙۖۘۗ۬ۘۘۥ۬ۜۘۘۤۥ۠۠ۤۛۨۡ۬ۤ۫ۘ۬ۤۜۛۜۢۘۢۜۚۖۦۙۜۘۤۤ۟ۤۚۜۘۤ۫ۜۘ۠ۖۗ";
                                            while (true) {
                                                switch (str5.hashCode() ^ 1042551681) {
                                                    case -2002286688:
                                                        str4 = "ۖۚۘۚۙ۫ۚۛۜۧۤۜۤۛۘۘۜۙۨۚۡۜۙۥۧۗۘ۬ۤۤۖ۟ۘۢۢۜۧ۫۟۠ۥۧۢۗۜۖ";
                                                        break;
                                                    case -399506829:
                                                        str5 = i2 != -1 ? "۠ۥۘۘۤۡۘۚۙۧۤۡۢ۟۫ۚۗۗۥۚۥۘۢۙۦ۬۠ۛۡ۠۬۬ۧۗۘۢۜۘۦۘۘۘ۫ۥۦۘۦ۬ۜۚ۠ۙۙۗۡ۬ۢۨۜۛۜ۠ۘۥ۟ۨۜۚ۫ۥۛۚۧۥ۫ۘۘ" : "ۜ۠ۤ۬ۛۧۢۦۤۡۖۥۛۥۘۜ۫ۜۛۡ۟ۜۘۢۚۜۖۘۡۘۨۢۜۡۛۦۗۗۚ۫۫۠ۡۨۡۘ۫ۤۙۧۙ۠ۗۡ۬ۢۖۛ۠ۢۦۗۚۦۘۚۨۘۤۢۨۘۧۙۘۘ";
                                                        break;
                                                    case -311432862:
                                                        str5 = "ۖۥۗۦۡۧۨ۠ۚۦ۫ۖۘۙۧۨۤۥۧۧۥۢ۬ۗۦۘۗۥۡۖۖۖۘۧۦۨۜۜۖۗۗۗۧۡۢۜۨۜ";
                                                        break;
                                                    case 591499052:
                                                        str4 = "ۘۛۘ۫۠ۦۘۤۗۜۜ۬ۜۘۜۨۧۜۥۡۦۚ۠ۦۘۘۗۡۙۙۧۥۖۢۗۡۙۨۘۤۧۜۘۛۢۘۗۡۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -538682782:
                                            str3 = "ۙۥۧ۟ۧۖ۠ۡۢۘۢۘۘۖۘۖۘۡ۟ۦۘۖۛۗ۫ۤۢۨۧۧۗ۬۬ۦۗۨۘۥ۬ۤ۫ۨۡۘ۟ۥۛۙ۠ۨۘۙۙۜۘۗۥۜۨ۟ۦۢۧۧۡ۫ۥۘ۫۠ۖۘ۫ۢۧۚۛۚۙۛ۟";
                                            break;
                                        case 233268997:
                                            str4 = "ۥۥۘۘۗۗۜۘۡۢۜۘۖ۠ۥۦۜ۫ۙۙۤۙۖۛۖ۠ۨۙۧۜۘۖۦۡۘۡۦۧۗ۬ۗۗۥۢۛۖۘۛۤۘۘ";
                                            break;
                                    }
                                }
                                break;
                            case 1127568166:
                                str3 = "ۦ۠ۖۙۘ۫ۗۚۚۘۧۖۘۗۤۚۘۗۖ۬ۨۢۜ۠ۢۡۖۙۨ۬ۡۖۢۖ۠ۚ۠ۥۡۘ۬ۢ۟ۙ۬ۤ";
                                break;
                        }
                    }
                    break;
                case -1499457363:
                    numM1205 = C0373r3.m1205(clsM1199, "liveAvatar");
                    str2 = "ۗۛۤۛۙۤۛۜۗۢۖۡۘۙۥۢ۟ۜۦۘۦ۬ۡۥۖ۠ۧۦۗۙۖۦۖۛۡۨۜۤۛۘۘۥۛۜۨۨ۫ۨۢۘۘۘۛۧۙ۫ۙۙۗۨۘ۟۫ۜۘۧۖۥۘۤۜۗۦۨۗۦۦ";
                    break;
                case -1398865351:
                    str2 = "ۚۢۛۨ۠ۧۜۜۘۙۨۚۖۚۛ۟ۙۚۗۢۡۤۘۘۘۡ۟ۦۘ۬ۗۤۙۛۖۛۢۖۖۘۡۥۗۙ۠ۘۥ۬۟ۡۛۘ۠ۨ۠ۦۜۘۜۧۗ۠ۤۗ";
                    i2 = iIntValue;
                    break;
                case -1325163084:
                    C0325n8.f994.getClass();
                    str2 = "ۛۤۨۘۗ۟۬۬ۛۥۘۢۙۘۘۡۤۚۧ۠ۜ۫ۚۨۘۢۡۗ۠۬ۜۡۙۦۨۘۧۘۜۗۖۘ۟ۗۦ۟ۨۧۘۜ۫۟";
                    break;
                case -1061005977:
                    String str6 = "ۢۡۘۘۘ۟ۡۜۚ۟ۗ۬ۧۚۛۤۡ۬ۢۚۛۡۤ۬ۢۘ۬ۙ۠ۗۡ۫ۧۨۖۛۜۥۜۚۚۗۘۘ۟ۤۜۢۧۛۘ۫۬۠ۚۙ۠ۢ۬ۦ۠ۦۘۨ۫ۗ۫۬ۨۘۙۗۜۧ۫ۡۚۘۥ۫ۘۨۤۦ۫";
                    while (true) {
                        switch (str6.hashCode() ^ 794491378) {
                            case -1872652019:
                                break;
                            case -284638988:
                                str2 = "ۖۨۙۘۜۨۘ۟۫ۜۤۦۦۧ۟ۧۜۗۡۘۖ۫ۥۤ۫ۦۘ۬ۖۦ۫ۢۧ۟ۚۦۘۜۖ۠۠۟۟ۢۙۤۖ۠ۨۘۛ۟۟ۙۜ۟۫ۙۘۘ۫ۗۘۘۢۦۡۖۖۜۘۜۧۜ۠ۡۧ۫۫ۧۗ۫ۘۘۘۡۥۙۚ";
                                break;
                            case 1268008318:
                                String str7 = "ۧۙۥۨۘۧۘۜ۫ۢۜۥۛۥۖۦ۫ۡۜۘۨۛۨۘۚۥ۟ۜۙۦ۬ۨۧۡۜۥۘۚۛۖ۫ۧۚۛۘ۠ۥۨۥۘۧۤۢ۫ۜۦۗۢۡۘۧۢۥۘۖ۠ۜ۫ۚۘۘۡۧۗۙۧۖۘۥۖۛ";
                                while (true) {
                                    switch (str7.hashCode() ^ (-1775407274)) {
                                        case -1483005570:
                                            str7 = "ۦۜ۟ۙۗۦۜۘۨ۬۫ۚۙ۟ۡۘۙ۬ۡۜ۟ۖ۫ۖۥۤۢۦۖۖۘ۫ۡۘۡ۬ۨ۬ۧۡۘ۬ۤۧۦۗ";
                                            break;
                                        case -997044337:
                                            str6 = "ۢۜ۟ۜۤۜۨۛۨ۬ۢ۟ۡۜۨۨۙۤۘۦ۫۬ۧۢۛۘۘۘ۬ۚۨ۠ۨ۠ۧۙ۬ۥ۠ۥۧ۫ۘۦۡۘۛۛ۫ۢۤۙۚۘۡ";
                                            break;
                                        case 1065537183:
                                            str6 = "ۨ۟ۘۘ۫ۨ۫ۨۤۜۘۗۦۜۘۢۢۙۨۙۡۘۙۤۜۘۚۖۛۧۙۜ۠ۨۡۘۢۘۢ۬۬۟ۤۛۜۘۢۡۤۗۢۦۗ۫ۜ۟۠ۧۛۥۛ۬۫ۖۤ۠ۜۡۖۤ۫ۨۥۡۘ۬۬ۗ";
                                            break;
                                        case 1172587025:
                                            String str8 = "ۙ۫ۘۚۦۖۧ۫ۗ۟۠۬۫۟ۤ۬ۜۘۢ۬۟ۚ۠ۥۘۢ۠ۥۦۜۙ۬ۨۨۗۧۥ۬ۨۘۛ۠ۗۗۛۙۘۚۙۚۗۖ۫ۛۡ";
                                            while (true) {
                                                switch (str8.hashCode() ^ 1518877604) {
                                                    case -2012873653:
                                                        str8 = clsM1199 != null ? "ۥۜۘۚۖۧۧۡ۠ۥۢۦۥ۫ۗۙ۠ۘۙۦۚۜۗۥ۬ۡۘۧ۠۫ۢۧۖۙۙۨۢۥۦۦۨۛۖ۬ۡۨ۬ۨۥ۬۠ۜۛۨۜۗۥۘۖۖ۟ۙۗۛۢۢ۬۫۫ۧۚۜۜ" : "ۥۘۛۥۖۙۘۚۥۥۚۡۙۗۙۚۦۡۘۜۗۘۘۡۘۛۥ۫ۘۘۖۧۜۘۚۙۖۘۡۙۢ۠۟ۛۧۙۤۤۥۨۘ۟ۧۖۡۦۡۘۛ۟ۚۘۛۜۘۗۜۛۜ۠ۦۘۤۖۘۘۢ۟ۥۘ";
                                                        break;
                                                    case 170546674:
                                                        str7 = "ۛۘۦۘۙ۬ۜۤۢۨۘۙۨۖۡۧ۫۫ۥ۟ۙۛۢۨۛۚۧۧ۬ۛ۫ۚۥۘ۬ۘۡۘۘۤۡۡۡۨۘۨۦۨۘۥۙۤۖ۠ۡۧۘۙ۠ۢۜۘۦۡۨۘۥ۬۠";
                                                        break;
                                                    case 996167648:
                                                        str8 = "ۥۖۥۗۘۦۘ۠۬ۢۛۤۨۖۙ۟ۨۖۜ۫۫ۜ۠ۙۦۘۜۜۖۘۢ۫ۦۘ۬ۜۘۘۙۙۦۘ۬ۦۘۘۦۜۘۡۧۜۖۚۗ۬ۖۡۘ۫ۜۖۧۜ۫ۖۢ۠ۦ۠ۦ۟ۥۘۡۧۧۧۙۢ";
                                                        break;
                                                    case 1052303774:
                                                        str7 = "۬ۙۛۥ۠ۥۘۖۥۥۘۗ۬ۥۘۤۙۦۙۜۧ۟ۚۦۦۖۘۥۚۖ۫ۦۗ۫ۤۜۦۖۘۥۖۜۥۧۖۘۢ۟۟";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 1647733442:
                                str6 = "ۚۤۥۢ۫ۨۘۡۚۧۢۧ۠ۖ۬۠۫ۙۖ۠۬ۦۨۜۧۘۥۦۨۡۜ۬ۙ۟ۛۢۘۡۘۢ۬ۡۘ۠ۜۖۘۗۦۘۘ";
                                break;
                        }
                    }
                    break;
                case -894947924:
                    viewFindViewById.setOnClickListener(viewOnClickListenerC0271ja);
                    str2 = "ۧۡۚۗۛ۫ۚۡۧۘۚ۬ۙۛۗ۟ۛۡۡ۟ۛۖۖ۠۠ۢۧۢ۠ۨۘۘۤۛۢۜۛۢۙۢۖ۟ۘۛ۠ۨۧۘۨۦۜۘۘ۠ۜۧ۫ۚ";
                    break;
                case -823879334:
                    str2 = "۟ۧۜۘۘۛۢ۬ۙۙۢۗۧۦۜۛۡۜۨۘۘۗۜۜۦۗۚۙۥۘۤۙۖۦۥ۬ۧۤ۠ۦۥ۠۫ۜۥۘۚ۟ۦۘۦۤۗ۟ۤۢ۬۠ۡۘۜ۫ۜۗ۠ۜۨۦ۬ۦۘۥ۠ۜۤۗ۬ۥۘ۠ۘۧ۫ۗ۠۟ۜۜۘ";
                    methodHookParam2 = methodHookParam;
                    break;
                case -740409368:
                    str = C0283k8.a.m885().f1536;
                    str2 = "ۢۘۨۘۡۙۨۗۢۗ۫ۘۘۦۘۚۤۜۜۜۜۧۘۙۥ۫ۥۚۥۘ۠ۢۙۛۙۜ۠ۘۘۤۛۤۙۚۨۘۡۤۥۘۤۜۡۘ۬ۜۜۘۦۙۥۧۤۡۘۙۥۤ۬۠ۚۙۧۛۗۤۚۙ۟۟۟ۤۨۘ۫۫ۤۙ۫۫";
                    break;
                case -725656106:
                    i3 = -1;
                    str2 = "ۤ۬ۚۦۧۢۖۦۘۧۗۜ۫ۜۡۘ۬۫ۘۗۧۥۛۗۡ۠۫ۨۘۥ۟۟ۜۡۗ۫ۡ۟ۧۢۤۢۛۤۢ۠ۘۘۥۧۥ۠۟ۖۘۡۗ۬۠ۦ۬ۡ۠ۡۙۧ۫ۚۧۜۘۥ۫ۙ۠۬ۨۧۚۨۦۖۖۤۖ۬";
                    break;
                case -490560780:
                    String str9 = "ۖۧۦۜۛۘۨۛۨۘۖۘۘۘ۟۫ۦۛۚۖ۬ۦۖۘۦۘۧۘ۫ۡۦۘۛۤۥۙ۟ۜۘۥۧۦۘۚۢۦۘۜۤ۠ۨۡۘ۠ۜۛ۟ۡ۬ۙۘۛۜۤۡۘۚۥۘ۬ۦ";
                    while (true) {
                        switch (str9.hashCode() ^ (-1091759522)) {
                            case -1675924584:
                                str2 = "ۧ۠ۖۘ۫ۛۛۨۢۡۘ۟ۢ۫ۦۙ۬ۢۘۜۘۖۤ۫ۥۖ۟۟ۛۦۘۥۚۦۘۡۛۜۘۜۤۨۖۗ۟۬ۤ۫۟ۚۥ";
                                break;
                            case 276190819:
                                String str10 = "۬ۖۗۜۢۛۢۦ۬ۨۖۘ۠۫ۙۤۗۡۘۛ۬ۢۗۜۜۛۙ۬۫۠۫۠۫۬ۗ۟ۡۥۜۡۘۡۨۧۘۨۛۘۘ";
                                while (true) {
                                    switch (str10.hashCode() ^ 588725357) {
                                        case -1339857345:
                                            str9 = "ۚۦۦۘۥۘۖۘۖ۫۫ۢۜۘۦۧۢۛۙۘۚ۫۫ۥۚۖۘ۫ۤۗۚۧ۟ۢۦۥۛۦۛ۟ۛۛۧۚۢ۟ۜۤ";
                                            break;
                                        case -967782479:
                                            str10 = "ۖۘۖۘۤۧۖۘۘۤۚۡۙۜۘ۠ۛ۫ۢ۠ۨۦۙۤۙۢۘۜۖۘ۫۬ۖۜۜ۠ۜ۟ۖۨۨ۟ۦۖۢ۟۟ۘۘ۬ۦۥۘ۬ۚۛۨۖۧ۫ۨ۟۬ۥ۟ۤ۠ۧ";
                                            break;
                                        case 743069952:
                                            String str11 = "ۗ۟۫۠ۧۨۧۗۧۛۥۘ۠ۤۜۧ۫ۦ۬ۢۥۘۡۨۢۡۗۧۗۤۜۘۧۢ۟ۧۦۡۘۢۛۘۘ۟ۤۜۘۘ۟ۖۘۦۛۗۛۥۦ۬ۡۧۤۦۜۘۤ۠ۦ۬ۖۜۜۘۘۘۢۘۖۖۥۧ";
                                            while (true) {
                                                switch (str11.hashCode() ^ 1202996335) {
                                                    case -1390340045:
                                                        str11 = clsM1199 != null ? "ۜۨۦۘۤۦۨۘۘ۫ۢۤۗۘۡۥۘ۬ۛۦۘۛۘۘۘۛۖ۫۫۬۠ۙۡۜۗۨۙۙۗۢۗۖۙۚۚۗۚۖۡ۟ۚۖۨۘۨ۫۟ۗۘۙۡۗۢۖۢۘ۬ۤۡۘۗۨۜۥۘۥۗۡۜۘۚۧۘۘ۫ۧۗ" : "۠ۜۜۙۥۙ۠ۗۙۦ۫ۥۘۦۙۘۨۨۢۜۜۙۥۡۦ۟ۘۖۗۘۖۘۚ۟ۖۘۜۜۧۘۤۧۙۤۨۨۘۢۛۜۘۗۙۤۙ۫ۜۘۨۤۦۤۢۛۚۛ۬ۖۙۨۘۗۥۢۨۨۡۢۙ";
                                                        break;
                                                    case -914005624:
                                                        str10 = "ۥۦۢۙۜ۫ۥۘۦۘۚ۫ۙۡۚۨۤ۫ۡ۟ۗۛۖۨۦۘۘۨۨۤۡ۠ۡۘ۠ۛۦ۫ۡ۫ۗۧ۬ۚۘۤۘۦۛۚۥ۟ۡۘۘۖۘ۫ۡۜۚۢ۠ۙ۠ۛ";
                                                        break;
                                                    case 764526513:
                                                        str11 = "ۡۛۤ۬ۘۘ۟ۗ۬ۥۦۘۦۧۚۦ۫ۧۘۡۦ۬ۡۘۦۢۗۦۘۘۘ۬ۤۚۗۢۘۡۡۢۛۨ۟ۜۗۗۚۛۘ۬ۤۨۙۙۨ";
                                                        break;
                                                    case 1455434574:
                                                        str10 = "۟ۜۥۘۨۡۨۘ۟ۡۜۧ۟ۙۨۦۜۨۜۨۚۨ۟ۖۤۦۘۨۙۚ۠ۚۘۘ۫ۡۖۘۡۢۨۡۘۖۘۥ۫ۜۙۜۧۘۘۨۤۜۡۖۘۦۗۦۘۚۗۢ۬ۤۖۦۗۜۘۗ۬ۖۤ۫ۢ۟ۛۖۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1074274893:
                                            str9 = "ۛۜ۫ۡۥۜۘۜۨۤۙ۟ۜۘۗۦۨ۬ۥۥ۠ۥۘۙۛۦۘۢۗۥۘۖۜۡۥۡۘۘۗۤۡۘۧ۬ۜۘۙۡ۟۟ۛۜۘۚۜ۫۫ۦۛۜۜۡۘ";
                                            break;
                                    }
                                }
                                break;
                            case 293206675:
                                str9 = "ۖۗۥۘۢۧۡۢۜۥۡۡۘۘۨۤۚۧ۟ۜ۠ۖۚۜۧۘۚۨۙۨۨۨۖ۟ۖ۫ۨۢۗۦۥۢۢ۫ۖۖۘۚۢۢۥۦۙ۟۠ۡ";
                                break;
                            case 1322023017:
                                break;
                        }
                    }
                    break;
                case -457066678:
                    viewFindViewById2.setOnClickListener(viewOnClickListenerC0271ja);
                    str2 = "۫ۘۢۙۖۥۘۘۦۨ۠ۤۤۢۗۡۘۤ۟ۨۙ۫۫ۥۖ۫ۧۨۘۘۗۥۤۡۡۥۖۡۤۘۛ۟ۘۥۚۢۦۘۛۚۤۦۤۙۜۜۦۥۛۜۘ۫ۢۛۜۡۦۘۡ۠ۚ۟ۜۦۘۜ";
                    break;
                case -424175488:
                    viewM1159 = C0325n8.m1159(methodHookParam2);
                    str2 = "ۗۤۛۖۡۚۧۚۦۥۗۖۘۛۘۢۙۖ۬ۦ۟۠ۜۗۗۥۨۖۘۘۖۘ۠ۧۙۤۗۡۘۥ۟ۘۗۦ۬ۛۖۥ۠ۜۖۛۢۨۘ۠۠ۥۤ۬ۘۙ۬ۘۘۦۚۖۥۥۘ۬۠ۥ۟ۚۗۙۦ۠ۧۨ۫۬ۖ";
                    break;
                case -349127469:
                    C0237h4.m1090("it", methodHookParam2);
                    str2 = "ۦ۬ۜۘۢۨۡۘۦ۫ۘۛۗۛۘۚۦۘۢ۫۬۠۬ۦۘ۬ۗ۬ۡۘ۟ۤۤۘۘ۠ۥۨۘۖۦۛۙ۟ۙۡۚۦۥۙۖۡۗۡ۬ۖۡۘۨ۫ۘ۠ۢۨۧۘ۬ۦۘۧۚۨۡۥۘۘ۟ۗۛۧۥۘۗۛۥۚۛۖۘ";
                    break;
                case -345490661:
                    C0237h4.m1089("RedViewRIdCls", str);
                    str2 = "ۚ۠ۗۦۨ۠ۥۡۦ۬ۚۜۘۦۜۜۗۘۦۘۖۥۦۘۜۥۘ۟ۗۜۘۦۤۖۘۛ۟ۘۥۜ۠ۖ۫۫ۡۤ۟۟";
                    break;
                case 353285:
                    i = -1;
                    str2 = "ۥ۬ۗۜۜۥۘ۬ۙ۬ۥ۬ۦ۟ۗۛۦۧ۟ۡۥ۫۟ۧۢ۠ۛۘۘۥۢۖۢۦۨۘۢۥۥۦ۬ۜۗۖۦۨۢۖۥ۬۟ۚ۠ۜۧۨۤۖ۠۫ۢۘۘ۠ۢۛ";
                    break;
                case 2574014:
                    viewFindViewById = viewM1159.findViewById(i2);
                    str2 = "۫ۢۖۘۜۚۙۧۜۘۡۚ۟ۛۜۢ۫ۨ۬ۥ۫ۧ۟۫ۛۧۘۘۨۤۗۨۛ۬ۜ۟ۘ۠۫ۤۧۡۖۘ۬ۛۜۗۦۛۧ۫ۦ۫ۡ۠ۧۢۛۥۘۨۜۡۚۧۨ۬ۧ۠ۘۙۚۥۘ";
                    break;
                case 205221242:
                    C0274k c0274k = C0283k8.f1632;
                    str2 = "۫۬ۚۘ۫ۜۨۖۘۦ۫ۗۙ۠ۦۘ۠۟ۧۜۦۤ۟ۤۘۘۡۢۚۗ۬ۢۙۧ۠ۥۦۘ۟ۘۛ۟ۖۗۗ۫ۦۘ";
                    break;
                case 214648798:
                    String str12 = "ۦۦۖۘ۫ۖۡۙۜۘۖۦ۫ۢۧۖۥۗۤۤۤۨۘۗۘۗۛۙۙۡۧ۠ۧۢۜۘۥۙۖ۠ۢۙ۠ۤۡ۟ۡۨۘۨۛۜۘۜۛ۟ۖۨۢ۠ۡۘۥۖۜ۬ۗۧۛۗۨۢۨۘۡ۫ۥ";
                    while (true) {
                        switch (str12.hashCode() ^ (-1011471790)) {
                            case -1568418292:
                                str12 = "۬۫ۦۥۢۗۖۨ۟۫ۘۗ۟۫ۖۘۗ۠ۚۤۘۜۘۘ۫ۢۥۛۡۘۤ۬ۢۨۤۜۘۨ۠۬ۤۘۨۜۥۨۘۘۦۘۢۚۚۜۧۨ۟ۢۦ";
                                break;
                            case -1311239902:
                                str2 = "۟ۤ۟ۚۛۡۘۢۦۖ۠ۜۦۤ۫ۢۥۡۜۘۧۨۥۜۖۧۘۥ۫ۦۖۜۨۘۢۜۘۤۜۢۤۜۜۘۧۜۡۦۛۤ";
                                break;
                            case -767715145:
                                String str13 = "ۦ۫ۡ۫ۘۖۘۤۗۦۙۥ۫ۜۘۙۚۡۘ۟ۗۢ۫ۛۜۘۧ۠ۧۡۖ۫ۙۜۨۘۘۚۦۧۖۧۘۧۜۖۖ۠ۡۚۜۥۘۧۤۛ۫ۨۜۖ۫ۤ۫ۚۖۘ۟۠ۨۘۧ۟ۥۘۤۤۘۡۙۘۘ";
                                while (true) {
                                    switch (str13.hashCode() ^ 1407708451) {
                                        case -1869762688:
                                            str12 = "ۡ۬ۙ۠ۚۙۢ۫ۖۘۧۡۘۘ۫۠ۖۗۘۡ۬ۗۖۘۤ۬ۦۛۥۛۥۤ۬ۤۘۜۘ۬ۧ۟۫ۜۡۜۚۢ۠ۘ۟ۖۛۘ۬ۧۛۡۖۡۘ۟ۘۧۘۢۡ۬۫ۤۘۘ";
                                            break;
                                        case 115895331:
                                            str12 = "ۤۥۧۘ۠ۚۨۘ۫ۗۗۛۛ۬ۗۖۤۧۥۘۧ۠۬ۤۧۡۘۢۙۛۖۖۦۘۛۧۨ۫۫ۡۤ۫ۦ۠ۛۨۘۚۙۡۜۦۨۙۢۢ۫ۜۘ۠۠ۦۘ۬۟ۨۘۖۖۧ";
                                            break;
                                        case 471057725:
                                            String str14 = "ۧۨۙۛۘۘۥۗۙۦۛۤۨۘۤۜۙۜۘ۟ۦۦۥۙۤ۠ۛۥۘۚ۬ۘۦۘۦۘ۬ۖۘۡ۟۟ۙۘۥۨۡۧۤۜۨ۟ۦۚۚۛ";
                                            while (true) {
                                                switch (str14.hashCode() ^ (-188261710)) {
                                                    case -1482211751:
                                                        str13 = "ۧۙۙۘۖۙ۫ۛۛۨۗ۫ۤ۬ۢۨۨۜۘۧۨ۫ۗۤ۠۠۟ۧۤۨۨۦۧۡۜۘۨۡۤۡ۬۫ۚ۟ۛۦۘۨۥۦۘۢۧۜۘ";
                                                        break;
                                                    case -836988176:
                                                        str13 = "ۘ۫ۗۢۡۧۧۙۦۘۗۖۘۘۜ۫ۦۚۖۡ۬ۢۢۥۘۦۥۨۘ۫ۙۖۘۘۚۦۘۛۘۧۖۛۡۘۗۖۖۘ۟ۗۦۘ۬ۜۘۦۘۥۗۖۖۘۛۘۜ۟ۧۗ۟ۛۡۘ";
                                                        break;
                                                    case 1790445210:
                                                        str14 = "ۛۜۚۘۦۧۚ۬ۖ۫ۢۚۙۧ۠ۗۘۢ۟ۚۨ۫ۥۨۖ۟ۛۡ۬ۥۘۗۗۜۘ۠ۚ۬ۥۗۙۢۖۨۛۦۙ۠ۗۚ۠ۙۡۜ";
                                                        break;
                                                    case 2080868058:
                                                        str14 = numM12052 != null ? "ۙ۫ۚۘۨ۫ۤۗۖۥۧۥۗۤۜۘۨ۫ۘۖ۫ۖۥ۫ۥۘۡ۠ۥۘۘۙۘۘۗۤۨۘۡۨۘۖۜۦۘ۟ۤۡۘ۬۠ۢۛۡۡۘۚ۬ۨۚۖۘۤ۟ۜۗۜۗۗۧۦ" : "ۖۢۤۖۗۡۘۡۚۧۗۧۚۙۡۧۘۧۧۨۜۧۥۘ۫ۜ۫ۙۢۦۢۢۚۥۙۦۙۧۘۘ۬ۧۗۘۥۘۚ۬ۡۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 903424382:
                                            str13 = "ۢۨۨۘۚۡۚۗۢۤ۠ۥ۬ۡ۟ۧۧۥۘۤۛۧۧۡۖۥۚ۠ۡ۬ۜۘۚ۫ۙۛ۠ۨۖۨۘۘۦ۠ۜۨ۟ۢ";
                                            break;
                                    }
                                }
                                break;
                            case 1563837854:
                                break;
                        }
                    }
                    str2 = "ۧۤۗۜۦۚۚۚۜۘۧۙۡۛۤ۬ۨ۬ۜۘۢۤۡۗۚ۫۟ۦ۬۠۫ۘۤۚۦۘۛۙۦۘۖۖۚۧۧۡۘۡۨۜ۠ۙۨ۟ۡۧۘۚۦ";
                    break;
                case 879874897:
                    break;
                case 941105637:
                    String str15 = "ۡ۫ۙۧۗۦۘ۬ۚۛ۬ۦۜۘۦ۠ۘۜۚۖۘۦۨۡۘۗۗۥۢۢۨۜۨ۠ۢۜۙۘۚۜۘ۬ۖۧۘ۬ۜۡۚۘۘ۟ۦۚۨ۠ۦۘۘۚۦۜ۠ۜۘۘۡۡۘۛۙۚ";
                    while (true) {
                        switch (str15.hashCode() ^ 619350670) {
                            case -1121831378:
                                String str16 = "۠ۜۤۨۧ۠۠ۥۖۘۥۦۜۘۥۢۥ۬ۦۚۨۖ۬ۗۥۧۘۜۙۖۘۚۤۗۢۖۢۙۢ۫ۧ۟۠ۘ۬ۨۖ۠ۨۥ۠۠ۙۥۧۘۡ۠۠ۗۛۥ۬ۥۤۡۙۖۘ۟ۙۜ۫ۛۡۡۗۨۘۡ۠ۦۗۥۤۖ۟ۧ";
                                while (true) {
                                    switch (str16.hashCode() ^ (-774116631)) {
                                        case -2078369373:
                                            str15 = "ۨۗۖۙۙ۫ۖۡۙۜ۬ۚۢۚۡۥۤۚۥۙۙۢۖۜۘۗۛۜۘۢۤۡۘۧۦ۟ۧۥۡۘۛۛۡ۫ۤ۬ۜ۬ۦ";
                                            break;
                                        case -1108802282:
                                            String str17 = "۫ۦ۬۬ۡ۬۬ۢۗۨۢۢۢۢۦۘ۠ۙۖۘۜۧۨۘۤۥۤ۬ۛۦۡۚۛۛۨۡۜۤۥۤۢۨۘۦ۫ۘۘۜۤۛۦ۫ۜۘۘۢۤۨۚۤۥۧۘۗۨۥۨۥۘۙۤۢۤۖۨۡۜۜۘ";
                                            while (true) {
                                                switch (str17.hashCode() ^ (-635607883)) {
                                                    case -2028401854:
                                                        str17 = "ۤۘۢۖۧۧۡ۟ۥۘۖۛۥ۠ۛۜۘۗۨۡۗ۟ۥۨۥ۫ۦۗۦۘۨۢۖۙۦۖۖۡۦۤۦۛۜۖۤۙۤۛۘۜۜۘۘۨۡۘ۟۬۬ۥۧۨۜۢۥۘۛ۟ۚۤۜۥۘۢۨۥ۟ۨۡ";
                                                        break;
                                                    case -1684816119:
                                                        str16 = "ۗۡۡۘۡۥۜۤۜۨۘۢ۫ۚۜۘ۬ۘۡۢۦۜۢ۟ۚۚۢۜ۫ۖۥۚۗۖ۬ۦۧۤۗۢۦۤ۬۟ۖ۫";
                                                        break;
                                                    case -699517367:
                                                        str17 = numM1205 != null ? "۠۫ۧۛۡ۫ۥۧۗۚۘ۠ۥۚۙ۠ۘۨۘۦ۫ۛ۟ۚۜۘۛۥ۫۫ۤۖ۬ۤۗ۫ۜۘۘۧ۬ۡۘ۟ۛ۟ۥۘۛۖۜ۫ۙۦۥۢۡۘ۠ۖۖۘۡۘ۫۬ۢۡۜۘۥۘۙۖۨۡۤ۬ۢ۬ۨۘ۠۟ۛۥۜۖۘ" : "۟۬ۨۘۙۢۖۘۥۦۧۗۘۥۘۗۗ۫ۢۤۥۤۨۜۘ۫ۙۥ۠ۙۖۧ۠ۜۜ۠ۘۘۧۜۦ۠ۘۖۘ۬ۛۘ۫۬ۧۛۡ۬ۢۘ۬ۖۨۚۗۗ۬ۚۦۚ۬۠ۨۘۤۗۡۖۡۜ۬۫ۨ";
                                                        break;
                                                    case 298267660:
                                                        str16 = "ۗۡۡۦۢۛ۫۬ۜۤۦۜ۠ۙۘۚۥۨ۠ۦ۫ۘۜۤۡۡۡۘ۫۫ۜۘۖۥۡ۫۟ۦۘ۟ۜۖ۬ۡۖۘۦۖۜۘۨۙ۠ۖۧۢۦۤۡ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 705559243:
                                            str15 = "ۛۧۡۘ۫ۦ۟ۜۗۘ۬ۦۨۘۨۚۘۘۢ۠۠ۡۚۧۜۖۥ۟ۚۘ۬ۛۢۡۖۘۦۦۧۗۢۦۘۤۨۡۙۥ۫ۨۖۤۜ۠ۖۘۧ۫ۨ";
                                            break;
                                        case 910446950:
                                            str16 = "۫۟ۡ۫ۢۢۘ۬ۗ۫ۥۛۤۙۘۦۤۜۘۡۤۘۘۜ۬ۙ۬ۧۦۘۤۦۧۙۢۖ۫ۨۤۖ۠۟ۨ۫ۥ۫ۨۗۤۙ۟ۧۡۤۦۘ۟ۢۧۨۖۗۗۙۜۢۢۚۤۙۨۘۢۖ۟ۤۖۜۘۧ۠۬ۨۡۥۘ";
                                            break;
                                    }
                                }
                                break;
                            case 272756645:
                                break;
                            case 304785478:
                                str15 = "۫ۨۦۤۨۥ۟ۘۧۧۜ۟ۚ۫ۖ۟۠ۘۦۗۨۢۥۖ۠ۖ۬ۡۧۤ۬ۜۜۘۗ۟ۨۜۥ۬ۢۘۨۘۤ۟ۥۘۥۘۢۧۨۘۤۚۘۘ۬ۥۙۚۥۘۡ۠۫ۙ۫ۡۧ۟ۨۘۖ۟ۦۘ";
                                break;
                            case 925474160:
                                str2 = "ۡ۠ۢۥۗۦۖۡۡۦ۠۠ۙ۫ۡۘۜ۟ۦ۬ۧۨۖ۠ۛۨۥۛۜۙۘۘ۬ۛۙۛۦۨۥۗۗۗ۬۠ۛۦۧۘۢۙۥۘ۬ۧۘۜۚ";
                                break;
                        }
                    }
                    str2 = "ۙۤۘۙۧ۠ۥۜۗ۬ۚۧ۠۟ۡۛۥ۬ۜۚۡۘۥ۟ۨ۫ۖۦ۬ۛۗۙۜۨۘۛۦۘۗ۟۠ۨ۬ۦۥۗ۠۟ۦۥ۟ۤۜۙ۬ۦ";
                    break;
                case 1043747731:
                    iIntValue = numM1205.intValue();
                    str2 = "۟ۙۜ۫ۨۡ۠ۢۥۘۤۛۨ۟ۤۥۧۨ۠۫ۛ۫ۗۢۜۘۨۛۨۘۧۗ۬ۗۛ۬ۧۛۧۜۘۘۙۗۢۤ۟ۢۢۜۗۘۙۖۘۦۘۤۧۦۧ۬ۡۖۘۦۘ۬ۚۜۤۡ۬ۦ۠ۦۤ";
                    break;
                case 1238026411:
                    str2 = "ۦ۟ۨۗۚۥۘۘۗۘۘۜۥۘۖۗ۠ۚۨۗۡۥۘۘۨۙۤ۠ۗۘۖۨ۟ۦۜۘۛۖۦۘ۫ۦۨۨۦۥۦۙۙ";
                    i4 = iIntValue2;
                    break;
                case 1276935691:
                    String str18 = "ۙۡۜۜۦۥۢۚۦۛۢۜۘۖۥۗۜۢۜۘ۠ۖۧ۫ۥۨ۠ۛۜ۫ۖۜۘۚۤ۬ۙۚ۬۠ۚۤۗۖ۬۫۫ۥۘۙۘۘۢ۠ۨۘۚۡۨ";
                    while (true) {
                        switch (str18.hashCode() ^ (-133599350)) {
                            case -1765732893:
                                break;
                            case -13669394:
                                String str19 = "ۖۚۧۖۦۘۘ۟ۡۘۘۥ۠۟ۢ۬ۨۘۧۢۖۗۤۤۢۖۤۡۙۤۦۙ۬ۜۡۘۨۤۖۘۤۜۛۗۜۦۘۨۥۘۥ۠ۧ۠ۦۨ۟ۖ۟ۨ۟ۦۘۗۗۖۢ۠ۥۘ";
                                while (true) {
                                    switch (str19.hashCode() ^ 803871205) {
                                        case -2094742205:
                                            String str20 = "ۤۙۦۘۧۘۗۘ۬ۢۦ۠ۥۘۤۥ۟ۡ۫ۙۦۤ۫ۧۨۘۧ۬ۗۖ۠ۚۜۖۘۡۚۖۤ۠ۛۦۛۜۘ۠ۚۙ۟ۙۖۘ۬ۚ۠ۦۖۡۨۘۖۘ۠ۖۛۚۦۡۘۡ۫ۥۘۘۧ۟۫ۖۖۡۖۘ۬۬ۖۘۚ۠ۜ";
                                            while (true) {
                                                switch (str20.hashCode() ^ (-1405927614)) {
                                                    case -1174497024:
                                                        str19 = "۠۠ۤۛۡۨۘ۟۟ۧ۫ۡۚۗۡۖۦ۠ۚۧۡۨ۫ۘۦ۬ۛۚۤۡ۬ۦۘۙۘۖۡۖۥۚ۬ۦ۟ۦۥ۬ۖ۫ۥۘۡۤۜ";
                                                        break;
                                                    case -284419421:
                                                        str19 = "۠ۛۦۘۚ۫ۥۘ۫ۨۗۙۙۘۘ۟ۗ۫ۖ۬۠۟ۘۢۧ۬۟ۢۦۢۘ۟ۨۢ۟ۖۦۡۢۥۨۘ۠ۢ۟ۙ۬ۡۨۜ۟ۢۚۖۤۡ۠";
                                                        break;
                                                    case -87334877:
                                                        str20 = viewFindViewById2 != null ? "ۖۚ۫ۦ۠ۛۚۚ۟ۨۥۚ۬ۘۧۙۛۖۦ۟۬۠ۨۘۡۥۥۨۛۖۘۛۛۜۚۤۚۧۘۜۘۛۚ۬" : "ۦ۟ۡۗۡۥۘۨ۠۟ۡ۟ۦۦ۟ۥۘۤۗ۟۫۟۟ۨۦۨۘ۫۠۟ۦۜ۟ۜۢۦۘۘۖۗۦۙۢۧۦۗ۠ۡۘۘ۠ۢۦ۫۟۠ۘۥۘۘ";
                                                        break;
                                                    case 1583622918:
                                                        str20 = "ۛۘۖۘۧۗۘۡۜۡۖۛ۫۟ۥۧۙۖۖۘۜۛۛۡۙۤۖۚ۫ۥۖۧۦۦۜۡۚۡۡۗ۫ۢۨۜ۫ۛۖۨۢۡۖ۠ۧۢۗۨۛۨۨ۠۫ۧۥۜۧۦۘۢۨۢ۫۠ۡۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -35702991:
                                            str18 = "ۙۗۘۢۘۘۗۤۦۘۤۥ۬ۢ۠ۡۘۚۡۤۗۖۛ۬ۢۨۘۦۢۚۗۙ۟ۦ۟ۥۘ۠ۡۚۢۦۦ۬ۘۨۘ۫ۨ۟ۨۢۚۤۥۢۡۚۗ";
                                            break;
                                        case 472260482:
                                            str18 = "ۧۥۧۘۚۛ۫ۥۡۘ۠ۘ۬ۗۡۧۘۚۦۘۘ۫ۙۥ۫ۦۥۘ۫ۤۖۘۛۥۘۘۧۘۘۙۨۘۘۥۡ۠ۛۨۦۜۦۦ";
                                            break;
                                        case 1147134921:
                                            str19 = "ۨۛ۬۫ۙۘۖۜۦۗۘۖۘ۠ۗ۫ۛۘۘۘۗۢۢۘۙ۟۬ۤۤ۟ۤۤۤۙ۠ۥۖ۫ۨ۫ۤۡۗۨۡۧۦ۫ۜۘۨۙۦۗۗۜۚۜۘۧ۟ۙ۬۫۫ۜۜۚۛۚۘۚۨ";
                                            break;
                                    }
                                }
                                break;
                            case 1234622763:
                                str18 = "ۜۦۥۘ۫ۥۜۥۖۗۧ۬ۤۡ۫ۜۘۨ۬۟ۘ۫ۥۘۥۗۥۘۧۥ۠ۖۜۡۗۦ۟ۛۖۚۨۤۦ۬ۢۦۙۨۡۥ۫ۙۦۧۦۚۨۤۛۧۘۙۙۥۘۛۨ۟ۦۥۘۖۦۘۘ۟ۚۗۦۦۨۘۗۨۗۘۘۛ";
                                break;
                            case 1975623431:
                                str2 = "ۖۚۡ۟ۨۙۥ۫۫ۗۖۙ۟ۢ۟ۚۜۦۗۛۢۡۥۙۢۦۡۥۨۡۘ۫ۥۦۘۢۤۡۥۜۗۤۛ۫ۦ۟ۗ";
                                break;
                        }
                    }
                    str2 = "۫ۘۢۙۖۥۘۘۦۨ۠ۤۤۢۗۡۘۤ۟ۨۙ۫۫ۥۖ۫ۧۨۘۘۗۥۤۡۡۥۖۡۤۘۛ۟ۘۥۚۢۦۘۛۚۤۦۤۙۜۜۦۥۛۜۘ۫ۢۛۜۡۦۘۡ۠ۚ۟ۜۦۘۜ";
                    break;
                case 1342923462:
                    String str21 = "ۨۛۥۘ۬ۥۘۗۧۡۘۤ۠ۦۘۙۖۧۘۥۘۡۘۗۡۙۘۧۤۚۡۛۤۖۧۧۜۢۚۦۧۤۧۘۘۜۗۘ۫ۗۡۘۙۦۖۘ۬ۖۦۘۗۘۖۘ";
                    while (true) {
                        switch (str21.hashCode() ^ (-1963212902)) {
                            case -928170578:
                                str21 = "۬ۚۜۘۙۤۤۛۖۡۘۥۦۦۘۥ۟ۙ۫۟ۖۥۗۖ۬۠ۦۘ۠ۙۜۙۗ۟ۚ۠ۘۖ۫ۖۘۡۛۜۘۦۚۖۗۤۚۛۗۛ۫ۢۗ";
                                break;
                            case -709889376:
                                str2 = "ۖۚۘۘۦ۬ۡۘۚۧۡۢۨ۠ۗۨۘۜۡ۬۟ۨۢۢۛۛۨ۫ۡۘ۫ۦۢۙ۠ۤ۟ۧۚۡۜ۫ۢ۟۟ۤۨۛۙۢۧۦۢ۬ۦۧۤ۠ۢۛۤۜۡۛۡۙۘۙۖۚۥۜۨۥۘۙۙۖۘۤۦ۫ۜۛۡ";
                                break;
                            case 591450706:
                                break;
                            case 1510279818:
                                String str22 = "ۧ۠ۗۦۛۘۦۗۦۘۚ۠ۗۢۡ۟ۨۙۖ۟ۙۛ۬ۙۤۢۜۘۜۢۘۡ۬ۜۘۗۦۜ۟ۛۤۚۜۚۘۛۘۘ۠ۡ۫ۦۙۘۖۢۤۚۗۦۘۥ۬ۨۨۦۘ۬ۧۢ۟ۢۗۦۡۙ";
                                while (true) {
                                    switch (str22.hashCode() ^ (-1314051794)) {
                                        case -1067724861:
                                            str21 = "۬ۢۡۨۧۙ۬۬ۦۘۧ۠ۢۥۤۡۜۨۙۢۨۡۘ۠ۧ۬ۤۡۘۛۤ۫ۘۘۥ۫ۖۚ۟ۛۡۤ۠ۤۥۜۥ۟ۗۦۦۡۡۘۨۚۤۥۗۢ۟۟ۘۤۖۥ۟ۡۛ۬۠ۜ۬ۡۤۙۙۙۧۨۘۛۦۥۘ";
                                            break;
                                        case -68300476:
                                            str22 = "ۡ۠۟ۙۙۛ۠۠۟ۤۥۤ۫ۡۨۚۨۖۘ۟۠ۡۖۢۛۙۖۗۖۨۨۙۛۡۘۜۤۛۡۦۖۤۙۘۜۛۡۡۧۘۦۖۡۘ۫ۙ۟ۜۨۦۡۧ۠ۧۘۢۛۨۖۘۧۨ۫۟ۖۙ۟ۡۘ۬ۥۤ۬ۙ۟";
                                            break;
                                        case 24688259:
                                            String str23 = "ۨ۬ۜۥ۫۬۟ۥۜۘۦۜۘۨ۟۟۬ۤۦۗۗ۫ۥۥ۬ۤۨۡ۟ۛۖۘۧۖۖۚۖۡۨۥۤۤۦۥۘۦ۠ۤ";
                                            while (true) {
                                                switch (str23.hashCode() ^ (-2032264616)) {
                                                    case -272104528:
                                                        str23 = "ۧۢۦۘۛۜۘۘ۬۫ۖ۟ۜۨۘۡۙۙ۬ۙۢ۬ۡۢۘ۬ۦۚۙۦۨۛ۠۬ۘ۬ۜۖ۠ۧۚۡۡ۠ۛۚۖۛۤۖ۠ۦۛ۠ۤۤۘ";
                                                        break;
                                                    case 145137142:
                                                        str23 = i4 != -1 ? "۠۠ۨۘۡ۟ۖۚۘۗۡۛۜۘۛۤۚۘۡۙۤۤۨۨۚۦۜ۟ۥۘۛۧۥۜۘۥۘۤۥۚۗۡۨۨۗۘۢۜۨۢۜۜۛۘ۬ۡۘۘۗۢۦۦۦۛۦۢۨۨۦۘ۟۟ۖۘۘۨۗۥ۟ۦۙۛۡۨ" : "ۦۜۡ۬ۡۘۛۧۦ۬ۢۛ۟ۦۜۘ۟ۚۗۨۢۜۘ۬ۗۖۘۡ۟ۦۘ۟ۤۙۜۘۖۧۥۥۥۖ۟۟ۜۡ۟ۢۜۧۤۡۚۤۥۘۚۙۤۧۙۖۘۘۛ۟۠ۥۙۛۖۗۚۨۧۡۢۢ۫ۤۖۢۙۡۘۨۖۦ";
                                                        break;
                                                    case 1069872413:
                                                        str22 = "ۛۛ۠۠۟ۥۘۚ۟ۘۙۧۧۚۚۚۖۜۤۘۙۚۧۨۧۙۖۛۛ۟ۨۜۚۤۚ۬ۨۧ۠ۨۘۧۖۖۘۗۛۧ";
                                                        break;
                                                    case 2080833486:
                                                        str22 = "ۘۢۧۧۨۚ۠ۤۜ۠ۧۜۘۙۡ۬۟ۨۧۖ۟ۚۛ۟ۖۜۘۢ۫ۜۨۧ۠۫ۨۖ۟۟ۥۤ۟ۜ۬ۦۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1887576207:
                                            str21 = "ۛ۫ۖۥۘۜ۠ۤۢ۫ۗ۫ۚۘ۬ۥ۟ۙ۬ۙۘ۠ۗۦۗۢۨ۬۫ۥۙۚۖۘۖ۫ۘۘۡۙۦۘۡۥۘۘۡ۠ۙۛۘۦۙۚۦۥۗۜۥۖۖ۬ۦۧۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    str2 = "۫ۘۢۙۖۥۘۘۦۨ۠ۤۤۢۗۡۘۤ۟ۨۙ۫۫ۥۖ۫ۧۨۘۘۗۥۤۡۡۥۖۡۤۘۛ۟ۘۥۚۢۦۘۛۚۤۦۤۙۜۜۦۥۛۜۘ۫ۢۛۜۡۦۘۡ۠ۚ۟ۜۦۘۜ";
                    break;
                case 1474044172:
                    str2 = "۟ۡۘۤۢۜۘ۬ۗۢۚۥۘۦۘۦۘ۠ۙۨۖ۠ۢ۠ۡ۠۟ۙۧۧۨۧۘۖۦۡۘۚۦۨۘۨۙۙۙۦۥۘ۫ۘۖۤ۫ۘۘۚۚۗۢۡۜۚۦۨۙۜ۠ۥ۟ۛۖ۟ۙ۫ۖۡۘۗ۠ۨۧۤ۠ۥۜۤۖۜۘۘ";
                    break;
                case 1512770420:
                    str2 = "ۤۢۖۦ۫۬ۛۢ۠۫ۜۤۙۜ۠ۜۢۜۘۧۘۙۙۘۘۙۤۜۖۗۗۙۧۦۨۖۧۧۧۖ۠ۤ۬ۚۡۡۘۛ۫ۙۤۢۥۘۙۡۨۖ۠ۨۚۡۖۘۜۛۢۦ۬ۤۧۗۘۤۜۤۖۛۡۘۙۤۡۘۦۚۖۘ";
                    break;
                case 1821835864:
                    numM12052 = C0373r3.m1205(clsM1199, "nickname");
                    str2 = "ۙ۫ۙۡۦۜۘۡۛۡۘۗۖۦ۠ۧ۟ۛۙۘۘۡ۫۟ۢۢ۫ۥ۟ۡۘۙ۬ۗۗۚۘۙۜۘۤ۫ۤۢۚۙۤۢۛۢۖۡۙۘۨۥۚ۠ۧۢۖۘ۬ۛۖۤ۬ۥۢۨۗۡۦ۠ۦ۠ۨۖۜۚ۫ۙۗۢۘۖۘ";
                    break;
                case 1878449401:
                    clsM1199 = C0373r3.m1199(str, null, 3);
                    str2 = "ۨ۠ۨۘۛۘۜۘۙۡ۬ۢ۟ۡۥۙۨۦۚۗ۠ۗۡۤۨۘۤۜۘۢۥۦ۠۟۟ۧۖۜۜۡۜۘ۟ۤۘۘۦ۫۟";
                    break;
                case 1922419702:
                    str2 = "ۘۧۗ۬ۤ۬ۡۛۗۙۜۦ۫ۤۚ۬۠۬ۖۥۡ۫۬ۦۘ۫۫ۧۤۤۡۘۤۘۛۢۥۨۛۨۙۢۜۧۘۙۙۛۤۦۢۢۤۤۢۛۖۗۛ۬ۤۛ۟ۙ۬ۦۖۧۜۤۘ۫ۚۢۤ";
                    i4 = i3;
                    break;
                case 1984349311:
                    String str24 = "ۗۘۜ۬ۘۙ۫ۨۛۧۥۥۧۚۚۨ۬ۘۘۘ۠ۥۘۡۜۦۘۙۤ۫۠۟۫۫۫۫ۤ۟ۧۚۨ۠ۥۢۙۢۚۖۘۤ۟ۢ۠ۧۨۨۢۘ";
                    while (true) {
                        switch (str24.hashCode() ^ (-347781844)) {
                            case -1875331302:
                                str2 = "ۦۖۜۘۙۦۖۛۗۖۘۢۡۦۜ۫ۨۦۧ۬ۚۧۗۘۧ۟۬ۦۥۘۤ۫۠۬۠ۧۨۖۨۜۡۘۙۡۘۗۘۧۤۢۖۘ۠ۧۘۘۘۘۗۗۖ۬۫ۜۘۗۦۤ۬ۥۘۥۡۤۛۛۙۥۡۡۘۦۜۦۘۛۢۤ";
                                break;
                            case -904533941:
                                str24 = "ۚ۬ۘۘۖ۟ۡۘۙۖۗۡۖۘۙۘۧۘۘۥۢۗ۫۫۫۟ۘۨۙۘ۬ۦۡۖۘۘۘۡۛۦۛۥۖۘۦۤۤۘۢۘ۫۠ۥۘۖۧ۬ۢ۟۟";
                                break;
                            case -781388073:
                                String str25 = "۟ۡ۟ۤۡۥۧۨۖۘۧۡۛۢۢۡۘ۟۬۟۫ۤۙۗۘۘۘۙۤ۠ۥۖ۠ۤۨۘۘ۟ۘۨۥۚۦۘۚۛۥ۫ۗۚۥۛۙۘۨۦۘۙۗۤ";
                                while (true) {
                                    switch (str25.hashCode() ^ 1647238703) {
                                        case -2015386331:
                                            String str26 = "ۘۖۜۘۧۢۤۛ۠ۨۜۢۛۢۜۥۧ۠ۗۘ۫۟۬ۡۘۤۚۨۨۚۢۨ۬۟ۥۖۤ۟ۡۡۘۗۙۦۢۥۨ۠۠ۤۜۘۛ۫ۚۨۦ۫ۧۜۥۨۘۜۥۨۘۥۚۙۜۦ۟ۖۦۥۘ";
                                            while (true) {
                                                switch (str26.hashCode() ^ 1797639423) {
                                                    case -1187869359:
                                                        str25 = "ۥۧ۫ۥ۫ۢۗۡ۫ۘۨۘۧۖ۫ۧۢۜۚ۠ۜۘۨۢ۟ۖۘۖۘۡۘۨ۫ۚۗ۫۬ۛ۬ۡۙۛ۟ۥۨۥۢۧۨۧۘۥۥۡۘۖۨۘۖ۫ۜۘۜۚ۠۬۟ۖۘۘ۠ۦۡۨۘۘ۬ۤۨۘ";
                                                        break;
                                                    case 90505277:
                                                        str26 = "ۡ۠ۨ۠ۜۤ۠ۘۘۜ۫ۥۡۢ۬۟ۥۙۘۢۗۙۛ۫ۨۦۥۗۦۨۗۚۤۖۗۥۘۦۛ۬ۧ۠ۗۨۙۥۗۥۘ۫ۖۦۙۢۖۘۥۘۗۗۧۤۘ۟ۧۤۗۙۧۢۦۢۤۦ";
                                                        break;
                                                    case 187996986:
                                                        str26 = viewM1159 != null ? "ۡ۠ۨ۫ۤۨۘۘ۠ۧۙۗۥۘۜ۫ۖۘۥۨۗۘۢۚۛۡۖۧۖۘۧۦ۫ۖ۟ۨۘ۬۫ۥۘۢ۬ۡۘ۫ۙۘۘۧ۫۬ۨۨۥۚۡۘۢ۟ۥۘ" : "ۡۦۦۥ۫ۗ۟ۛۘۢۘۘ۟ۥۤۥ۟۫ۛۖۧۧۧۖۦ۟ۗۗ۟۫ۜۢۥۗۥۘۧۘۧ۠۫۫ۛ۠";
                                                        break;
                                                    case 1044909101:
                                                        str25 = "ۘۡۨ۟ۛۦ۠۫ۗۨۘۜ۬ۖۘۦۗۚۛۧۜۛۚ۟۠ۜۧۘۢ۠ۢۖۛ۟ۜۛۥۖۙ۠ۤۖ۠ۦۢۦۘۜۚۜۛ۫۬ۘۚۥۦۢۢۢۢۛۛۨۥۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -1801508122:
                                            str24 = "ۜۢۨۘۨۖۦۘ۬ۥۗۢۙ۫ۙۦۦۤۚۗۥۛۢ۟ۨۖۘۘۙۧۜ۟۫ۡۥۡۘۤ۟ۖۘۢۦۚۜ۠۫ۦ۫ۦۘۡۦۗ۟ۨۦۛۜۘ";
                                            break;
                                        case -798431743:
                                            str24 = "۠ۗۨۘۨۙۚۜۗۥۘۛۘۨۗۚۥۤۢۛۙ۟ۥۘۤۨۡۘۦۚۥ۟ۚۨۘ۟ۢ۟۟ۡ۫ۡۜۧۦ۬ۢۧ۠ۜۜۖۥۘۢۦۥۗۘۡ";
                                            break;
                                        case 389111928:
                                            str25 = "۠ۘۥۘۖ۠ۤۘ۟ۘۘ۬ۘۧۗۦۖۜۜۧۦۛۛۡۦ۠۟ۤ۠۠ۦۜۘ۟۫۠ۘۜۡۘۘ۠۟ۛۙ۠ۗ۫ۜۛۛۜۢۘۢۨۖۘ";
                                            break;
                                    }
                                }
                                break;
                            case 501247276:
                                break;
                        }
                    }
                    break;
                case 2014646224:
                    String str27 = "ۜۖۤۗۛۡۘۡۗۛۤۗۛ۠ۤۨۧۡۡۚۥۧۘۦۤ۬ۘ۬ۘۙ۟ۢۛۤۖۖۗۨۖۨۙۡۢۜۘۚۨ۬ۛۡۡۘۜ۫ۨۖۘۨۘۙۜۡۘۗۤ۠۫ۧۙ";
                    while (true) {
                        switch (str27.hashCode() ^ 493489294) {
                            case -1708603258:
                                str27 = "۬ۦۖۘۤۖۨۘۥۤ۠۠ۥۧۘ۫ۖۥ۠ۧ۬ۤۖۢۗۥۨۘۥۡ۫۫ۨۨۡۤۦۧۤۨۚۛۦۤ۬ۨۦۘۦۡۤۤۢ۫۬ۛۦ";
                                break;
                            case 1288325046:
                                str2 = "ۗۚ۟ۨۡۦۧۚۢۖۙۨۤۜۜۘۨۗۦۗۤۢۧۖۗۨۘۢۘۚۚ۠ۖۘۗۙۥۘۛ۬ۤۖۨۢۢۢۜۘ۠ۚۜۘۡۨۙۡۖ۫ۢ۠ۘۜۗۨۢۢۗۦۦۢۚۘۛۦۗۜ";
                                break;
                            case 1659097127:
                                break;
                            case 1895485713:
                                String str28 = "ۡۧۡۦ۬ۖۘۚۧۦۙۢۚۖ۫ۚۦ۟ۧۢ۠ۥۘۙۡۢۛۘۘۘۛۚۧ۟ۨۖۘۛۧ۫۫ۢۧۗۜۚۦ۫ۧۚۖۡۢۛۚۜۧ";
                                while (true) {
                                    switch (str28.hashCode() ^ (-1893448080)) {
                                        case -1510271186:
                                            str27 = "ۨۢۤۤۨۧۤۙۜۗ۬ۙ۟ۢ۫ۥۨ۠ۨۨۧ۫ۖۘۖۤۘ۠۠ۜۛ۫ۥۥۗۡ۫ۢۘۘۖ۫ۨۘۛۛ۬ۗ۫ۡۧ۫ۢۖۚ";
                                            break;
                                        case -349186371:
                                            str27 = "ۚۚۖۘۗۜۜۖۢۛۥۡۦۘۦۢۨۙۥۘۢۧ۠ۥۗۘۘۛۙۨۘۛ۠ۜۘۤ۠ۛۙۗۘۘۡۗۘۘۘۛۘۨۥۜ";
                                            break;
                                        case 562601806:
                                            str28 = "ۛۖۨۗ۫ۜۘ۟ۘۜۘ۟ۢۡۘۢۘۥۘۗ۠ۚۘۗۢۨۚۥ۬ۧ۠ۜۤ۠ۛ۠ۚۢۤ۬ۤ۟ۥۘۚۖۧۘۥ۟ۚ۬ۤۧۡۘۚۛۤۚۧ۫ۘۜۦ۬ۚۘۖ";
                                            break;
                                        case 774134246:
                                            String str29 = "ۨۨ۠۟۟ۗ۬۟ۥۘ۠ۦۨۘۛۖۘۘ۫ۚۡۘۦۚۨۦۛ۠۬ۜ۫۬۠ۙۗۗۢۖ۟ۦۘۜۗۗۡۢۖۧۨ۟ۧۡۘ۠ۢۖۡۡۙۘۦۧۤ۫ۥۗۚۡۜ۟ۚۘ۬ۖۙۗۚ۫ۡۗۧ۟۬ۛۘۨ";
                                            while (true) {
                                                switch (str29.hashCode() ^ (-1266011460)) {
                                                    case -1549167226:
                                                        str29 = viewFindViewById != null ? "ۖۤۧۧۥ۫ۡۢۘۘۙۧۡۧۚۙ۬۬ۥۨۘۙۨۖ۟ۥۘ۠۠ۚۘ۠ۗۤۨۦۡ۟ۨۗ۬ۚۧۗۚۙ" : "۠۠ۥۗ۬ۦۘۘۚۖۘۦۚۢۚ۫ۦۘۡۥۜۡ۠ۡ۫۬ۢۖۜ۫ۢۧ۬ۧ۬ۦۙۚۜۘۤۧۖۦۥ۟ۤۛ۫۬ۧۜۘ۫ۨۤۢۖۗۦۡۨۘۤ۠ۖۘۢ۬ۨۘۨۥ۬ۢۙ۬ۗۢ۬۬ۙ۫ۜۙۗۙۜۘۘ";
                                                        break;
                                                    case -1330123837:
                                                        str29 = "ۤۥۨۘۥۚۥۗۨۛۗۘۗۚۥۨۘۘۥۢ۬ۤ۬ۚۛ۬ۤۦ۠۫ۙۢۖۗۜۘۖۘۜۤۢۦۜۦۦۘۤ۫ۙۙ۬ۚۙۥۗۢ۬ۡۡۚۦۢۦۥ۬ۨۘۜۧۜۘ۬ۥۡۘۢ۠۫ۢۢۛۨۢۗۥۡۘ";
                                                        break;
                                                    case -270129772:
                                                        str28 = "۠۬۠ۧ۟ۤۨ۬ۨۘۤۘ۬۬ۡ۠ۢ۬ۡۜۗۤ۟ۛ۠۬ۤۢۜۚۢۡۚۧۦۨۦ۫ۧۧ۟۟۫ۢۢۥ۬۟ۖۡۚۙۗۛۖۘ۬۟ۥۘۤ۠ۨۘۘۚۜۚۘۦۘۧ۬۬ۘۙۚۤ۫۫۬ۚۢۗ۫ۧ";
                                                        break;
                                                    case 1734102303:
                                                        str28 = "ۗ۠۠ۧ۫ۥۘ۬ۦۘ۫ۤۖۘۨۧۥۘۦۦۘۛۙۡۚۚۘۘۛۤۜۗۧۤۤۜۥۢ۫ۦۗ۟ۜۘۥۛۖۘ۠ۖۖۘۦۘۙۧ۠ۗۡۚۥۘۡ۟ۦۘۖۡۡۘۨۢ۬ۨۥۧۥ۟ۙۨ۠ۢۛۜۛ۬ۨۤۢۦۤ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    str2 = "ۧۡۚۗۛ۫ۚۡۧۘۚ۬ۙۛۗ۟ۛۡۡ۟ۛۖۖ۠۠ۢۧۢ۠ۨۘۘۤۛۢۜۛۢۙۢۖ۟ۘۛ۠ۨۧۘۨۦۜۘۘ۠ۜۧ۫ۚ";
                    break;
                case 2064406328:
                    viewFindViewById2 = viewM1159.findViewById(i4);
                    str2 = "۠ۤۖۗۢ۟۠ۘۘۚ۟ۙۖۨ۫ۖۙۘۘۨۥ۫ۧ۟ۘۢۥۦۘۗۛۢۘۛ۠ۤۥۗ۬ۙۖۘۥۗۘۧۖۢۢۙۧۨ۫ۦۥ۫ۦۘۤ۟۫ۢ۠۫۫ۘۧۗۢۗۡۦۗۧ۟ۘ۟ۙ۠۫ۖۘۧۘۘۘ";
                    break;
                case 2131275214:
                    str2 = "ۘۧۗ۬ۤ۬ۡۛۗۙۜۦ۫ۤۚ۬۠۬ۖۥۡ۫۬ۦۘ۫۫ۧۤۤۡۘۤۘۛۢۥۨۛۨۙۢۜۧۘۙۙۛۤۦۢۢۤۤۢۛۖۗۛ۬ۤۛ۟ۙ۬ۦۖۧۜۤۘ۫ۚۢۤ";
                    break;
                case 2137090610:
                    viewOnClickListenerC0271ja = new ViewOnClickListenerC0271ja(4, methodHookParam2.args[0]);
                    str2 = "ۗۘۢۚۘۘۚ۠ۛۨۛۜ۠ۜۗۨۜۥۘۖۨ۫ۚۢ۫ۢۢۘۘ۠ۙۧ۠ۖۘ۠۟۟ۖ۫ۨ۟ۧۚۡۛۗۢۙۥۙۖۗۤۖۜۤۨۘۗۧۨۦۨ۬";
                    break;
                case 2142428446:
                    iIntValue2 = numM12052.intValue();
                    str2 = "ۛۖۧۘۜ۟ۤۥ۠ۛۗۚۦۡ۟ۜ۬ۦ۟۫ۗۜۜۤۤۦۙۘۘۦۥۥۘۙۤۚۦ۟ۧۢۜۧۘۦۗ۠ۛۧۡۛۙۨۘۡ۬ۧۡ۟ۗۖۜۡۚۧۙۗۤۤۡۧۘۗۚۖۘۚۚۢ";
                    break;
            }
            return C0433vb.f1163;
        }
    }
}
