package p001;

import android.content.Context;
import android.net.Uri;
import android.os.Bundle;
import android.widget.FrameLayout;
import android.widget.TextView;
import de.robv.android.xposed.XC_MethodHook;

/* JADX INFO: renamed from: ۟.m7 */
/* JADX INFO: loaded from: classes.dex */
public final class C0310m7 extends AbstractC0484za {

    /* JADX INFO: renamed from: ۟.m7$a */
    public static final class a extends AbstractC0335o4 implements InterfaceC0208f3<C0433vb> {

        /* JADX INFO: renamed from: ۥ */
        public final C0310m7 f967;

        public a(C0310m7 c0310m7) {
            this.f967 = c0310m7;
        }

        /* JADX DEBUG: Return type fixed from 'java.lang.Object' to match base method */
        @Override // p001.InterfaceC0208f3
        /* JADX INFO: renamed from: ۥ */
        public final C0433vb mo7() {
            C0310m7 c0310m7 = null;
            String str = null;
            String strM915 = null;
            C0268j7 c0268j7 = null;
            C0310m7 c0310m72 = null;
            String str2 = null;
            String strM9152 = null;
            C0296l7 c0296l7 = null;
            String str3 = "ۡۨۖۛ۫ۙۛۗۘۤ۬ۜۘۙۥ۠ۨۘۤۥ۫ۥۘۗۥۧۥۖۘۚۥۡ۟ۖ۠ۧۛۚۚۨ۟ۘۘۖۛ۠۫ۢۥ۬ۛۧۨۘۗ۠ۨۘۤۧ۬ۗۚۜ۫ۨۘۘ";
            while (true) {
                switch ((((((((str3.hashCode() ^ 589) ^ 58) ^ 519) ^ 503) ^ 956) ^ 62) ^ 414) ^ 859613338) {
                    case -1448415438:
                        return C0433vb.f1163;
                    case -1298756663:
                        C0373r3.m1208(str2, strM9152, new Object[]{Bundle.class}, c0296l7);
                        str3 = "ۡۧۖۥۤۧۘ۬ۡۘۧۘۥۙۛۜۘۗ۟ۛ۠ۨۗۥ۠ۤ۫۟ۥۘۚ۫ۨۙۗۨۧۡۧۛۦۖۘۥۚ۠۠ۘۦۘ";
                        break;
                    case -511972604:
                        C0237h4.m1089("ProfileBannerImagePreviewActivityCls", str2);
                        str3 = "ۚۘ۠ۢ۫ۘۦ۬ۙۜۥۘۘۥۢۨۜۨۘۛ۫ۖۙۨۙۘۛۙۥۤ۠ۦۨۧ۬ۚۨۢۜۚۙۗۢۖۥۤۨۚۚۘۘۚۤۘۘۘ۠۫ۗ۠ۚۘۘۨ۠۬ۦۘۤۗۧۙ۫ۤ۬۟ۦۜۙۦۘۡۦ۠";
                        break;
                    case -402196430:
                        c0310m72.getClass();
                        str3 = "ۗ۬ۨۘۛۙۥۘۡۤۜۧ۫ۘۘۡۥۨۘ۟۟۠ۚۘۜۘۚ۫ۥۦ۫ۚۖۗۦۘۗۙۛۥ۫ۥۖۗۨۘ۫۟۫ۖ۫۟ۙۥۦۘۥۛۧۢۖۡۘ۫ۦۡۧۥۘۦ۬ۨۘ۟ۧۙۘۡۨۥۖۘ";
                        break;
                    case -47717450:
                        c0268j7 = new C0268j7(c0310m7);
                        str3 = "ۥۚۖۘۡ۠ۤۛۜ۬ۧۥ۟ۘۤ۠ۚ۠ۖۘۦ۬ۛۢۚۢۨۖ۬ۘۗۦۘۤۛۡۘۙۜۥۘۨۨۜۨۤۥۧ۫ۡ";
                        break;
                    case -15294191:
                        str3 = "ۡ۫ۥۚ۟ۡ۟ۤۛۦۙۛۙۛۘۘ۟۠ۛۡ۫ۘۛ۠ۛۙۧۜۨۗۜۗ۫ۛۚۡ۬۟ۜۥۖۘۚۚۜۘۨۛۘۨۗۡۘۤۨۥۘۢۖۧۢ۫ۧ۫ۘۦ";
                        break;
                    case 531733751:
                        c0296l7 = new C0296l7(c0310m72);
                        str3 = "ۛۘ۬ۧۖۜۢۘۤۗۖۧۘۜۙۦۘۦۘۙۖۘۘۦ۟ۦۧۦ۠ۦۛۡۘۚۧۜۘۗۚۖۚۥۨۢ۫ۧۗۖۦۚۤۛ۬ۛۢۛۗۨۘ۟ۨۥۘۦ۠ۨۚۛۦۘۜۜ۟ۥۧۦۗۨۛ";
                        break;
                    case 693942635:
                        C0373r3.m1208(str, strM915, new Object[]{Bundle.class}, c0268j7);
                        str3 = "ۨۗۡۘ۫ۥۗۤۧ۫ۧۛۤۥۖۨۘۧۧۚۢۖ۠۫ۗۦۘۥۥۢۤ۠ۦۘۦۛۙ۟۫۫ۗۜۧۘۢ۫ۨۘۛۨۛ۟ۖۛۗۤۡۡ۬ۧۨۥۤۙۜۖۘۛۥ۬ۦۜۢۙۖۜۘۙ۬ۘۘ";
                        break;
                    case 733137039:
                        str2 = C0283k8.f1632.f1548;
                        str3 = "ۚۧۘۛۨۘ۟ۙۘۤۗۚۘۘ۠ۦۛۖۘ۠ۤۡۦۚۥۘۙۨۦۛۢ۠ۘۘۘۘۜ۠ۡۗۤ۠ۦۖۘ۟ۘۡۘ۫ۜۧۘ۬۬ۤۤ۫ۖۘۢۤۧۧ۠ۥۘۖۜۗۡۧۘۘۥ۬ۙ۬ۨ۬";
                        break;
                    case 984155189:
                        C0237h4.m1089("AvatarPreviewActivityV2Cls", str);
                        str3 = "ۗۘۧۨۤۖ۟ۡۥۙ۬۟ۘ۟ۡۜۖۚۦۙۨۘۛۥ۫ۤۗۧۧۜۘۜۛ۠ۤۜۖۖۤۧ۠ۧۜۘۘۚۥۘۨ۠ۗۛۖ۫۬ۥ۠";
                        break;
                    case 1164980841:
                        c0310m7 = this.f967;
                        str3 = "۬ۚۖۘۨ۬ۢۖۖ۬ۖ۠ۚۙۡۖۘۤ۟ۖۘ۠۟ۨۚۘۗۗ۠ۡ۟ۧ۫ۙۙ۠ۚۥۨۢۛۜۜۘۗ۫ۜۘۖ۟ۨۤۚۜۛۡۦ";
                        break;
                    case 1350732219:
                        strM9152 = "onCreate";
                        str3 = "ۗ۠ۥۖۘ۠۫ۜۧۜۡۘۚۗۙ۠ۘ۬۟ۖ۬ۧۗۚۜۙۥۦۦۚۜۚ۬ۧۖۢۨۧ۟ۜۚۖۘۛۜۡۜۘۜۚۚۨۗۨۘۜۖۙۘ۫۬۟ۡۘ۬۠ۙۤۢۜۡ۫ۜۘۖۙۚۙۜۙۧ۬ۥۘ";
                        break;
                    case 1806073101:
                        strM915 = "onCreate";
                        str3 = "ۦۦ۟ۚ۟ۖۦۙۘۘۦ۟ۥ۬ۖۖۘۛۥۡۚۤۢۧۡۜ۟ۤۡۜۜ۟ۡۗۘۘ۠ۧ۬ۢۗۘۘۡۖۘۛ۟ۡۡۨۙۛۡۚۦۦۦ";
                        break;
                    case 1935851163:
                        c0310m72 = this.f967;
                        str3 = "ۨۨۨۨۤۚۧۢۨۘۖۗ۫ۢ۟ۘۘ۠ۦۧۘۥۙۖۥۛۜۘ۫ۢۘ۬ۥۦۘۢۨۨۘۛۙۚۨۖۧۥ۠۟ۛۡۧۘ";
                        break;
                    case 1947417682:
                        str = C0283k8.f1632.f1608;
                        str3 = "ۦۦ۬ۥۚۚۢ۬ۚۦۗۗ۟ۨ۠ۤۚۢۤۨۜۘ۫ۘۖۘۘۚۜۘۥۧۥۘۛۜۚۨ۫ۜۗۗۚۚۗۡۜۚۢ";
                        break;
                    case 2097987418:
                        c0310m7.getClass();
                        str3 = "ۜۗۡۛۙۖۘۗۦۦ۠ۤ۫۠ۜۥۥۜۚۡ۟۟ۦۦۘۜ۫ۨۘۖ۫ۘۤۜۘۘۚۢۙۛۢ۟۬ۜۘۨۤۛ";
                        break;
                }
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟۟, reason: contains not printable characters */
    public static final TextView m1152(C0310m7 c0310m7, Context context, InterfaceC0208f3 interfaceC0208f3) {
        int i = 6;
        String str = "۟ۨ۠ۨۗۥ۬۫ۙۤۙۥۨ۬ۜۢۜۘۧۘۥۤ۫ۘۘ۠ۧۧۖۗۗ۫ۙۤۡۛۥۖ۬ۙۦۥۡۗۥ۠";
        int i2 = 0;
        FrameLayout.LayoutParams layoutParams = null;
        TextView textView = null;
        while (true) {
            switch ((((((((str.hashCode() ^ 34) ^ 966) ^ 366) ^ 469) ^ 117) ^ 987) ^ 698) ^ (-758487970)) {
                case -1240492176:
                    str = "ۗۡ۬ۜۧۤۡۙۡۚۦ۠ۥۘۦۨۘ۫ۧۘۡۨۨۢۥۘۢۗ۟۫۟ۨ۫۬ۜۗۥۥۜۛۦۘۧۘۧۨۙۚۜ۟ۖۢۤۡۥ۬ۤۢۥۧۘۧۖۧۘ";
                    break;
                case -1199560918:
                    textView.setText("下载");
                    str = "ۢۧ۫۫ۛۗۚۛۛۘۚۘ۬ۥۘ۫ۗۜ۟ۖۡۘۡۗۖۧ۟۫ۡۧۛۙۤ۠ۛۨ۬۬ۨۧۡۧۗۤۤۢۗ۠ۖ۫۬ۤ";
                    break;
                case -443798501:
                    layoutParams.gravity = 53;
                    str = "ۢۦۛ۫ۨۖۧۡۘ۬ۙۙۨۛ۫ۧۢ۫ۥ۫ۦۘۦۡۦۥۡۢ۟۟۬ۧ۫ۛۤۤۘۢۜۡۜ۫ۖ۫ۜۘۘۥۙ۟ۢۘۘۛ۟ۦ";
                    break;
                case -140619887:
                    i2 = AbstractAlertDialogC0471ya.f1885;
                    str = "ۖ۫ۥۢ۫ۤۥۖۥۘۦۨۧۘ۫ۖۗۡۙ۫ۚۦ۬ۤۧۨۥۢۨۢۖۧۘ۟ۧ۫ۡۨۥۘۤۦۦۘ۠ۧ۫ۙۨۦۜ۟ۡۛۨۦۜۚ۟";
                    break;
                case -101473140:
                    textView.setTextColor(-1);
                    str = "۫۟ۜۘۥ۠ۡ۬۠ۖۘۢ۟ۛۜۘۥۧۦۜۤۨۙۢۜۘۧ۬ۛۚۢ۟ۧۙۨۘۛۨ۟ۥۛۡۗۢۘ۟ۗۨۘ۠ۧۨۘۚۧۖۦ۠ۡۦ۬۫ۗۙۦۢۘۨۘ";
                    break;
                case 152865149:
                    textView.setLayoutParams(layoutParams);
                    str = "ۢۤۗۥۢۦۢ۫ۘۛۧۗ۫ۦ۟ۜۦۤ۬ۦۢۦۜۡۖ۠ۨۨ۫ۥۧ۠ۢۧۧۧۘ۠ۚۜۘ۠ۛۖۢۘۙۨۙۘۛ";
                    break;
                case 366171229:
                    str = "ۡۥۡۘۤۘ۫ۙۛۗۖۦۜۘۢ۠ۘۦۖۖۘۛۘۜۘ۫۬ۦۘ۠ۢۗ۟ۦ۟ۧۢۙۖۨۘۜۨۥۘۢۚۖۘ۠ۤۧۚۨۛ۠۠ۦ۠ۨۘۖۙۜۘۘ۫۬ۨ۠ۖۜ۟ۚ۟ۖۛۖۙۤ";
                    break;
                case 385486617:
                    str = "ۢ۫ۢۗۨۡۘۨۗۚۧۖۥۖۥ۫ۤۧۧۗۤۜۜۧۡۗۦ۬ۚۢۡۘۖ۟ۚ۬ۡۤ۟ۘۖۦۚ۠ۛۦ۬ۧۦۘۨۨ۠ۖۚۜۘۙۦۙ۬ۦۘۘۢ۟ۘ";
                    break;
                case 526828820:
                    textView.setOnClickListener(new ViewOnClickListenerC0358q1(i, interfaceC0208f3));
                    str = "۫۠ۥۗۨۘۘۢۙۜۘۚۧ۫ۢۡۘۦۜۘۡۢۥۘۧۥۘۦ۬ۢۚ۠ۨۧۜۜۙۥۖۦۖۢۗۖۛۜۤۦ۟ۨۧۘۢۨۨۘۙۤۜۘۤۛۢۜۦۗۤۗۖ۬ۘۧۖ۫ۚ";
                    break;
                case 657296585:
                    return textView;
                case 851557898:
                    layoutParams = new FrameLayout.LayoutParams(-2, -2);
                    str = "۫ۤۦۘۥۚ۠۫۠۟ۗ۟ۢۤۚۗۘۡۘۚۜ۠۬ۘۗۛ۬ۗ۬ۗۘۦۘ۠ۦۘۥۢۛ۠۬ۡۘۛۖ۠ۤ۬ۤۧۨۖۘۡ۬ۦ";
                    break;
                case 1156538961:
                    textView.setPadding(0, i2 * 6, i2 * 2, 0);
                    str = "۬ۙ۠ۢ۠ۥۘ۫ۦ۬ۨۤۖۢۖۡۘۖۚۤۦۤۢ۟ۜۜۡ۫ۨۘ۫ۙۚۡۖۜۘۥۦۥ۟ۖۧۘۡۛۖۘ۬ۢۡۦۜۨۘۙۢۡ۠ۗۤۥۘۗۘ۬ۚۖۘۜۖ۬ۧۖۖۘۚۨۦۘ";
                    break;
                case 1352965143:
                    textView.setTextSize(16.0f);
                    str = "ۚۜۚ۟ۧۢۦ۠۠ۗۤۚۧۤۡۨۛۚۥ۫۫ۧۥۖۘ۫ۗۢ۠ۨۨۘۤۥۖۨۜۦۜ۠ۦۘۤۙۘۘ۟۬ۤ۫ۛ۠۟ۖۨۘۘۧۖۜۡۖۘۖ۫ۜۘۙۦۨ";
                    break;
                case 1495996634:
                    str = "ۚ۫ۥۘ۟ۜۘۘ۫ۗۚۧۚ۠ۤۥۡۘۙۙۨۗۗۘۘ۬ۦۧۡۚۘۛۨ۬ۛۛۡ۟ۜۧ۟۬ۘۘ۟۟ۨۜۜۡۘۛ۬ۥۘۡ۫ۚ۫۬۟۠۟۠ۦۡ۟۬ۗۧۘۛۜ۫ۛ۠۬۬ۦۘۛۤۥ۬ۥۚ۠۟ۧ";
                    textView = new TextView(context);
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟۠, reason: contains not printable characters */
    public static final void m1153(XC_MethodHook.MethodHookParam methodHookParam) {
        String str = "ۛۨۜۡۗۢۚۤۖۘۙۙۧۨۢۥۘۢ۬ۘ۟ۛ۟۬ۙۤۥۗۥۛۗۛۙۧۗۙۦۥۘۦۜۘۗۤ۬ۜ۫ۢۧۚۤ۬ۥۦۘۤ۟ۥۘ۠ۤۡۛ۫۟ۢۥ۠۟۟ۥۘۧۜۡ۬ۡۜ";
        StringBuilder sb = null;
        String queryParameter = null;
        String path = null;
        String host = null;
        Uri uri = null;
        boolean z = false;
        boolean z2 = false;
        String string = null;
        while (true) {
            switch ((((((((str.hashCode() ^ 190) ^ 727) ^ 165) ^ 44) ^ 834) ^ 88) ^ 338) ^ 1375174423) {
                case -1979271561:
                    str = "ۖ۟ۜۘۘۖۖۘۛۙۥۜ۠ۜۙ۬ۤ۬ۨۧۘۦۛۗ۬ۗۚ۠ۛۘۙ۬ۡۡ۫۟۬ۙۛۡ۠ۢ۬ۙۚۛۚۖۛۨ۟ۘۡۘۡۤۥ";
                    uri = Uri.parse(string);
                    break;
                case -1935922957:
                    return;
                case -1907981142:
                    sb.append("?xsec_token=");
                    str = "۫ۤۖۖۨۛ۠۬ۢۙۛۡ۠ۢ۟ۥۘۡۘۘۙۤۥۦۨۘۥۖۥۧۗۢۖۤۗ۬ۢۙ۫۫ۤۢۜۤۙۚۖۡ۬ۚ۠ۖۜۜۘۘۦ۫ۥۘۖۗۥۘ۟ۢۜۘۙۜۥۘ۟۫ۦۘۚۜۨۘ";
                    break;
                case -1702592342:
                    z2 = true;
                    str = "ۜۖۧۨۗۗۦ۫۫ۛۤۛۗۗۡۦۘ۠ۘۦۛ۫ۡۥۘ۟ۤۖۘۗۖۤۚ۟۫۟ۗۦۘۢۡۥۘۜۜۦۘۘۡ۬";
                    break;
                case -1465432739:
                    str = "ۜ۟۬ۢ۠ۘۢ۬ۗ۫ۛۖۥۘۛۦۘۘۗۡۨۤۙۖۘۧ۫۠ۙۛۜۘۖۘۢ۫ۢۖ۫ۖ۬ۗۧۘۗۥۘ۫ۘۡۘۢۥۖ۫ۢۨۘۨۜۗ۫ۡۡۘۧ۫۬ۗۚۘۘ۫۠۬ۗۜۡ";
                    queryParameter = uri.getQueryParameter("xsec_token");
                    break;
                case -1457881786:
                    str = "ۗۗۦۤۖ۠ۘۚ۠۫ۤۦۘۤ۟ۡۡۧۧ۠ۨ۬۫ۜۤ۫ۘ۬ۤۡۘۘۜۧۦۘۥۡ۫۟۟ۥۘۡۦۘۘۨۛۙ";
                    break;
                case -1435787744:
                    str = "ۖۙ۫ۤۧۦۘۡ۫ۧۦۙۦ۬ۘۘۜ۫ۢ۬۫ۥۘ۠ۤۙۚۤ۫۠ۗۢۚۙۥۗۛۗ۬ۡۘۘۨۛۘۘ۠۫ۜۡۧ۟۬۬ۘۛۛۗۗۧۚۥۖۨۨۗ";
                    break;
                case -1430752812:
                    str = "ۢۤۨۙۦۜ۟ۦۜۘۡۛۖۘۗۡۖۙ۠ۗۥۘۡۜۜۢۜۤۥۘۨ۫ۙۗۥ۠۬ۖۥۘۜۗ۟۠ۘۛ۟ۡۡۘ۫۬ۡۨۗۘ۫ۡۘۙ۟ۛۚۜۜۘۘ۫ۛ";
                    string = methodHookParam.getResult().toString();
                    break;
                case -1217900695:
                    sb.append("https://");
                    str = "ۤ۬ۘۦۖۦ۟ۡۨۘۜۡۚ۬ۛۖۘۡۗۦۘۚ۠ۗ۟ۗۧۜۘۘ۫۠ۥۡۛۤۜۧ۟ۨ۫۟ۗۦۚۢۘۖۘۖۘۦۘۘۨۘۘۖۧۙ۬۠ۨ۫۠۟۫ۨ۬ۗۖ۟۟ۡۜۜ۟ۜ";
                    break;
                case -1107277283:
                    String str2 = "ۦۡۜۘۙ۫ۦۘ۠ۛۨۖۡۥۘۨ۫ۜۘۡۘۥ۬ۤۘۘ۫ۘۘۘۧۖ۠ۙۤ۟ۤۜۦۘۙ۟ۡۘۢۦۘ۟ۙ۫ۤۦۤۡۢۥۦۖۜ۫ۛۘ";
                    while (true) {
                        switch (str2.hashCode() ^ (-839933957)) {
                            case 827741698:
                                str = "ۤ۬۬ۘ۠ۙۥ۠ۖۘۖۨۜۡۛۥۘۚۨۛ۟ۖۧۗۤۥۛۖۘۘ۠ۖۡۘۗۛ۫ۧۙۙۦۥۙۘۖ۟۠ۚۡ۟۠ۢۜۤۘۘۥۜۧۜۙۛۙۢۘۘۨۘۙ";
                                continue;
                            case 1000569527:
                                str2 = "ۘۤۦ۠ۗ۬ۙۛۚۘ۠ۖۘ۫ۗۦۖ۬ۨۙۧۖۘۧ۬۬۟ۢۖۡ۫ۜۧ۬ۖۘۚ۫ۦۤۥۜۛ۫ۥۘ۫ۤۦ۟ۦۘۘۖۖۡۚۨۘۛ۠ۡۚۧۗۧۖۥۥۘۥۘۨۥۥۘۗۜۡۘۦۖۖۘۤۨۥۘۙۚ۫";
                                break;
                            case 1965203986:
                                String str3 = "۠ۚۤ۟ۤ۬ۖ۠ۧۗۦۧۜۥ۫ۗ۬ۙۨ۟۬۟۟ۛۘۛ۠ۜ۟ۜۚۦ۬ۨۗۤۗۥۘۥۗۙ۬۫ۡۜۢۜۘ۠۟ۘۤۖۧ";
                                while (true) {
                                    switch (str3.hashCode() ^ 1713818541) {
                                        case -1546040944:
                                            str3 = "ۛۧۜۘۤ۟ۜۘۨۡۢۜۜۦۜ۟ۧۗۙ۟ۦۛۡۘۥۥۖۘۖۢۡۘۥ۟۟ۖ۫ۨۘۚۛۜۢۦۦۘۘۢۤۛۜۧۘۗۡۦۧۖۡ۠ۙۡۚ۟ۖۘۢۖ۠۠ۘۘ۫ۙۤ۫ۦۘۘۢۢ۠";
                                            break;
                                        case -2294913:
                                            String str4 = "۬ۜۚۦۢۛۛۘۡۚۘۧۨ۟۬ۨ۬ۢۥۚۚ۠ۦۖۘ۠ۚۨۘ۟ۡ۬۬ۧۥۘۡ۟ۦۘ۟ۙ۬ۢ۠۟ۛۧۥۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1249641144) {
                                                    case -1609270292:
                                                        str3 = "ۧ۟ۗۙۡۦۘۗۗۛ۠ۙۥ۟ۡۧۘۤۤۢۨ۫ۖۖۢۡۘۚۧۛۦۡۘۢۧۙ۟ۥۗۨۥۖ۬ۧۤۤ۟ۖ۬۬ۛ۟ۡۘۚ۬ۦۧۚۙۦۖۢ۠ۜۜۘ";
                                                        break;
                                                    case -1135959718:
                                                        str4 = string.length() > 0 ? "۫ۗۛۨ۫۫۬۫ۨۚ۟۠۠ۨۢۚۘۘ۠ۜۡۘۧۦ۫ۢۚۗۙۦۦۢۨۢ۟۫ۚۦۧۢۙۨۘۦۘۨۘۗۤۦ۫ۧۡۘۤۧۚ" : "ۗۤۖ۠۫ۗۖۘۘۨۖۡۘۡۤۨۙۗۨۘۘ۬ۛ۟ۦ۬ۥۜۘۚۖۘۤۨۦۖۤۚۜۦۙۢۥۥۜۨۜۧۤ۟ۚۜۜۚۛۜۘ";
                                                        break;
                                                    case -226952132:
                                                        str3 = "۬ۖ۬ۦۥۖۘۚۢۡۡۛۦۘ۟ۨۙۤۚۡۘۙ۫ۗ۟ۗۗۘۖۦۨۜ۬ۙ۬ۗ۠ۖۖۘۥ۠ۜۘ۟ۖۥۘۡ۟ۜۜ۫ۜۘۖۖۜۨ۟۟";
                                                        break;
                                                    case 700632887:
                                                        str4 = "ۦۛ۫ۨۢ۟۟ۨۡۤۧۧۛۦۘۢۧۡۜ۬ۗۜ۠ۨۙۨۡۘۤ۫۬ۚۚۥۘۨ۫ۥۘ۠ۢۨۘ۫ۢۡۘ۠ۗۜ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1394794722:
                                            str2 = "ۨۘ۠ۦۖۧ۠ۜۖۦۤۖۘۖۛۗۗ۟ۦۤۤ۟ۤ۟ۢۢۜۖۗۡۢۤۚۤۢۘۘۚ۠ۜۛۥ۫ۖۛۖۤۚ۬ۡۨۘ۠ۚۛۙۥۘۜۨۜۘۚۨۧ۬ۘۨۦ۬۫ۚۡۥ";
                                            break;
                                        case 1654344560:
                                            str2 = "ۦۥۚ۬ۚ۬ۙۥۚۙ۠ۘ۠ۥۙۨۘ۬ۘۥۦۘ۫۬ۘۘۤ۟ۢۛ۠ۡ۟ۖۧۨ۬ۘۘۜۜۢ۫ۥۘۜۨۜۘۡۡۖۦ۬ۥۧۚۡۡۘ۫ۤۜۡۘ۠ۦۜۘۡۗۦۘۚۦۡۚۜۦۘ";
                                            break;
                                    }
                                }
                                break;
                            case 1993478950:
                                str = "ۤۚۙ۟ۤۦۘۚۧۤ۟۬ۧۡۛۦۨۡۘ۫ۙ۠ۧۧۨۨۦۥۘۧ۫ۖ۠۬ۖۘۚۧۥۨۦۧۘ۬ۚۚۗۡ۠۫ۤۡۨ۫ۥۙۤۧ۬۠ۜۘۦۜۢۚۢ۬ۚ۬ۦۜ۬ۨ۟ۛۥۘ";
                                continue;
                        }
                    }
                    break;
                case 418038478:
                    sb.append(host);
                    str = "ۡۚۘۨۚۚۡۦۢۖۘ۬۫ۖۙۛۜۘۗۥۥۤۘۘۗۡۘ۫ۨ۟ۥۙ۠ۢۢ۠۟ۙۡۥۢۦۘۥۨۜ";
                    break;
                case 706997396:
                    str = "ۛۙ۠۬ۚۛۨ۫ۚ۠ۙۙۗۘ۟ۜۖۨۘ۫۬ۖۘۜۧ۠ۜۖ۟ۗۡۧۛۤ۬۬ۙ۬ۢۧ۬۬ۤ۬ۨ۫ۘۘ";
                    path = uri.getPath();
                    break;
                case 780743357:
                    String str5 = "ۢۥۧۘۚۡۧۨۛۖۘ۫ۦۖۦۖۜۖ۠ۘۘۙۨۦۘۢۜ۫ۜۡۛۡ۫ۨۘ۬ۥ۟ۤۚۦۘۖۦ۬۟ۙۥۡۢۦۜ۠ۜۜ۟ۖۖۡۛۡۡۚۧۙۙۙۧۗ۠ۥۘۛۗ۫ۦۙۡۘ";
                    while (true) {
                        switch (str5.hashCode() ^ 560668707) {
                            case -1043380949:
                                str = "ۙۘۦۥۨۜۘۗۛۡۘۚۢۘۗ۫ۨۛۨۚۡۦ۟۠ۦۘۘۖۢ۬ۦۥۧۘۘۨۨۘۗۥۙۢۢۚۖۜۧ۠ۖۘ";
                                continue;
                            case 256356328:
                                str = "ۢۖ۠۫ۘۖۨ۠۬ۨۦ۬۬ۥۥۜۧۙۥۡۦۘۙ۫ۡۢ۟۠ۘۘۘ۫ۥۘ۬ۙۦۘۗۦۘۘۨۜۡۗۧۥۘ۠ۥۥۘۛۛۛ۬ۗۙۘ۬۬ۚۘۢ۬۠ۖۛۡۨۛۗۦۘۢۦۖۘ";
                                continue;
                            case 2023775346:
                                String str6 = "ۚ۫ۘۘۤ۫ۜۘ۟ۡۧ۟ۖۘۙۜۡۘۡۚۥۘ۟۬۠۫ۖۘۘ۬۠۫ۙ۟ۚۨۛۘۜ۬ۚۦۨۢۧۚۡ۫ۘۘۛۚۤ۬ۚ۟ۦۛۖۘۥۖۡۙۖۛۖۛۤۢۦۘۘۥۦۤۙۗۧ۬۠ۡۙۗۦۘۢۛۛ";
                                while (true) {
                                    switch (str6.hashCode() ^ (-1356409330)) {
                                        case -1052155820:
                                            str5 = "ۤۦۥۛۘۡۗۥۤۧۖۘۗۡۚ۫ۗۜۧۘۘۖۥۘۖۢ۬۠ۚۥۘ۟ۨۥۢۜۨۘۥۛ۫ۥۥ۫۫ۛۥۖ۠ۖۚۚۢۜۥۚ";
                                            break;
                                        case -864404065:
                                            str5 = "ۖۦۚۙۙۦۦۖۗۜۦۘ۟۟ۖۘۨۨ۟۠۬ۗۛۜۛۖۡۡۘ۟ۖۘۘۜۛۨۘۡۖۘۗۧ۠ۛۚۨ۟۟۠ۚۦۘۤۥۦۘۥۘۤ";
                                            break;
                                        case 265353572:
                                            String str7 = "ۥۢ۟ۙ۫۬۟ۛۛۖ۠ۙ۟ۛۡۘۚۖۚۗۧۙ۬۬ۗۚۤ۟ۥ۟ۨۢۚۨ۬ۜۚۙ۬۫ۚۤۤۘۦۡۘ";
                                            while (true) {
                                                switch (str7.hashCode() ^ (-146785487)) {
                                                    case -2046250759:
                                                        str6 = "ۢ۬ۗۨ۠ۨۘۜۛ۫ۧۥۖۘ۬ۨۧۘۘۛۥۖۤۖ۟ۦۛۚۥ۟ۘۢۘۥۙۘۘۘۢۗۚۢۖۘۛۦۡ۠ۢۖ";
                                                        break;
                                                    case -1657038278:
                                                        str7 = z ? "ۨۢۘۚۥۚ۬ۢۨۘۤۥۢۥۤۨۖۛۥۥ۟ۛۙ۬ۚۥۡۘۨۘۡۘۛ۫ۤۢۛۗۤۗۜ۫ۖۘۙۧۢۗۛۥۘۡ۫۟ۘۦ۫ۨۜۥۡۢۢۛۖۡۘ" : "ۥۨۜۜۤۧۜۗۚۨۙۛۦۧۨۘۗۢ۬ۗۡ۠ۜۖۦۘۨۨۥۘۡۚۦۘۤۙۦۚۗۜۘۛۨۤۜۙۢ۠ۚ۠";
                                                        break;
                                                    case 43760250:
                                                        str7 = "ۖۗۥۘۦۥۙۢۧ۠ۡۤ۫۟ۤ۠ۚۡۖۖۖۘ۫ۦۙۨۘۥۨۙۜۘۘۜۖ۬۠ۗۥۡۥۘ۟ۢۧۨۘ۠ۜ۬ۗۜۚۥۘ۬ۦ۠۟ۜۛۚۦۦۙۛۗۥۨ۬ۜ۫ۜۘۦۢ۫ۥۘۥۛ۬ۨۘۙۚۗ";
                                                        break;
                                                    case 1434404926:
                                                        str6 = "۠ۤۢۢۧۜۦۧۦۘۜ۫ۖۙۥۨۘ۫ۧ۫ۖۢۦ۟ۢۜۘ۬۠ۜۘ۫۫ۨۘ۬۠ۗۨۗۤۤ۫ۤۧۢ۟ۗۧ۠ۚۦۤۤۢۖۚۥۜ۫ۘۘۦۖ۫ۖۘۤ۬۠ۡ۬۟ۘۛۚۨ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1820794419:
                                            str6 = "۬ۚۨ۬ۢۨۘۥۢۥۚ۠ۜۙۤۡۘۖۡ۟۠ۨۢۚۙ۬۫ۗۤۚۙۧۛۜۦۦۘۖۦۨۘۛۘۧۢۧۘۘ۟ۘۢ۠ۡۘۘ۠۫ۜ۠ۙۦۘۢۛۗۧۘۥۘ";
                                            break;
                                    }
                                }
                                break;
                            case 2072079684:
                                str5 = "۬ۥۡۢۤۙۚۘۧۘۤۗۨۖۢۢ۟ۢ۫۬۫ۥۗۗۛۢۗۡۘۘ۫ۜۘۧۖۖ۟۟ۤۡۙۜ۬ۤ۫ۨ۫ۘۘ";
                                break;
                        }
                    }
                    break;
                case 879398770:
                    str = "۬ۦ۫ۨ۟ۛۥۡۦ۫ۨۥۘۖۖ۫ۤۙۜۖۤۨۘۘۛۜۘۢ۠ۗ۠ۨ۫ۡۚۨ۠۫ۦۛ۫ۘۘۘۥۨۘۧ۟ۨۘۥ۠ۘۡ۫ۖ۟ۦۢۙۧۢۘۡۘۙۥۦۛۤ۫ۙۤۜۥۚ";
                    z = false;
                    break;
                case 930157332:
                    str = "ۙۖ۬۠۬ۘۥۡ۟ۦۧ۫ۡ۬ۘۜ۠ۜ۠ۥۘۦۦۧۘۚۛۙ۟ۛۦۘۨۡ۬ۖۚۤۚۙۨۘ۟ۛ۟۟ۨۘۜۖۨ۬ۢۤۤ۫ۥۘۤۖ۫ۡۥۙۘۦ۫ۢۢۖ۠ۛۢۙۖۘۘ";
                    z = z2;
                    break;
                case 1008835176:
                    str = "ۘۜۗۗۘ۠۬ۡۖۖ۬ۤۦۗ۬۫ۡ۠۫ۦۢۛۨۥۘۜۤۘۡۜۖۘۘۖۙۥۤۦۘۧۛۥۡۢ۫ۘۤۨۧۦۘۗۦ۟ۨۦۧۥ۠ۡ۠ۙۦۧۘۙ۬ۡۛۗۤۛ۬ۧۡۘۡۧۜۧۚۘۘۥۖۗ";
                    host = uri.getHost();
                    break;
                case 1021525800:
                    sb.append(path);
                    str = "۫ۗ۠۠ۧ۟ۖ۠ۘۦۥۖۘۥۘۘۦ۬ۖ۫ۗۘۦۢۗۘۡۥۥۚ۫ۖۖۨۘ۬ۙۦۘۢۥ۫ۢۘۥ۬ۛۛۡۚ۬ۘۖ۠ۜۧ۟ۙۨ۬ۢ۫ۧۦۥۧۜۡۖ۫ۚۖۘۦ۠ۘ";
                    break;
                case 1290017568:
                    sb = new StringBuilder();
                    str = "۟ۥۡۨۛ۫ۨۘۖۘۘۤۘۦۥۖۘۙۗۥۘۨۡۡۧۚۙۗۧ۠ۡ۠ۨۜۦۨ۬ۖۘۜۡۘ۬ۡۥۘۖۤۗۨۜۡۘۦۧۧۥۗۗۛۡۦۥۗۨۘۧۗۚ";
                    break;
                case 1565204355:
                    str = "۬ۦ۫ۨ۟ۛۥۡۦ۫ۨۥۘۖۖ۫ۤۙۜۖۤۨۘۘۛۜۘۢ۠ۗ۠ۨ۫ۡۚۨ۠۫ۦۛ۫ۘۘۘۥۨۘۧ۟ۨۘۥ۠ۘۡ۫ۖ۟ۦۢۙۧۢۘۡۘۙۥۦۛۤ۫ۙۤۜۥۚ";
                    break;
                case 1600778147:
                    methodHookParam.setResult(sb.toString());
                    str = "ۢۖ۠۫ۘۖۨ۠۬ۨۦ۬۬ۥۥۜۧۙۥۡۦۘۙ۫ۡۢ۟۠ۘۘۘ۫ۥۘ۬ۙۦۘۗۦۘۘۨۜۡۗۧۥۘ۠ۥۥۘۛۛۛ۬ۗۙۘ۬۬ۚۘۢ۬۠ۖۛۡۨۛۗۦۘۢۦۖۘ";
                    break;
                case 1950197566:
                    sb.append(queryParameter);
                    str = "ۢۘۗۛۙ۫۠ۨۜۜۖۥۘۙ۠ۡۙۨۦۘۦۦۗۗ۟ۦۗۦۚ۬ۡۡۦۘۤۚۜۘۥۖۘۘۙۢۥۘۖۚ۟";
                    break;
            }
        }
    }

    @Override // p001.InterfaceC0139a4
    /* JADX INFO: renamed from: ۥ */
    public final void mo802(String str) {
        String str2 = "ۘ۫۫ۢۦۨۘۨ۬ۢۥۨۗۢۜۘ۟ۦۨۚۧۡۨۥۚۡ۬ۦۘ۠ۨ۠۬۠ۜۖۨۛۦۦۘۛ۫ۙۨۖۦۘۚۚۡۘۛۨۨۚ۫ۦۘۖۢ۠ۖۦۨۘۤۙۡۘۨۦۦۥ۫ۖۜۛۧ";
        C0324n7 c0324n7 = null;
        String strM915 = null;
        String strM9152 = null;
        while (true) {
            switch ((((((((str2.hashCode() ^ 817) ^ 884) ^ 490) ^ 819) ^ 379) ^ 267) ^ 450) ^ 2106105037) {
                case -2037636434:
                    str2 = "ۖ۫۠ۦۤۗۢ۠ۡۤۛۢۚۥۨۥ۬ۗ۠ۧ۟ۧۚۖۘ۫ۨ۬ۨ۟ۘۘ۫۟۫ۢۛۡ۟ۘۘۗۨ۫ۗۧۛ";
                    strM915 = "getPageUrl";
                    break;
                case -1973756368:
                    return;
                case -1514868386:
                    c0324n7 = C0324n7.f993;
                    str2 = "ۨۖۜۢۥۢ۫ۖۢۗۗ۠ۦۗ۫ۨۨۘۙ۠ۡۘۢۡۖۘ۬ۧۧۛۙۘۘ۠ۢۙۛۦۘۖ۬ۜۘۚ۠ۛ۟ۖۛۨۜۨۘۖۙۡ۟ۧۤ";
                    break;
                case -1441712833:
                    str2 = "ۘ۟ۖۘ۬۬ۖۡۖۛۛ۬ۥۛ۫ۘۘۤ۬ۨۘۛۜۥۘۙۦۧۘۤۜۜۘۗۜۧۢ۫ۦۜۘۡۘۡۖۤ۫ۤۡۜۘۡۧۘۙۘۚۚۖۥۥۗۢۖۘۤ۟ۙ۟۬ۥۜۨ۬ۧۙۨۙۘ";
                    strM9152 = "com.xingin.entities.share.ShareEntity";
                    break;
                case -1375051921:
                    C0373r3.m1208(strM9152, strM915, new Object[0], c0324n7);
                    str2 = "۬۠ۖۤۘ۬ۤۥۘۥۡۘ۠ۛ۫۟۠ۖۘ۬ۙۢۖ۫ۘۡۦۡۤۡۡۘۙ۟ۨۘۙ۫ۖۘۢۜۦۜۡۧۦۨۜۘۤۨ۬ۘۙۜۘ۠ۛ۫";
                    break;
                case -938885388:
                    str2 = "ۡۙۡۘۡۖۡۢ۠ۜۘۢۦۜۘۖ۟ۨۥ۬۟ۛۗۧۢ۟ۨۘۛۦ۟ۤۖ۫ۥۖۧۗۥۧۘۥۤ۫ۢ۫ۜ۠ۙۚۚۨۖ۟ۛ۫۫ۡۥ۫ۚ۟۬ۦ۟ۧۦۘۘ۫ۜۚۗۜۡۘۘۗ۬ۤۢ۟ۢۜ۟ۦۛۥ";
                    break;
                case -522404017:
                    C0192e1.m1054(EnumC0164c1.f1377, new a(this));
                    str2 = "ۢۙ۠ۦ۟۫ۧۨ۟ۢۨۦۘۦۙۘۗۡۗ۠ۖۚۘۛۘۜۖۡۘۚۙۡۘ۠۟ۖۛۘۨۘۚۜ۟ۤۢۧ۬۠ۜۤۨۘۘۢ۟۠ۙۧ۟۬ۡۜۜۜۨۘۛۗۘۘ";
                    break;
                case -334637045:
                    str2 = "ۡۢۘۘۡۘ۬ۥ۟ۨ۠۠ۘۘۥۤۖۘۦۢ۠ۘۥۘ۠ۙۘۘۚۦۜ۬ۘۧۡۙۘۧ۠ۖۘۢۡۘۘۧ۟ۜۤ۟ۦۘۗۨ۠۟ۗۙۡۡۧۦ۫ۙۥۚۡۘ۬ۖۨۤۘۦۘۗۖۥۘۢۤۖۙ۠ۦۘۗۦۜ۠ۖۛ";
                    break;
                case 1556951769:
                    C0237h4.m1090("processName", str);
                    str2 = "ۙۗۦۧۘ۠۟ۡۨۘۗۤۨۘۨ۫ۘۗۡۦۙۧۘۘۜۡ۠ۤۡۡ۫ۥ۫ۤۘۨۘ۫ۛۡۤ۟ۗ۠ۘۦۘۙ۫ۢ۟ۚۖۘ۬ۡۧۢۛ۠";
                    break;
            }
        }
    }
}
