package p001;

import android.content.ContentResolver;
import android.content.Context;
import android.content.UriMatcher;
import android.net.Uri;
import android.provider.ContactsContract;
import java.io.FileNotFoundException;
import java.io.InputStream;
import p001.AbstractC0469y8;
import p001.C0481z7;

/* JADX INFO: renamed from: ۟.q0 */
/* JADX INFO: loaded from: classes.dex */
public final class C0357q0 extends AbstractC0469y8 {

    /* JADX INFO: renamed from: ۥ۟ */
    public static final UriMatcher f1035;

    /* JADX INFO: renamed from: ۥ */
    public final Context f1036;

    static {
        UriMatcher uriMatcher = null;
        String str = "۠ۤۦۤ۟ۚۙۘۘۙۦۨۦۚۥۘۙۚۛۙۛۘ۟۬ۖۘۚۜۧۧ۬ۜۘۨۧۡۘۧۖ۟۠ۖۚۨۖۧ۬ۡۙۖۢۨۘۗۢۗۤۦۡۤۡۛ۟ۖۡۘۖۘ۟۟ۢۗ۠ۤۦۘۖ۬۬";
        while (true) {
            switch ((((((((str.hashCode() ^ 693) ^ 904) ^ 380) ^ 576) ^ 535) ^ 732) ^ 180) ^ 1128919864) {
                case -2071389206:
                    f1035 = uriMatcher;
                    str = "ۖۤۚ۟ۡۗ۟۫۬ۦۛۙ۬۬ۡۖ۬ۤۥۖۖۘۧ۫ۥۘ۫ۖۘۘۦ۠ۧۥ۫ۖۖۖۘۘۥۨۧۘۧۦۤۤۡۧۗۜۘ۫۫ۡۘۘۜۡۘۖ۠ۢۙۡۘۥۥۜۘ۠ۨۥۦۛۘۘۢۙۥ";
                    break;
                case -1732607236:
                    uriMatcher.addURI("com.android.contacts", "display_photo/#", 4);
                    str = "۬ۡۧۦ۠۫ۤۤۛ۬ۡ۠ۖۘۗۦۚۘ۟۟ۖۘۤۛۦۘۡۛۜ۠ۢ۫ۨ۠ۡۦۨۦۘۙۤۦۛۚۘۘۨ۫ۙ";
                    break;
                case -1690888534:
                    uriMatcher.addURI("com.android.contacts", "contacts/#/photo", 2);
                    str = "۬ۗۜۢۨۜۘۖۥ۫۟ۡۖۘۡۚۦۘۡۜۖۘۡ۠ۥۨۧ۟۫ۡۜۛ۬ۗۖۢۦۘۨۙ۫ۜۧ۠ۗۛ۟ۙۖۖۜۘۦۘۙۡۦ۠۫ۧۚۛۦۡۘ۟۟ۨۛۗۚ۫ۢۦ۬۫ۨۘۤۡۛۢۛۘۘۗۡۦۘ";
                    break;
                case -501658416:
                    uriMatcher = new UriMatcher(-1);
                    str = "ۤۘۥ۠ۚۘ۬ۢۘۛۙۦۦۦ۠ۧۧ۟ۨۘۖۢۥۢۥۦۥۘۘۡۢ۫ۦۚ۟ۨۙۧ۟۬ۛ۬۫ۨۧۖۘۢۦۖۤۡۜۘۨۤ۟۫ۜۧ";
                    break;
                case -131834733:
                    uriMatcher.addURI("com.android.contacts", "contacts/#", 3);
                    str = "ۛۧۖۘۦ۫۟ۡۗ۬ۥ۬ۖۘۤۘ۟ۘۧۘۜۥۧۧ۬ۜۘۚۙۧۘۡ۬۬ۦۘۘۘۢۘۗۘۨۘۨۢۦۢۡۜۛۚۢۚۡۢۥۖۖ۬ۜۡۗۤۙۘۤۢۙۥ۟۬ۤۥۘ۬ۖۘۤۗۨۘۢ۫ۢۨۢ۟";
                    break;
                case 1355376332:
                    uriMatcher.addURI("com.android.contacts", "contacts/lookup/*/#", 1);
                    str = "ۜۧۜۘۗۚۦۢۙ۬ۛۜۡ۫ۡۢۤۛۙۤۡۧۙ۟۬ۨۢ۠ۡۘ۟ۜۚۜۛۢۗۧۘ۬ۦۧۘۙۡۨۘ";
                    break;
                case 1359068239:
                    return;
                case 1570110919:
                    uriMatcher.addURI("com.android.contacts", "contacts/lookup/*", 1);
                    str = "۫ۡۖۘۦ۬ۡۘۥۛۢۧ۠ۚۥۦۗۦۗۗۙ۠ۗۜۖ۟ۤۜ۬۠ۢۗ۬۠ۧۢ۫ۥۥۘۤۥۘۙۢۖۚۡ۬ۖ۫۟ۘ۟ۚۡۤۜ۠۫۠ۖۚ";
                    break;
            }
        }
    }

    public C0357q0(Context context) {
        this.f1036 = context;
    }

    @Override // p001.AbstractC0469y8
    /* JADX INFO: renamed from: ۥ۟ */
    public final boolean mo831(C0443w8 c0443w8) {
        Uri uri = null;
        String str = "ۚۥ۠ۛۖۤ۟ۘ۠ۥۧۚ۠۬۠ۖ۠ۨ۠ۗۤۢ۬ۜۛۡۤۛ۠ۛۘ۬ۨۘۢۙۡۨۜۥۘۘۖ۬ۡۜۘ";
        boolean z = false;
        boolean z2 = false;
        while (true) {
            switch ((((((((str.hashCode() ^ 783) ^ 285) ^ 918) ^ 367) ^ 107) ^ 461) ^ 168) ^ 215156477) {
                case -1854718168:
                    uri = c0443w8.f1842;
                    str = "ۗ۠ۥ۟ۙۤۤ۬ۛ۬۠ۖۖۧۜ۠ۡۘۡۨۦۘۙۚۨۘۖۜۜۘۙۗۥۘۥۖۥۦۡۜۘۦۜۨۘۨۗ۬ۦۥۨ";
                    continue;
                case -1490814039:
                    str = "۫ۘ۟ۧۤ۫ۙۧۚۜۖۦۘ۟ۦۢ۠ۤۖۡۢۢۥۘ۠ۦ۟ۥۗ۠۬۠ۘۥۙۡۘ۬ۨۖۘ۟ۢۖۙ۟ۖۘۖۨۦۘۖۥۥۢۖۗۖۜۨۘۙۜۡۜۗۨ۫ۧ۫ۚ۠ۜۙۗۛ";
                    z = false;
                    continue;
                case -808173144:
                    str = "ۥ۠۬ۖ۟۫ۧۧۥۜۗۢۘۖۜۘۙۧۙۤ۟۠۠۟ۛۧۙۖۙۖ۫ۥۘۙ۟ۖۨ۟ۨۘۨۚۘۙۥۖۘۛۦۘۘ۬۬ۗ۬ۨۥۙۥۤ۟ۡۢۤۦۢ";
                    continue;
                case -799552459:
                    String str2 = "ۤ۫ۜۘۛ۟ۧۤۙۙۙۘۜۜۥۘۧ۫ۘۘۜۥۛۙۖۜۧۜۘۚ۠ۖۘۚۦۥۘ۬ۙۜۢۡۖۖۜ۟ۙۦۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 57759767) {
                            case -1964870597:
                                str2 = "ۙۡ۬ۛۖ۫ۦۢۙۧۢۜۦ۫ۤۗۡۤۥۙۛۡۨۖۘ۠ۨۘ۟ۗۖۘ۬ۗۥۘۗۘۘۘۗۖۜۜۘۧۗۘۤۖۗۚ۬ۤۦۘۥۜۘۢ۫۬ۢۘۛۘ۠ۛۥۜۜۘ۫ۗۨ۫ۘ";
                                break;
                            case -714315389:
                                str = "ۢۢۥۖۖۦۘ۫۠ۢۖ۟ۜۙ۫۠ۖۥۤ۟ۥۥ۟ۦۡۘۚۧۖۢۥۙۧۥۚۜۗۘۘ۠ۙۜۘ۟ۧ۬ۧۙۦۘۢۚۦۙۚۘۖۧۡ";
                                break;
                            case 70972426:
                                String str3 = "ۡ۫۫ۜ۬۫ۚۚۘۦۜۧۘۖ۠ۢۨۜۘ۟ۙۘۘ۟ۨۛۗۛۦۘ۬ۤۖۘ۠ۡۜ۫ۜۛ۫۫ۖۘۜۧۗۨۘۘۙ۫ۛ۠ۡۦۡۖۦۛۧ۬۠۠ۡۘۜۢۥۦۚۨۘۥۦۡۖۖۡۘۙۢۨۘۤ۠ۗ۠۫ۡۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-930084460)) {
                                        case 395658932:
                                            str2 = "۠ۜۚۥ۫۠ۨۘ۬ۨ۠۠ۧۜۚۥۧۨۢۘۘ۬ۢۚۜ۠ۡۘۙۨۘۖۛ۠ۗۤۢۡ۟ۢۚۘۘۘۗ۠ۨ۠۟ۡۘۢۖ۟۟۠۫۫ۜۚۥۛۛۦۖۨۘۧۧۖۘ۫ۙۘ۟ۡ۫";
                                            break;
                                        case 912288628:
                                            str2 = "ۚۨ۟ۗ۫ۘۘۤۖۘ۫۟۠ۡۖۛ۟ۨۥۤۥ۬۟ۘۛ۟ۨۧۢۘ۬۫۬ۙۡۙۙۙۦۤۚۘۚۖۦۡۘۖ۫ۨۘ۬ۛ۬۬ۖۦۘۚۛۘۛ۟ۖۡۖۖ";
                                            break;
                                        case 1449523162:
                                            str3 = "۬۬ۤۨۗۤۜۥۜۘۚۥۙ۬۬ۖۘۗ۫ۨۘۧۦۜۘۗۦۨۢ۫ۨۚۖۧۘۦۥ۟ۢۦ۫ۨۥۧۘۗۗۨۘۚۛ۠ۧۜۘۧۛۘۜ۬۫ۢۢۡۘۖۘۥۘۡۖۡۡۥۗۙۢۙۡۨۘ";
                                            break;
                                        case 1963967326:
                                            String str4 = "۟ۤۥ۟ۘۙ۠ۘۦۘ۠ۦۡۘۖ۬ۘۥۥۤ۫۫ۦۤۗ۫۠ۨۘۚۧ۬ۤۧۘۘۥۛۖۘۨ۠ۡۚ۟ۢۙۛۜۛ۟ۥۘۗۖۦۘۦۖۖۤۢۡۖۦۦ۬ۖۖۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1870129314)) {
                                                    case -1854490365:
                                                        str3 = "۠ۢۖۘۙۛۡۘۚۨۡۘ۫۫ۡۜۦ۟ۛۡۧۘ۟ۢۦۘ۫ۖۜۘۚۗۥۘۚۚۘۜۘۖۘ۠۠ۖۘۙۜۨۗۘ۬۫ۘۜۘۦۚۨۖۛ۬ۧۤۡۘۚۢۢۚۘۗۡۛۜۨۢۥۘۗۖۘۘۤۢۘ";
                                                        break;
                                                    case -1576107038:
                                                        str4 = f1035.match(c0443w8.f1842) != -1 ? "۠۫۠ۖۡۖۖۛۥۖۡۡۗۖۦۧ۬ۚ۠۬ۨۤۧ۠ۤ۠ۡ۬ۨۜۘۛۧۛۥ۫ۛۙ۠ۖۘۜۥۘ۬۠ۧۤۧۙۧۧۢۢۘۦۘۦ۠ۨۘۘۤ۫ۡۢۨۨۘۧۘۢۗۢۗۘۨۘ" : "۫۬ۨۘۨۙۧۛۙۧۨۜۡۘۛۡۜۧ۟ۥۘ۫ۥۥۦۙۘۗۜۨۘۗۖۛۖۡۤۧۖۥۛۙۨ۫ۧۘ۬ۡۜ";
                                                        break;
                                                    case -1367483652:
                                                        str4 = "ۘۥۡۡۛ۟ۡۖۙۙۤۜۘۗۙۘۙ۫ۡ۬ۡۘۘۚ۟ۖ۫ۖۦۘۧۚۨۖۥۥۤ۟ۜۘ۠ۘۖۘۘ۫ۖۘۤۡ۠ۦۚۦۘ۠ۘۘۘۢ۬ۖۘۡۥ۟ۗۘۤ۠ۗۧ";
                                                        break;
                                                    case 2088448598:
                                                        str3 = "ۨۙۥۘۦ۠ۛۚۚۥۘ۬ۥۢۙۨۜۘ۫۬ۖۘ۬ۚۦۦۗۖۥ۠ۗ۫۟ۗ۟ۦۡۥۨۜۘۨۥۨۘۡۖۘۘۦ۬ۧۦۗۗۜ۟ۜۘۨۘۙۧۥۙ۟ۚۚ۟ۤۨۘ۟ۘۜۘۜۗۥۥۥۡۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 1773739296:
                                break;
                        }
                    }
                    break;
                case -677122051:
                    z2 = true;
                    str = "۠ۙۖۨۡۗۡۤۡۘۙۛۢۙ۠ۦۨۚۡۦۢۛۙۨۛۛۤ۬ۚۗۛۛۧۨۜۗۥۘ۫ۚۛۥ۬ۥ۟ۛۛۗۛۥۘ۫ۤۦۘۗ۫ۥ۬۬ۗۦۖۘۘۢۡۥۘ۫ۖۖۢ۟ۦۘۜ۫ۥۘ";
                    continue;
                case -244507602:
                    str = "۫ۘ۟ۧۤ۫ۙۧۚۜۖۦۘ۟ۦۢ۠ۤۖۡۢۢۥۘ۠ۦ۟ۥۗ۠۬۠ۘۥۙۡۘ۬ۨۖۘ۟ۢۖۙ۟ۖۘۖۨۦۘۖۥۥۢۖۗۖۜۨۘۙۜۡۜۗۨ۫ۧ۫ۚ۠ۜۙۗۛ";
                    continue;
                case -240620284:
                    return z;
                case -27095254:
                    str = "ۘۨۦۜۚۥۘۡ۫ۦۘ۟۠۟ۤۖ۟ۡۤۨۡ۟ۥۙۨۘۘۡۦۦۘۦۜۖ۠ۦ۫ۛۖۚ۟ۥۛۘۘۦۦۦ۫۠ۖۤۙۥۘۗۦۙۜۖۤۛۛۦۘ۠ۧۧ";
                    z = z2;
                    continue;
                case 714756687:
                    str = "ۢ۬ۛۚۗۦۘ۟۠ۦۢۡۧۖۖ۬۟ۦۤۢۡ۬ۥۧ۫ۖ۬ۛ۟ۜ۟ۦۢۜۘۧۥ۟۠ۧۦۗۡۘۜۗۗ";
                    continue;
                case 937298069:
                    String str5 = "ۧۤۤۚۥۚۨۡۘۚۜۜۘۧۢۨۘۖۦۦۤۨۦۘۤۤ۬ۥۥۜۘ۫ۡۨۡ۬ۜۘۙ۟۫ۨۘ۬ۦۡ۬ۡۤۡۘۥۖۦۘ۟ۛۦۥۜۦ";
                    while (true) {
                        switch (str5.hashCode() ^ (-2021595480)) {
                            case -1387543283:
                                str = "ۤ۫ۨۗۖۖۘۙۧۛۚ۟ۥۘ۬ۦۗۤ۫ۡۘ۫ۨۨۦۢۥۘۗۧ۟۬ۨۖۘۥۦۦۘۧۙۡۘۘۧۢۖۚ۟ۦ۫ۡ";
                                break;
                            case -1279084137:
                                String str6 = "ۗۛۧۚۥۘۧۤۜۘۡۘۘۛ۬ۡۘۖۤۙ۟ۡۗۤۘۜۘۚۡۗۦۗۜۧۧۨۘۥۨۧۘۘۖۨۦۦۥۘۛۗ۫ۧ۫ۢۖ۟ۜ۬۠ۙ";
                                while (true) {
                                    switch (str6.hashCode() ^ (-1692593282)) {
                                        case -1249706882:
                                            str5 = "ۤۘ۠ۗۨۡ۟ۗۥ۬ۡۦۘۜۜۥۘۙۨۦۗۜۨۗ۠۫ۧۢۖۘۜۙۘۘۘ۬ۛۙۦۡۘۧۚ۬ۜۚۤۚۛۤۦۤۙۘۡۘۘۜۛ۠ۤ۬ۡۘ۫ۖۛۛۚۜۘ";
                                            break;
                                        case 165058945:
                                            String str7 = "ۛۦۜۙ۠ۤ۫ۜۘ۠ۜۦ۬۟ۗ۠۠ۤۙۖۜ۬ۚۗۙۧۖۘۢ۬ۗۚۘۛۥۖۛۨۡۤ۫ۦۨۡۥۦۘ۬ۦۥۢۛۥۢۡۙ";
                                            while (true) {
                                                switch (str7.hashCode() ^ 1681437431) {
                                                    case -1957603272:
                                                        str6 = "ۥۨۜۘۧ۬ۘ۫ۦۢۥۖۖۡۘ۠ۚۜۦ۟ۜۛۡۡۘۘۜۜۘۜۙۖۘۦۗۤۡ۠ۜۥۨۘ۫۬ۘۘۥۧۨۘ۟ۨۨۘ۟ۖۜ۟۫ۜۖ۫۫۫ۜۨۘۦۢۥۘ";
                                                        break;
                                                    case -1235708826:
                                                        str7 = "ۛ۫ۘۘۨ۬۫ۡۨۜۘ۠ۖۖۜۥۤ۠۬ۤ۫ۚ۬ۨۜۜۘۥۦۧۢۢۨۘۤۡۘۧۨۦۘ۟ۢۘۤۤۘۘۗۙۤ";
                                                        break;
                                                    case 458336289:
                                                        str6 = "ۖۧۥۘ۠۟ۢۦۤ۬ۨۗۖۚۖ۟ۧۙۡۢۙۘۘۢ۠۬ۢ۬ۖۘۧۗۦۥۡ۠۠۫ۢ۬۬۠۟ۚۡ۬ۢۢۗۜۖۘ۟۫ۨ۟ۢۘۘۦۥۘۨۤۗۘۨ۫ۦۜۖۖۢ۫ۘ۟";
                                                        break;
                                                    case 1953056487:
                                                        str7 = ContactsContract.Contacts.CONTENT_URI.getHost().equals(uri.getHost()) ? "۠ۜ۬۬ۛۢۖۤۜۙۤۧۜ۬ۛۜ۠۟ۤ۟۫ۡۤۛۡۦۡ۬ۨۜۘۘ۠ۗۖۚۨۘ۠۬ۥۥۥۗۨ۠ۘۘ۠۠ۚۤۢۖۡۚۡۘۙۡۦۘ۬ۢۧۦ۠ۦۘۤۙ۠۬ۜۘۘۥ" : "ۥۜۦۘۤۜۢۡ۬ۧۦۧ۫ۙۧۢۙۥۥۘۛۗۚۙ۟ۜۘۙۚۧۢۨۗۜۜۜۥۖۤۧۜۨۜۗۧ۟۟ۛ۬ۥ۬ۗۙۡ۠ۨۘۘۤ۟ۦۢ۠ۘۗۚۙ۟ۤۖۘۖۙۦۘۧۖۤۤۤۙ۟ۢۨۘۡۙۜۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 558734836:
                                            str6 = "ۤۚۜۘۛۡۜۘ۬ۚۥۥۥ۬۬ۡ۬ۗ۫ۧۗۘۤۗۗ۬ۛۨۜۘۢۡۦۘۜۜۦۧۦۦۛۙ۠ۘۦۧ۬ۧۙۢ۠۫۟ۜۦۗۚ۟۫ۦۦۘۜۗۖ۟۠ۥۘ";
                                            break;
                                        case 674642909:
                                            str5 = "ۖۨۥۘۙ۟ۦۘۜۨۧۘ۬ۚۖ۬ۗۢۡۢۖۜۘۖۘ۬ۡۦۘ۬ۦۨۘۨۥۥۖ۠ۡۘۡۖۡۖ۬ۧۜۙۘۘۤۧۦۖۙۡۛ۬ۧۙ۠ۜ";
                                            break;
                                    }
                                }
                                break;
                            case 800351266:
                                break;
                            case 1263565247:
                                str5 = "ۥۘۗۛۜۘۘۚ۟ۥ۬ۘۗۘۧۢۗۤۘۚۡۥۘۨۦۡۜۖ۠ۗۥۦۘۗۖۤ۟ۚۦۘۧۡۤۨۘۘۘۘۥ۬ۚۦۡۤۤۥۚ۬ۤۘۤ۠ۢۧۘۢۡ۫ۨۨۖۘۤۗۖۘۨۦۨۘۨۧۦۘۚۦۤۙۥۖ";
                                break;
                        }
                    }
                    break;
                case 1672378132:
                    str = "ۘۥۜۘۧۦۤۨۖۨۢ۠۠ۡۜۛۨ۬ۡۡ۟۬ۤۦ۬ۖۥۗۖۢۢۗۧ۬۫ۡۡ۟ۦۨۦۘۜۛۥ۬ۛۨۜۚۜ۟ۢۡۚۧۥۢۥۛۜ۠";
                    continue;
                case 1853251119:
                    String str8 = "ۥۦۨۤۥۡۘۧ۫۬ۥۢۨۘۤۖ۬ۥۤۡۘۚۢۖۥۜۛۤۖۡۘۘۙۤۥۘۖۦۘۘۥ۟ۘۘۢۖ۬ۧۨۘۨۤۜۘ۟۟ۢۡۗۡۨۧ۬ۖۦۘۤۚ۟ۜۡۜۨۗۖۘ۟ۧۨ";
                    while (true) {
                        switch (str8.hashCode() ^ (-486577228)) {
                            case -1645541498:
                                break;
                            case -124486462:
                                str8 = "ۡۧ۬ۛۥۤۜۗۥۘۚۨۘۢۥۧۘۜ۠ۙۜۥۧۛۙ۬ۘ۬۬ۚۘۨۘۗۘۘۘۥۦۛۥۡۙۦۛۜۘۛۧ۟";
                                break;
                            case 724239637:
                                str = "۟ۧۛۤۨۡۘ۠ۡ۫ۨۚۨۨۖۦۘ۠ۘۙۤۖ۟۬ۗۘ۫ۡۜۘۜۥۡۘۡۜۜۘۗۡۖۨۛۖۘۢ۫۫ۥۧ۟ۙۛ۠ۢۛۦۛ۫ۙۘۘۙ۫ۖۖۘۗ۠ۙ۫ۦۖۗۘۨۘ۠ۡ۟ۡۗۢۙۦۧۨۦۡۘ";
                                break;
                            case 1785396107:
                                String str9 = "ۗۧۧۛ۫ۤۘۡۗۨۨۦ۟ۧۢۖۜ۟ۙۥۥۘۘۨۤۛ۫ۖ۟ۜ۫ۥۤۥۘۡۧۡۘۚۥۗۤۖۥۘۢۢۦۘۦ۟ۦۘۧۨۨۘۤۚۡۘ";
                                while (true) {
                                    switch (str9.hashCode() ^ (-1771687438)) {
                                        case -417127889:
                                            str8 = "ۙ۬ۙۦۗۦۗۡۖ۬ۤ۠ۦۗۧۘۧ۟ۢۢۙۖ۠ۨۥۜۤۖ۟ۘۨ۫ۜۘۙۧ۫ۤۨۨۘۤۛۖۘۧۚ۬ۘۦۥۢۡ۠ۥۧۜ";
                                            break;
                                        case 812286502:
                                            str9 = "ۨۜۢ۫ۤۡۢۧۗۙۚۘۘۖۦۜۘ۠ۙۦۛۗۡۘۗۡۜ۟ۙۚۦۥۧۦۧۥۘۙۤۚ۫ۚۚۙۢۖ۟ۢۚ۫ۛۛ۟ۚ۫۫ۨۧۦ۟ۦۘۢۡ۬ۗۧۨۘۘۛ۟ۘۖ۫۫۟ۖۘ";
                                            break;
                                        case 1233418293:
                                            str8 = "ۙ۬ۦ۬ۤ۠ۘۘۢۧ۬ۖۘۛ۠ۥۘ۠۫ۚۛۥۚۗۦۡۢۘ۬ۦۧۙۨۖ۠ۙۢ۬ۗۥۥۜۘۦۥۚۛۘۡۨۘۢۖۥۤۜۖۦ۟ۛۘۙۨ۟۫ۢۜ۟ۜ۬ۜۢۡۨۥۧۖۧۙۢۛۘۛۘۘ";
                                            break;
                                        case 1682736390:
                                            String str10 = "ۗ۬ۥۘ۫ۛۛۚۤۥۖۧۗ۫۬۬ۥۧۧۖۨۦۘ۬ۡۙۨۜۤۦ۟ۦ۟ۚ۬ۡۖۘۚ۫ۛۗۖ۬ۛۡۜۘۡۗۨۘ۟۫۠۠ۨۜۘۘۤۤ۠ۥۘۘۧۘ۫۠ۛۗۙۤۦۘۚ۬ۢ";
                                            while (true) {
                                                switch (str10.hashCode() ^ 356132720) {
                                                    case -504561430:
                                                        str10 = "content".equals(uri.getScheme()) ? "ۦ۟ۛۗ۠ۛۜ۟ۨۘۗۘۧ۫ۖ۟ۜۦۧۚۙۘۙۘۘۚۖ۬ۨۗۢۙۛۛ۟ۧۖۘۢۗۙۦۢۘۗۘۨۘ" : "ۚۨۖ۬ۢ۬ۛۚۛۖۧۦۨۧۡۘۡۙۤ۬ۤۡۘۨۘۢۜۡۧۛۥۘۤۜ۠ۡۥۜ۟۫۫ۖۖۗۖ۬ۨۘۜۘۡۘۨۥۧۙۥۘ۠ۚۖۛۖۥۦ۬ۦۘۤۤ۫ۗۚ۬ۘ۟ۖۘ";
                                                        break;
                                                    case -130809619:
                                                        str10 = "ۚۘۨۘۚۘۜ۠ۜۦۘۡۤۚ۫ۡۚ۠۫ۨۛۦۨۖۖۙۘ۫۫ۜۦۖۘۢۜۘۡۢۡۜۜۦۘۥۦ۟ۗۤۢۥۤۜۘۡۡۗ۫۫۫ۘ۫ۢ۫ۤۗ۫ۦۘ۠ۥۦۗۥۗۖۤۘۘۛۦۖۛۛۘۛۜۖۘ";
                                                        break;
                                                    case 292997876:
                                                        str9 = "ۥۡۢۢۤۨۘۜۗۡۘۤۨ۟۬ۥۛۥ۫ۤۚۘ۬۠ۨۥ۬۫ۨۘۖ۟ۨۘ۫ۧ۬ۗۤ۠ۚۧۘۙۤۨۖۦۡۧۨۨۘۤۘۥۦۧۛۜۘۜۖۛۚۘۥ";
                                                        break;
                                                    case 855450880:
                                                        str9 = "۫ۘۡۦۜۥۜۘۚ۫۫۟ۚۙۘۘ۫ۖۛۨۢ۬ۦۢۤ۠ۛۘۘ۬ۗۜۘۥۙۦۘۜۛۘۦۗۦ۬۬ۥ۫ۚ۬";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
            }
            str = "ۦۙۡۘۚۧۦۘۤۨۡۘۖۜۨ۟ۨۦۦۙۢۦۜ۫ۗ۬ۘۥۜۦۥۖۡۘۦۤۙۨۢۚۤۗ۫ۡۢۡ۫ۦۘ";
        }
    }

    @Override // p001.AbstractC0469y8
    /* JADX INFO: renamed from: ۥ۟ۡ */
    public final AbstractC0469y8.a mo1030(C0443w8 c0443w8) throws FileNotFoundException {
        ContentResolver contentResolver = null;
        Uri uri = null;
        int iMatch = 0;
        AbstractC0469y8.a aVar = null;
        StringBuilder sb = null;
        InputStream inputStreamOpenInputStream = null;
        Uri uriLookupContact = null;
        Uri uri2 = null;
        InputStream inputStream = null;
        InputStream inputStreamOpenContactPhotoInputStream = null;
        InputStream inputStream2 = null;
        AbstractC0469y8.a aVar2 = null;
        AbstractC0469y8.a aVar3 = null;
        String str = "ۙۤۢۗۜۛۢۘۘۤۤۧ۫ۨۨۘۦۡۖۘۚۚۨۘ۫۟ۢ۠ۛۦۘۧۘۘۤۦۘۦ۟ۤۗۜ۫ۥۜۨۨ۫ۘۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 685) ^ 539) ^ 182) ^ 166) ^ 674) ^ 1013) ^ 396) ^ 66432444) {
                case -1950962701:
                    String str2 = "۫ۤۖۘ۬ۛۘۘۗ۠۟ۨۘۢۥۚۖۡۥۚۜۛ۟ۥۨۘ۬ۡۘۡۧۦ۬ۦۘۘۜۛ۫ۡۜۘۢۚۜۘ۬ۗ۬ۚ۫ۛۧۧ۟۫ۥۘ";
                    while (true) {
                        switch (str2.hashCode() ^ (-1897210557)) {
                            case -1354816726:
                                str2 = "۬ۗۥۘۙ۫ۖۛۤ۫ۦۢۡۘۢۧ۫ۤۘۥۘۥۖۡۚۦۨۘۖۢۘۙۖۥۘۙۤۢۢۨ۫۟ۨۙۥۤۙ";
                                break;
                            case -627473563:
                                str = "۬۟۠ۧۙ۟ۡۖۨۖۜۚۘۦۦۢۘ۬ۦۢۖ۫ۘ۫ۚۧۜ۟۟ۙ۫ۡۗۖ۫۠ۧۙۤۧۘۘ۬ۙ۫۟۫۟ۦ۠ۥۨۦۡۘۘۦۛ۠ۡۘ۬ۖۡ";
                                continue;
                            case 1602297125:
                                str = "ۨۖۧۘۙۥۢۚ۠ۖۘۥۧۦۨ۠ۗۨ۫۟ۘۙۛۥۤۡۘۡ۟ۜ۠ۡۗۙ۫ۥۤ۬ۚۜۘۨۙ۬۠۬ۦۨۘۥۦۘۚۛۚ۬ۡۘۤۛ۟ۤۨۥۘۦۦۤ";
                                continue;
                            case 1931668439:
                                String str3 = "ۧۥۥۘۡ۬ۥۘ۬ۛ۫ۚۙۖۘ۬۠۟ۖۗۗ۟ۜۤۛۨۨ۠ۜۘۗۜۢۖۖۘۘۥۖ۠۫ۙۗۚۛ۠ۧۗۥۘۨ۬۟۟ۛۛۤۗۘۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-345070613)) {
                                        case -573785356:
                                            str2 = "ۗۦۛ۠ۧ۫ۦۨ۬ۨۥۨۙۖ۬ۗۘۘۘۦۥۥۘ۠ۙۜۥۜۚۚ۟ۜۘۨۗ۠۬ۦۚۡۦۘۤۘۡۘۙۘۧۘۤ۠ۡۘۡۘۙۦ۠ۚ";
                                            break;
                                        case 256260166:
                                            str3 = "۟۫۬ۥۚۨۘ۟ۘۨۘۙۖۙ۫ۖۘۧۡۘۘ۬ۨۦۡۛۙۛۜۧۙۚۜۡۙ۠ۧۗۡۛۖۘۙ۟۫ۦۖۖۜۙۜۚ۫ۖ۠ۗۥۘ";
                                            break;
                                        case 855969673:
                                            str2 = "ۗ۫ۜۘۖۗۜ۟ۤۘۘۙۖۘۗ۠۟ۘۦۢۤۛۤۛۨۥ۠۬ۜۥۧۘۨۜۨۘۙۡ۫ۢ۠ۥۦۙۙ۠۟۟ۦۢ۬ۧۦۥۘۗ۟ۗ";
                                            break;
                                        case 1092956730:
                                            String str4 = "ۙ۠ۛ۬ۘۡۘۧۖۗۤۙۢۢۦ۟۫۠ۖ۬ۤۦۧۚ۫ۖۥۡ۟۬ۜ۫ۘۘۜۧۥۘۘ۫ۡۘۙۘۜ۬۫۫۠ۧۙ۟۬ۘۘۤ۫ۡۡ۠ۦۗ۠۬۬ۨۧ۫ۜۚۚۗۡۙۜۗۙ۫۬ۘ۬ۜۘۡۤۢ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1363719137) {
                                                    case -1655589144:
                                                        str3 = "ۜۚۦۧ۬ۖۛۡۨۘۥۧۙ۟ۛۚۧۢۗۘۗۤ۟ۦۙۡ۠ۧۧۙ۫ۛۨۘ۟ۜۘۖۦۖۧۗۚۜۜۧ";
                                                        break;
                                                    case 200033475:
                                                        str4 = "ۚۚۤ۬ۡۤۥ۟ۘۨۨۘۗۚۘۚ۫ۙۦۚۡۥۚۦۜ۟۠ۜۡۤۦۨۘۧ۬۟۠ۖۘۘ۫۬ۢ۠۫ۥۘۨۗۖۘۥۗۜ۬ۜۜ";
                                                        break;
                                                    case 971962130:
                                                        str4 = iMatch == 4 ? "ۖۘۡۧ۬ۚ۠ۢ۫ۢۗۙۤۥۨ۬ۚۥۘۗۨۙۨۙۦ۠ۜۨۖۨۤۙ۟ۤ۟ۦۧۨۙۘۘ۟ۛۖۦۨۡۚ۬ۖۧۧۖۡ۟ۜۥۡۡۖ۬۬ۡۘۦۙۜۖۨۤۧۚۥۛ۟ۖۘۙۗۨۘۨۨۡۘ" : "ۢۡۜۘۦۖۧۢۡۘۘ۟ۛۦۘ۬ۚۥۗۨۜۘۜۧۥۢ۠ۦۢۥۢۦ۫ۖ۫ۜۥۧ۫ۗۧۤ۠ۙ۬ۜۙۦۜۘ";
                                                        break;
                                                    case 2127899003:
                                                        str3 = "ۜۡۧۧۜۜ۟ۚۗۢۨۦۘۦ۬ۥ۫ۘ۬ۤۖۗۨ۠ۛ۟۬ۜۘۨۘۧۘۦۧۘۧۙۘۘۦۡۘۢۤۜۛۙۖۘ۟ۙۜۘۦۧ۫۠ۨۡۢۖۥۘۤ۫ۜۦ۠ۡ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -1755645813:
                    str = "ۚۖۘۘۘۙۜۗۙۤۛۖ۫۟ۛۢۥ۟ۢۦ۬ۢۧ۟۟۠ۢ۬ۙۖۛۘۖۘۦۜۤۨۗ۟ۦ۫ۨۜۤۤ";
                    inputStream2 = inputStreamOpenContactPhotoInputStream;
                    break;
                case -1730364389:
                    str = "ۖۛ۬ۖۜ۫۫ۦۜۘۘۨۖۘۛ۫ۦۘۖۘ۠ۥ۫ۖۨۗ۫ۢۚ۠۫۬ۛۛۡۘۨ۫ۗۥۢۜۧۦۥۘ۬ۨۨۘۛۜۖۘ۟ۡۧۡۘ۟ۛ۫ۧۙ۠ۘۘ۠ۜۥۘ";
                    uri2 = uri;
                    break;
                case -1571832154:
                    str = "ۥۛۢۧۘۛۤ۬ۥۧ۬ۦۘ۠ۖ۬ۡۤۚۦۖۨۘۛۧۦۘۡۤۦۘ۠ۥۘ۫ۘ۠ۨ۟ۡ۫۠ۡۦ۬ۥ۬ۙ۟ۨۡۙۦۤۨۚۤۡۘ";
                    aVar3 = aVar;
                    break;
                case -1498172948:
                    str = "ۚۙۘۘۛۙۧۢۡۦۘۖۧۘۖۥۛۡۤ۠ۢۜۧۘ۫ۢۨۖۛۙۜۦۦۘۛۚۚۙ۠ۗۚ۬ۛۤۚۚ۟ۥۛۘۤۚۢۥۘۛۜۡۘ";
                    break;
                case -1345950085:
                    throw new IllegalStateException(sb.toString());
                case -1109493943:
                    return aVar3;
                case -937255773:
                    String str5 = "ۗۖۗۡۖ۟۟ۘۦۘۢ۠ۛ۫ۚۘۘۦۤۛ۠ۚۛۡۜۘ۬ۨۜۘۧۚ۬ۡ۬ۗ۠ۗۨ۬ۜ۠ۘۤ۟ۖۜۘ۬ۖۜۘ۟ۙۙ۫ۛۥۘ";
                    while (true) {
                        switch (str5.hashCode() ^ (-998513703)) {
                            case -519901648:
                                String str6 = "ۨ۟ۥۘ۫ۦۧ۬ۘۘۘۥۨۘۗۖ۠ۧۖۚ۟ۡۤۖۙۗۜۢۗ۠ۥۥ۠ۘۥۘۤ۟ۤ۟ۨۘۤۦۧۘۖۥۛ۫۫ۙۘ۫ۡۘۚۖۙ۫ۦۧۙۤۜۜ۬ۥ";
                                while (true) {
                                    switch (str6.hashCode() ^ (-1037939602)) {
                                        case -1780354481:
                                            str5 = "ۚۗۦۚۥۘ۟۟ۜۛۘۦ۫ۗۘۚۢۨۜۜۥۙۡ۟ۖۙ۠ۨۨۨۖۥۦۘۡۤ۠ۖۥۧۘۜۛۥۥۦۚۚۚۜ۟ۢۜۘۗۜۧۘۡۢۦ۠ۡۡۙ";
                                            break;
                                        case -1109665036:
                                            str6 = "۟ۜۤۖۡۨۘ۫ۛۖۖۙۥۙۢۖۨۨۢۡۘۦ۟ۦۤۨۥۜۘ۫ۥ۫۠۠۬ۥۘ۫ۗۛۨۗ۬ۘۢۡۘۥ۟ۘۘۚ۟ۦ۠ۦۘ۬۫ۚۛۢۨۘۙۤۧ۟ۖۦۖۖۘۘۥۗۛ۟ۨۢۘۨۤ۠ۚ۠";
                                            break;
                                        case 175745803:
                                            str5 = "۬ۧ۟ۜۧۚۨ۟ۚۡۤۘ۬ۘۜ۬ۜۘۥۖۨۘۢۧۙ۟ۛۨۗۧۦۘۖۥۗۖۢ۠۟ۚۦۛۡۦۢۖ۫ۥ۬ۜۘ۟ۥ۟ۦ۫ۚ";
                                            break;
                                        case 1144392750:
                                            String str7 = "۟ۚۙۥۧ۠ۢۢۦ۫ۨۢۡ۬ۖۘۡ۫ۥ۬ۧۖۘ۫ۘۜۚۢۚۗۨۜۗۧ۟ۚ۬ۤۧۗۗ۠۠۠۠ۜۘ۫ۙۛ۟ۘۚ۫ۨۜ";
                                            while (true) {
                                                switch (str7.hashCode() ^ 393060652) {
                                                    case -1514799660:
                                                        str6 = "ۨۢۥۢۙۘۤ۬ۦۘۢۘۡۘۦ۠ۖۘ۠ۡۖۘۜۥۚۧۗۖ۫ۛۖۘۧۦۥۘۦۨۦۨۧۗۢۘۘ۫ۦۘۛۜۨۢۘۦ۟ۡۘ۠ۚۤ";
                                                        break;
                                                    case -585025045:
                                                        str7 = uriLookupContact == null ? "ۧۙۥۘۥۡۘۛۜۚ۫ۦۗۢ۫ۨۥۗۦۘۤۧۡ۫ۗۥۗ۟ۥۦۚۡۘۛۡۤۖۦۛۥ۫ۢۙۗۖ۫۫ۘۗۢۘۥ۟ۨۘۙۗ" : "ۨ۠۟۟ۖۘۘۨۡۚۘۡۧۨۤ۠ۢ۠ۧۘ۬ۦۗۘۧۘۖۜۚۙۚۦۘۦ۠ۢۘ۬ۧۘۤ۫۬۬ۦۘۖ۫";
                                                        break;
                                                    case 218426342:
                                                        str7 = "ۘۛۜۘۥۡۢۜۤ۟ۚۚۥۘ۫ۖۛۛۜۘۜ۟ۛۡ۬۠ۨۜۤ۠ۜۥۘۚۦۨ۠۫ۡ۠ۚۥۘ۠ۧۨۧ۫۟ۨۤۜۖۤۧۖۜ۫ۥۚۢۚۗ۬ۜۖۦۦۘۥۦۜ۟۟ۧ";
                                                        break;
                                                    case 1053715705:
                                                        str6 = "ۧۛ۟ۤۥۥۢۨۦۘۖۚۥۘۖۦۖ۬ۙۗۘۢۢۧ۟ۤ۠ۗ۬ۤۥ۟ۡۨۡۘ۠ۥۡۘۚۜۨ۫۬ۢ۟ۜۘۤ۬ۖۖۨۧۘۧ۠ۘۛۗۚۥۢۖ۟ۛۦۘۨۚ۟ۙۨۡۘ۬ۛۨ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 305102396:
                                str5 = "ۧۧۥۘۥ۬ۘۘ۟ۦۧۘۦۦۜۘ۟ۜۖۘۧ۟ۡۜ۠ۤۤۢ۠ۦ۠ۜۘۡ۬ۡ۬۬ۙۜۖۨۦۥۡۘۨ۬ۗۥۡۧۘۦۨۦۘۙۥۨۡۥۨۘۤۥۙ۬ۦۙۚ۠ۡۡۖۥۖ۬ۧۡ";
                                break;
                            case 997942659:
                                break;
                            case 1365901644:
                                str = "۫ۗۖۚۤۘۘ۬ۖۖۘ۠ۥۜۘۤۗ۟۬۫ۜۘ۬ۛۡۚۖۥ۠ۚۨۜ۠ۙۘۤۤۛۤۢۘۜۘ۫ۛۘۘۙۤ۫";
                                break;
                        }
                    }
                    str = "ۚۦۡۤ۫ۨ۬ۦۗۛ۠ۖ۟۟۠ۜۡۡۥۧ۟۠ۗ۬ۦۖۘۙۜۦ۟ۢۚ۟ۦۨۘۘۙۛۚۢ۠ۗۨۛۚ۠ۖۧۜۧ۠ۖ۬ۛۜۢۜ۟ۨۦ۬ۛ";
                    break;
                case -888085969:
                    sb = new StringBuilder();
                    str = "۟ۚۧ۟ۡۥ۫ۛۥۘۤۙۜۘۥۖۤۙۧۨۘۡ۟ۤۙ۟ۦۨۥۘۘۜۚۖ۠ۡۘ۬ۙۖۘۨ۠ۖۨ۫ۥۘۦۛۘۘ۠ۜۦۧۛۘۘ۟ۨۚۖۙ۟ۨۥۚۧۛۖۘ۬ۥۧۘ۠۟ۦۙۢۙ";
                    break;
                case -582258567:
                    aVar2 = new AbstractC0469y8.a(inputStream2, C0481z7.e.DISK);
                    str = "ۧۚۦۘۗۘۧۢۜ۠ۦۙۤۖۥۖ۟۫ۨ۠ۢ۬۬ۦۗۦۦ۫ۡۜ۫ۛ۫ۜۘۦۗۤۢۤۨۘۢۘۛ۠۬ۙۜۖۘۚۘۛ۟ۧۧ";
                    break;
                case -569691942:
                    sb.append("Invalid uri: ");
                    str = "ۚۘۛۤۚۖۘۚۦ۫ۜۤۗۧۘۨۘۙۤۖۘۛۥۖۘ۠ۡۦۡ۬ۖۦ۫ۨۦۥۖۘۙۡۥۖۜۤۢۛۥۘۥۤۛۗۦۥۛ۟ۡۚۡۘ۠۟ۡۘۦۨۜۘۙۥۧۘۧۤۤ۠ۦۧۘ۬ۛۨۘ۟ۛۘۘۖۗۧ۟ۜ۠";
                    break;
                case -114207349:
                    inputStreamOpenContactPhotoInputStream = ContactsContract.Contacts.openContactPhotoInputStream(contentResolver, uri2, true);
                    str = "۫۠ۨۘ۟ۚ۠ۗ۫ۦۥۤۧۜۨۧۦۜۘۡۜ۫ۘۛۦ۫ۖۧۛۥۛۢ۬ۡ۬ۘ۟ۙۢۖۘۚۚۥۘۧۨۡۨ۬ۛ۟ۖۖۙۖۦۘۦۚۨۘۤۨ۠ۘۖۨ";
                    break;
                case -54595873:
                    str = "۬ۛۗۙ۠ۙۘ۠ۖۙۛۢ۟ۡۢ۫ۛۘۨۗ۟ۡۥۡۗۛۡۥۜ۫۟ۧۜۦ۫ۙ۫ۤۨۘۤۚۧۥ۟۠ۧۖۧ۬ۥۥۘ۫۫ۙ";
                    inputStream2 = inputStreamOpenInputStream;
                    break;
                case 29115018:
                    String str8 = "ۡۖۖۘۙۨۡۚۘ۬ۡۦۘۗۜۖۜۜۨ۟ۦۘ۬۬ۚۖ۫ۦۡۤۤۜۦۦۖۜۜۘ۫ۨۛۥ۠ۢۦۚۛۘۖۡۧ۟ۡۙۙ۬۠ۙۚ۠ۧۢۗۙۛ";
                    while (true) {
                        switch (str8.hashCode() ^ (-1404511)) {
                            case -2099366450:
                                str8 = "ۖۖۦۙۜۦۘۢۨۧۘۧۗۢۜۡۖۘۦ۬ۢ۠ۧۤۚۖۜۘۘ۟ۜ۟۫ۤۤۜۦۘۜۚۖۙۦۧۡۛ۠ۧۡۘ";
                                break;
                            case -2069136438:
                                break;
                            case -1735290808:
                                String str9 = "۠۬ۘۘۙۨۡۘۡۜ۟۟ۘۜۨۤۖۙۗ۠ۖۡۘۜ۟ۡ۫۠۫ۚۧۤۡۖۛۡۖۡۘ۬ۦۥۛ۫۟ۛۨۨۘۚۨۦۗۗۖۤۜۥۛ۬۫ۡۘۜۘۘۦۡۙۡۖۘۧۛۜۘ۬۬ۗۢۨۘۘ۫ۖۛ۫ۦۥ";
                                while (true) {
                                    switch (str9.hashCode() ^ 1406838857) {
                                        case -2070170790:
                                            str9 = "۫ۗۧۖۛ۫ۛۖۡۘۖۛۡۘۨۦۜۘ۠۠ۚ۬ۨۛۚۦۙۗ۫ۖۨۛۗۥۙ۫۟۫۫ۤ۠ۘۡۖۗۛۖۖۢ۠ۙۥۘۦۘۨۨۦۘ";
                                            break;
                                        case -1925365319:
                                            String str10 = "۟ۗۖۘ۬ۛۥۨۚۦۡۙۧۙۥ۠ۛ۬ۤۙۗۥ۠ۚ۬ۛ۫ۙۛۜ۠ۨۢۤۢۜۙ۬ۗۦۘۡۦۛۗ۟ۘۘۦۙ۟۬ۜ۬ۨۦ۠ۥ۬ۘ۠۬ۤ۬ۗۘۛۜۖ۟ۖۥۖۛۧ";
                                            while (true) {
                                                switch (str10.hashCode() ^ (-294764034)) {
                                                    case -1928699125:
                                                        str10 = "۫۠۬۬۟ۗۘۢۙ۟۟ۛ۟ۡۘۤۡ۠ۖۛۤۨۜۨ۟ۦۨۘۜۤۚ۫ۤۤۙ۟ۗۦۤۧۢ۠ۨۘۢۖۚ۫ۚۖۘۜۥۥ۟ۛۨۘۨۦۜۤۘۜ۟ۛۦۖۦۡۨ۬ۖۨۡۘۙۗ۫ۡ۟ۙۨۤۦ";
                                                        break;
                                                    case -875060930:
                                                        str10 = iMatch != 2 ? "ۙۦۖۨۦۨۘ۠ۚۦۦۚۦۥۛۜۘۤۢۢۦۛ۠ۨۜۡۘۜۜۥۡۖۚۤۤۦۨۗۦۗۨۧۥۤۜۘۥۛ" : "ۗۡ۬ۗۛۖۘۡۤۢۛ۫ۖۘۢۡۘۘۨۘۨۘۦ۬ۙ۟ۦ۠ۛۦۖۙۡۚۢۜۘۛۨۛۦۘۛۢ۠ۥۘ۟ۤۨۤۚ۬ۗ۠۬ۥ۬ۥۚۤ۫۫ۖۢۘۤۚۡۗۜۚۖۘۘ۬ۡ";
                                                        break;
                                                    case -753070622:
                                                        str9 = "ۚۚۘۘۚۘ۟ۨۡۘۜ۫ۚۗۘۥۤ۫ۡۘ۟ۢۡۘۥۛۢۤ۠۫ۥۧۖۘۡۗۖۘ۟ۘۘ۫ۙ۟ۥۖۨۙۥۤ۠ۘ۠۠ۤۖۘۛۚ۫ۛ۫۟ۛۤۙۥۛۗۚۥۖۡۤۘۘ۬ۧۦۘۙۦ۬۫ۨۖۥۥۧ";
                                                        break;
                                                    case -261013604:
                                                        str9 = "ۘۗۡۘۜۡۜۘۜۦۖۜ۟۬ۢۨۧۘۦۧۤۚۥۡۖۘۗۦۨ۟۟۠ۦۙۛ۬ۧۧۨۘۙۦۡۘۙ۠ۢ۬ۨۥۙۤۥۘۧۗۨۘۥۥۜۖۛۨۙۥۙۥ۫۟۫ۛۗۤ۟ۡۘۚۚ۠۫ۚۗ۠۠ۖ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -1761516683:
                                            str8 = "ۘۨۧۖۜۦۘۤۛۦۘۜۚۛۡۨۖۧ۫۟ۛ۠۠ۧۧۙۦۡۥۖۤۗۧۡ۠۫۫ۖۘ۠ۡۘۘۗۛۨ۟ۧ۠";
                                            break;
                                        case 1606300218:
                                            str8 = "ۘۜ۫ۦۗۢۙۨۥۘۙ۟ۛۥۚۥۘۡۦۢۥۚۢۧۨ۫ۦۘۗ۠۟۬ۡۘ۟ۧۘۚۙۧ۠۫۠ۧۛۦۘ۟ۦۥۘۘۦۨۘۢۡۦۘۢ۠ۤۘ۠ۙۢۢۚ";
                                            break;
                                    }
                                }
                                break;
                            case 1409172934:
                                str = "۫ۖۦۘۡۡۤۨۢۗۨۦۤ۫ۥۤۥۗۙۗۢۤۧۘۥۘۦۖۖۘۛۜ۫ۚۙۘۥ۬ۨۘ۬ۡۢۡۖۧۨۡۚۘۥۥۘۤۢۖ۟ۛۜۘ۫ۨ۫ۧ۠ۨۗۥ۫ۨۡۡۘ۟ۛۘۘ۟ۙ۠";
                                break;
                        }
                    }
                    break;
                case 61226551:
                    str = "۬ۧۖۘ۟ۗۡۘۖۖۦۘ۟۫ۗۚۙۜۧۘۚ۬ۨۘۗۙۡۘ۟ۘۖۘ۟ۧ۟ۚ۟ۖۘ۬ۙۧ۟۟ۥ۠ۦۦ۟ۤۤۦ۫ۛۜ۠۫ۤۚۤ";
                    break;
                case 307414701:
                    inputStreamOpenInputStream = contentResolver.openInputStream(uri);
                    str = "ۚ۟ۢۡۙۜۘ۬ۧۡۘۤ۬ۘۖ۠ۨۘۜۜ۠ۧۢۜۥۚۤۚۗ۫۟ۘۦۘۗ۬ۜۘۦ۠۠۟ۙ۫ۜۚۡۢۚۛۢ۫۬۬ۧ۟ۦۚۚۦۛ۬ۘۢۗۘۗۛۤ۠۟۫ۥۘۛۨۜۨۥۧۗۤۗ۠ۖۙ";
                    break;
                case 381599392:
                    inputStream = null;
                    str = "۬ۛۜۘۤۡ۟ۖۨۦۘ۬ۦۨۢۤ۟ۙۖۖۛۦۨۘۦۙۖۘۛۜۘۘۡۡۤۡۙۧۢ۫ۥۨۛۙ۬ۙۡۨۥۛ";
                    break;
                case 525940346:
                case 903986458:
                    str = "ۚۖۘۘۘۙۜۗۙۤۛۖ۫۟ۛۢۥ۟ۢۦ۬ۢۧ۟۟۠ۢ۬ۙۖۛۘۖۘۦۜۤۨۗ۟ۦ۫ۨۜۤۤ";
                    break;
                case 967399114:
                    sb.append(uri);
                    str = "ۧ۬۬ۜۛۧ۫ۥۘۘۖۢۗ۫ۚۚۛ۫۠ۛ۬ۖ۬ۥۘ۟۠ۦۘۡ۬ۜۘۥۘۜۘۖۧۧۤ۫ۚۜۢۥۧۧۨۘ";
                    break;
                case 1039053551:
                    uri = c0443w8.f1842;
                    str = "ۛۨۥ۫ۡۙ۠ۡۜۧ۫ۦ۟ۥۤۥۡۘۛۖۢۚۤۦۗۨۥۘۥ۫۠۬۠ۥۚۚۜۛۗۢۥ۬۟ۘۢ";
                    break;
                case 1120249113:
                    uriLookupContact = ContactsContract.Contacts.lookupContact(contentResolver, uri);
                    str = "ۙۧ۫ۤۚۢۧ۟۠ۤ۟ۦۘۖۨۙۦ۬ۤۡۨۧۚ۠ۦۘۛۗۚ۫ۙۘۛ۬ۡ۟ۙۡۗۡ۫ۤ۬۟ۧۡۧۘ";
                    break;
                case 1327193113:
                    iMatch = f1035.match(uri);
                    str = "ۙۤۘۘۡۥۘۡ۬ۧۢ۫ۚۤ۫ۨۘ۬ۡۨۘۙۜۨۢ۬ۡ۠ۙۤۙ۫۫ۘۥۥۘ۫ۡۖۤۙۛ۟ۡۨۗ۬ۗۚ۠ۥۖ۬ۜۘۥۢۗ";
                    break;
                case 1402330080:
                    contentResolver = this.f1036.getContentResolver();
                    str = "ۘۥ۬ۗۢۗۘۧ۟۫ۘۘۜۥۙۙۥۧ۬ۘ۬ۧ۠ۙۙۥۤۡۡۤۧۧۡۦ۠ۖۗ۠۬ۚ۬ۥۘ";
                    break;
                case 1489464484:
                    aVar = null;
                    str = "۫ۧۖ۠ۛۥۜۛۦ۫ۨۦۡۘۢۙۜ۫ۦ۠ۖۧۦۥۘۤۘۘ۠ۢۘ۬ۖۥۧۗۖۢۜۦۘۤۡۗۗ۬ۚۘۧۡۘۛۤۜ۫ۥۦ";
                    break;
                case 1607476313:
                    str = "۟ۛۦۘۡۙۖۘۧۚۛۢ۬ۜۘ۫ۦ۬۬ۥۚۖۘۥۘ۠ۤۘۘ۫ۗ۠ۨۙۡ۠۫ۡۤۛۜۘۘ۟ۥۗۨۤۗۛۦۘۡۜۖۘۥۦۜۘۚۛۡ۫ۨۜۘۙۡۜ۫ۢۥۘ";
                    aVar3 = aVar2;
                    break;
                case 1690707454:
                    String str11 = "۠۠۟ۗ۠۟۠ۘۘۗ۟ۜۢ۫ۛۤۚۜۘۙۡۢ۫ۚۢ۫ۚ۟ۧۢۦۦۦۘ۫ۚ۫ۡۥۖۘ۫۟ۥۘۢۤۖۖۡۢۙۜۨۘ۬ۡۙ۬ۘ۬۫ۜۗ۠ۖۧۘۦۖۖۘۙۙۚ۬ۙۨۗۦ۠ۗۜۘ۠ۨ";
                    while (true) {
                        switch (str11.hashCode() ^ 642942590) {
                            case -1679492531:
                                break;
                            case 121290836:
                                str = "ۢۢۘۘ۟ۥۖۘۚۙۤۨۦۚ۬ۙۘۛۙۨۙۢ۫ۗۦۥۢ۟ۖۢۗ۟ۤ۟۬ۤ۬ۗۡ۫ۥۦۙۙۢۗۨۘۥۡۡ۬۠ۥۧۤ۬";
                                break;
                            case 1442776400:
                                str11 = "ۡ۠ۡۘۧۛۨۘۙۧۥۥۢ۟ۘۙ۟ۦ۠۬ۥ۫۟ۥۘۤۚۧۥۘ۟ۡۦۡۥۛ۠ۖۖۚۚۤۘۜۛ۠ۧۗ۠ۥ۟ۗ۫ۥۗۡۥ۬۠۟ۨۨۜۡۤۡۥۦۘۥۧۘۨۖۥۘ";
                                break;
                            case 1580607684:
                                String str12 = "۬ۖۙۗۖۚ۬۠ۨ۟ۘۨۖۥۦۘۨۖۡۘۨۗۨۘۚۧۡۘۢۛۜۛ۫ۢ۫۟ۚۦۡۗۥۙ۫۟ۙۤۡۤۥ";
                                while (true) {
                                    switch (str12.hashCode() ^ (-1802633946)) {
                                        case -2053423524:
                                            String str13 = "ۤ۫ۜۡۘۨۚۚۛۨۦۖ۟ۦۡۘۗۥۡۧۘۥۖۛۨۘۢ۟ۗۢۗۘۚۧۘۘۧۧۧۛۗۜۘۜۗۥۧۙۨ۟ۙ۠۬ۤۢۚۡ۫ۛ۫ۡۖۧ۠ۤۙۜ";
                                            while (true) {
                                                switch (str13.hashCode() ^ 1176805767) {
                                                    case -2000184822:
                                                        str13 = "ۖۖۤۤۡۦۘ۬ۡۘۘۛۦۥۙۨۡ۫ۛۖ۠ۤۙۤ۫ۢ۟ۘۘ۬۠ۙۥ۟ۘۘ۠۫ۥۦۤۢۗۧۢۗۧ۬ۡۡ۬ۥۦۜۤۖۘ";
                                                        break;
                                                    case -862489546:
                                                        str13 = iMatch != 3 ? "ۢۤۘۘ۬ۥ۬ۜۧۡۘۜۤ۠ۚۢۡۖۨۢۙۙۥۘ۫ۡۛ۫۬ۘۘۚ۫۬ۗۗۙۗۡۘۚ۫ۧۗۥۢۦۥۡۘ" : "ۖۥۖۘۛۘ۟ۤۙۛۥ۬ۘۘ۬۠ۙۜۘۡۘۦۢۦۧ۬ۘۘۨۢۧۡۡۙۡۡ۫ۡۖۜۘۨ۟۠ۧ۫ۖۘ۬ۧۜۛۡۨۧ۫ۥۤۛۦۖۡۡۜۛ۬ۧۥۥۘۘۨۧۘۧ۠ۡۘۘ۠۟";
                                                        break;
                                                    case -44781254:
                                                        str12 = "ۡۙۗۥۦۡۘۚۥۘۘۥۚۤ۠ۗ۬ۨۦۘۘۨۨۡۘۜ۫ۧۛۢۘۘ۫ۜۧۘۛۙۨۘۢۖۚۘۙۘۚۘۙۖۚۜۘۨۦۜۘ۠ۥۨۘۦۙ۬ۚۤۘۘۚۙۘۢ۠ۢ";
                                                        break;
                                                    case 887833072:
                                                        str12 = "ۘۥۖۜۥۘۤۤۡۘۘۧۥۥۤ۟ۨۥۘۦۨ۬ۖ۠ۨۘۛۡۘۨۤۛۗ۬ۦۘۗۥۨۛۡۖۘ۠ۖ۫ۚۥۦۙۜۚ۠ۢ۠ۛۜۥۢۦۧۘۗ۟۬ۛۙ۠ۛۨۥۘ۫ۤۙ۬۫ۨۘۡ۫ۖۘۖۘۧۘ۟ۙۡۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -1601014089:
                                            str11 = "۬ۢ۠۟ۦۡۘۜۦۘۘۧ۫ۗۘ۫ۛۦۘ۠ۜ۫ۜۘۥۙۥۘ۠۠ۨۧۧۘۘۜۤۢۨ۬ۚ۟۬ۡۘۦۥ۫ۖۡ۠ۥۨ۬ۗۦۦ۫ۙ۟ۧۨۨۘۦۜۘۘۗ۬ۛۡ۟۫ۤۢ۟۫ۚۥ";
                                            break;
                                        case 400575777:
                                            str11 = "ۜۤۦۘۡۘۗۧۨۡۘۢۜۛۤۘۨۤۡۥۨۙۛۛۡۧۡۙۘۘ۠ۢۢۚۦۥۘۧۦۢۛۦۧۥ۟ۜۘ۬ۜۗۜۨ۟ۖۚ۠ۚۘۘ۬۫ۢ۫۟ۡۖۧ۠";
                                            break;
                                        case 1646524917:
                                            str12 = "ۨ۫ۦۘۡۥۦۘۚ۫ۨۦۘۚۘۛۤۛۤۖۢۗۖ۫۠۟ۧۘۛۙۛۘۤۗۤ۠۟ۗۡ۬ۡۗۜۖۤۢۦۢۢ۟ۜۗۙ۟۠ۗۤۗۙ۫ۜ۟۟ۤۙۛۘۨۗۖۧۘۦۚۘۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1725855251:
                    String str14 = "ۦۘ۠ۖ۟ۡ۬ۥ۬ۡ۬ۡۘۛۧۤۧۨۙ۬ۡۡۚۧۨۘۧ۬ۡۢۦۛۖۥۘ۫۠ۥۖ۬۠ۚۦۖۘ۬ۜۥۖۘۥۘۨۡ۠ۙ۬ۧۙۜۘ۫ۥۥۘۧۤۦ";
                    while (true) {
                        switch (str14.hashCode() ^ 301067727) {
                            case -2141193623:
                                String str15 = "۟ۙۜۘۛۙۧۢۤۘۘۚۚۦۦ۟ۡۘۜ۬ۨۘۖۙۖۘۡ۟ۦۘۨۥۧۘۥۛۧۖۚ۠ۘۡۥۤۘۦۘۚۖۦۛۛۢ۟ۥۚۘۘۦۘ۟ۜۦۘ۬ۘۧۘۛۙۥۘۨ۫ۡۙۤ۬۬ۧۗۘۢۙ";
                                while (true) {
                                    switch (str15.hashCode() ^ (-1631573582)) {
                                        case -1772953470:
                                            str14 = "ۜۨۚۤۛۙۗۧۘۘۧۘۖ۬۬ۜۘۡۦ۟۫ۡۘۚۨۚۜ۬ۡۘ۬ۛۥ۠ۥۧۘ۫ۦۦۤۢۜ۠۬۠ۥۤ۬";
                                            break;
                                        case -206546432:
                                            str14 = "۫ۖۛۚۢۖ۠ۥۘۥ۠ۥۘۥۢۥۥۢۨۤۡۡۘۗۚۜۘۧۥۥۘۙۜۚۥ۠ۢ۫۬ۚۖ۠ۨۘۦۛۛۘۗۘ";
                                            break;
                                        case 1377844476:
                                            String str16 = "ۢۖۦۘ۠ۜۤ۬ۛۤ۠۬۟ۛۙۤ۠ۘۘۡۡۨۘۛ۫ۥۢۦۘۘۖۡۜۘ۬ۗۖۘۖۛۚۤۦۚۖ۟ۦۧۦۡۘۤۥۘۘۗۦۧ۬۠ۡ۟ۜۘۜۘۜۚ۟";
                                            while (true) {
                                                switch (str16.hashCode() ^ (-686015429)) {
                                                    case -1237736331:
                                                        str16 = "۬ۘۘۚ۬ۖۛ۠ۧۜ۟ۥۘۙۤۨۢۗۗ۟ۥ۫۠ۧۨۘۜۖۘۜۙۨ۫ۛۡ۬۫ۜۘۡۨۗۦۖۤ۬ۡۧۡۗۚۖۘۜۧۘۘ";
                                                        break;
                                                    case -902790858:
                                                        str16 = iMatch != 1 ? "ۖۤۤ۫ۧۥۘ۟ۚۥۘۥۧۦۙ۠ۜۦۙۥۘ۟ۚۡۧۚۦۖۜۛۖۛۛ۬ۛۢۨۙۤۖۘۤ۬ۨۦۘۦ" : "ۡۖۥۘۤ۠ۥۘۜۘۡۘۡۗۜۗۜۤۙ۠ۢۧۧۦۘۚۡۗ۟۫ۖۘۖۗۨ۟ۚۨۖۧۙۦۚ۟ۧۥۘۡۡۨۘۡ۠۫ۥ۫ۖۘ۬ۧۥۘۢۧۧۨۧۨۛۦۜۘۡۘۦۘۤۢۗۢۗۨۤۙۖۦۖۘ۠ۥ";
                                                        break;
                                                    case -14547255:
                                                        str15 = "۠۫۠ۡۜۚۥ۠ۧۥ۠ۦۙۘۘۤۢ۬ۙۤۨۗۜۗۛ۠ۨۨۡۗۦۧۧ۟ۛۦۘۖۘۙ۟۟ۛۛ۟ۤۤۖۘ۫ۗۙۦۘۡ";
                                                        break;
                                                    case 1613162160:
                                                        str15 = "ۘۤۥ۬۬۠ۦۘۤۖۖۨ۟ۦۦ۬ۤۢۡۧۜ۬۬ۡۧ۠ۥۘۡۗۙۥ۫ۡۘۨۨ۠ۥۖ۠ۚ۠ۖۘۛ۠ۖۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1828041485:
                                            str15 = "ۖ۠ۦۗ۫ۙ۠ۨۘۙۜۗۚۧۙ۬ۜ۫ۡۤ۟ۢۛۚۧۢۢ۬ۗ۬ۘۤۙۡ۫۬۟ۜ۬ۡۛۜ۬ۤۜۖۘۖۘۙ۟ۥۖۧۡۨ۠ۥۘۥۛۧ";
                                            break;
                                    }
                                }
                                break;
                            case -1987574694:
                                str = "ۜۜۛۥ۠۠۬۫۟ۜ۟۠ۡۘۚۨ۟ۗۘۧۘۘۤۖۨۘۜۚۗۤۥۖۚۢ۠ۦۥۖۛۜۘۘۧۛۥۘۧ۟ۛ";
                                continue;
                            case -819346331:
                                str14 = "۫۬ۘۗۨۥۘ۫ۢۥۚۗۨۘۢۧ۠۠ۛۛۜۙۡۘ۟ۛۡ۫ۜۛۤ۠ۜۤۗۦۘۤۨۢۥۚ۟ۙۜۨۘ۟۬ۨۡۛۗۢ۬ۖۚۦۜۡۙۡۨۗۨۙۢۨۘ";
                                break;
                            case -679528093:
                                str = "ۢۛۡۘۚ۫۬ۙۢۡۘۗ۫ۘۘۥۧۡۜۢۡۛۢۥۦۤۚۖۖۨۘۧۜۦۗۧۚۙۚ۫ۦ۠ۛ۬ۥۛۛۛۡۘۗۙۥۧۚ۠ۢ";
                                continue;
                        }
                    }
                    break;
                case 1768674974:
                    str = "ۛ۫ۦ۬ۖۡۡۤۤۡۦۖۨۥۢۡۛۡۛۜۘۚۤۢ۬ۥ۬ۦۖۡۖۧۛۗ۫۠ۦۥۧۘۚۦۜۖۨۙ";
                    inputStream2 = inputStream;
                    break;
                case 1811094878:
                    str = "ۡۚۢۢۚۗ۫ۦۤ۠ۢۖۜۤۗۡ۫ۚ۟ۖۘۢۗۚۢۧۤ۠ۚۦۘۛۛ۠۫ۙ۫۬۟ۡۘ۫ۡۛۡۖۢۥۗۧۚۜۘۖۦۜۘۘۗ۟۫۟۬ۥۡۗ";
                    uri2 = uriLookupContact;
                    break;
                case 2001949084:
                    str = "ۚۛ۬ۤۛۨۘۧ۠ۖۖۙۥ۬ۤۢۖ۬ۨۘ۟ۨۘۨۥۡۘۧۖۚۗ۟ۤۧۙۖ۫۟ۤۤۢۧۦۦۦۙۘۗۨۦ۫ۨۙ۫ۧۨ۠۟ۢۡۚ۫ۨۘۥ۠ۗۗۙۦ۫۠ۙۦۗ۠۬ۙۦۤ۟ۥۜۘ";
                    break;
                case 2104738795:
                    String str17 = "۟ۜۦۙۤۜۘ۟ۘۦۘۨۤۛۡ۠ۡۦۜۧۘ۬ۢۨۖۧۛۥ۬۬ۢۨۛۚ۠ۤ۬ۚ۬ۘۚۘ۟۬ۖۨۦۘۧ۠ۦۘۧۦۦۢۖۖۘۘۗۡۦۚۢۢۦۧۤۜۡۘۥۖۦ۬ۥۖۢۧۦۘۢۦۡۥۦۘ";
                    while (true) {
                        switch (str17.hashCode() ^ 1136911100) {
                            case -2069028357:
                                String str18 = "ۙۦۤۚۢۜۘۥۦۘۜۖۡۥۛۤۙۨۦۚۖۥۘۨ۫ۥۘۤۙۗۘ۟ۥۡۤۡۚۘۗۡۘ۬۬ۛۦۢۖۤۚۚۗۨۦ۬ۙ۫";
                                while (true) {
                                    switch (str18.hashCode() ^ 769386480) {
                                        case -1089395942:
                                            str17 = "ۨۧۡۘۗۘۨۥۥۜۘۙ۬ۢ۠ۥ۟ۥۜۜۘۚۗۨۖۡۚۖۢۥۘۚۡۥۙ۠ۚ۠ۘۧۘۙۛۚۗ۬۬۠ۗۨۘۦۚۥۨ۟ۧۚۖۤۛۨۢ۠ۦۘۖ۬ۥۘۨ۫۫۟ۧۦۘ۫ۚ۟ۗۦۨ۫ۜۛۘۗۦ";
                                            break;
                                        case 1267582935:
                                            String str19 = "ۡۚ۬ۤۤ۟ۨۗۜۥۛۡۘۘۧۥۖۦۧۡۦۤۥۖۜۨۘۥۛۗ۬ۘۘۨۚۛ۟ۚۢۜۘ۬ۜۥۘۦۧۚۧ۬ۧۨۗۘۘ۠ۧۘۘۚ۟ۢۤ۠ۜۘۤۗۡۢۥۦۢ۟۬";
                                            while (true) {
                                                switch (str19.hashCode() ^ 444360296) {
                                                    case -1693469485:
                                                        str19 = "ۘۨۘۢۜۖۖ۟ۤ۟ۧ۫ۘۧۛ۟ۖۘۚۦۡۗۗۜۛۡۨ۬۫۫۠ۤۨۘۛ۠۟ۘۚ۟ۡ۫ۦۧۛۥۘۥ۟ۨۘۛ۠۫ۨۤ۬ۜۨۥۘۤۡۥۗۢۙۚۗۤۚۛۥ۫ۦۥۘ";
                                                        break;
                                                    case -1245553624:
                                                        str18 = "ۨ۠ۛۖ۫ۗۗۗۨ۫ۦ۫۟ۘۡ۠ۢۘۛۥۜۖۡۦۨۧۡۧۤۦۘ۫ۜۤۢۢ۠ۗۜ۟ۛۦۜۘۧ۠ۤ";
                                                        break;
                                                    case 1057378470:
                                                        str18 = "۬۟ۨۨۡۡۛۢۨۘ۬ۘ۠۟۫ۚ۫۟ۘۧۖۨۗۢۘۘۚۨۧۘۚۢۜۢۙۤۛۛۨۘ۬ۘۘۧ۟ۥۛۧۡۤۙۢۧۜۧۘۗۢۜ۟ۚۛۛۢۙۙۖۧۘۜۛۦۘ۬ۤۢۡۛ۫";
                                                        break;
                                                    case 1587621791:
                                                        str19 = inputStream2 != null ? "ۨ۫ۡۘۚۥۧ۬ۜۗۛ۠ۥۘۜۖۦۧۘ۟ۤۥ۠ۙ۠ۗ۟ۘ۫ۘۥۛۛۡۘۢۘۨۤۘۘۘ۬ۡ۬۬ۡۧ" : "ۚ۠ۘۨۚۥ۟ۨۧۘۥۗۡۙ۠ۘۘۨۚۙۚۚۖ۬ۗ۟ۡۜۚۤۖۧۘۗۦ۬۟ۖۥۖ۠ۘۘۡۖۖۨۙ۫۠ۚۨۘۜۖۘۚۙۥۛۗ۟ۥۤۧۡۦۨ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1864231987:
                                            str17 = "ۢ۫ۡۗۦۖۚۖۦۚۧۧۢۗۨ۟ۚۙۢۤۡۘۦۘ۫ۡۦۦۤۨۨۢۨۘۨ۠ۥۘۥۡۗۢۚۦۘۢ۠ۥ۟۫۬۬ۥۡ۟ۥۧ";
                                            break;
                                        case 2072106126:
                                            str18 = "۠ۛۥۘ۠ۛۤۗ۫ۥۘ۬ۛۢۢ۠ۥۘۛۨ۟ۜۦۖۘۥۖۧۖ۟ۧ۠ۚۜۘۚ۠ۦۜۛۙ۟ۛۤۧۢۚۖ۬ۢ۠ۦۖۘۢۘۧۘۨۙۜ۟ۜۗۧۢۢۛۨۘ";
                                            break;
                                    }
                                }
                                break;
                            case 16268053:
                                str = "۬ۜۨۘۚ۫ۘۘۖ۠ۦۖ۠ۧۗ۠۫ۥ۟ۢۜۦۘ۫ۧۥ۠ۗۤۜۜ۠ۨۤۦۤۛ۟ۖۖۛۚ۟ۙۢۥۘ";
                                continue;
                            case 1851878583:
                                str = "۟ۛۦۘۡۙۖۘۧۚۛۢ۬ۜۘ۫ۦ۬۬ۥۚۖۘۥۘ۠ۤۘۘ۫ۗ۠ۨۙۡ۠۫ۡۤۛۜۘۘ۟ۥۗۨۤۗۛۦۘۡۜۖۘۥۦۜۘۚۛۡ۫ۨۜۘۙۡۜ۫ۢۥۘ";
                                continue;
                            case 1996963791:
                                str17 = "ۢۗۥۘۨۤۡۤ۟ۧۚۡۦۗۗۥۘۚۜۘۗ۫ۦۤۥۘ۫۠ۨۢۥۡۘۚۚۨۘۢۤۗۜ۬ۛۗۥۚۘ۫ۦۦۚ۠۬۬۬ۜ۫ۦۘۤ۫ۙ۠ۤۥۘۦۗۘۘ۠۟ۢ۬۫ۤۜ۠ۦ";
                                break;
                        }
                    }
                    break;
            }
        }
    }
}
