package p001;

/* JADX INFO: renamed from: ۟.qb */
/* JADX INFO: loaded from: classes.dex */
public final class C0368qb {

    /* JADX INFO: renamed from: ۥ */
    public final String f1049;

    /* JADX INFO: renamed from: ۥ۟ */
    public final String f1050;

    /* JADX INFO: renamed from: ۥ۟۟, reason: contains not printable characters */
    public final InterfaceC0222g3<C0368qb, Boolean> f1759;

    public C0368qb(String str, InterfaceC0222g3 interfaceC0222g3) {
        "text";
        "desc";
        this.f1049 = str;
        this.f1050 = "";
        this.f1759 = interfaceC0222g3;
    }

    public final boolean equals(Object obj) {
        C0368qb c0368qb = null;
        String str = "۬ۤۦۘۗۨ۫۟۠۫ۚۙۦۙۛ۠ۘۙۜ۫ۙ۫ۨۡۧۘۦۖ۟ۥۘۚ۫ۜۧۘ۠ۙۖۚۙۘۨۨۘۜۦۚۦ۫ۦۘۚۘۦۡ۠ۖۢۥۦۛۜۘ۬ۘۛ۟ۥۘۘ۬ۥۘ۬ۗۥۘۙۧۖۗۧ۬۟۟ۥ";
        while (true) {
            switch ((((((((str.hashCode() ^ 626) ^ 687) ^ 249) ^ 632) ^ 263) ^ 1003) ^ 739) ^ (-1087093895)) {
                case -2031111054:
                    String str2 = "ۜۨ۫ۚۢۘۧۗۥۢۤۛۖۧۦۦ۬ۦۘۢۜ۫۟ۡۖۖۖۜۘ۬۠ۚ۠ۦۙۛۘۚۛ۠۬ۤۖۘۤۡۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 322913273) {
                            case -1847920513:
                                str = "ۢ۫ۘۘ۟۫ۜۙۥۧۨۥ۫ۜۨ۬ۘ۬ۦ۟ۚۘۘۙۙۘۤۥۡۥۧۤۨ۬ۙۤ۠ۚۛۥۧۨۛۜۘۨۢ۫ۜ۠ۡ۫۬ۢۧۥۥۤۡۘۗۧۜۘۚۥۨۙۧۧ۬ۦۧۛ۟۫";
                                continue;
                            case -1700566405:
                                str = "ۡ۠ۧۥۢۦۥ۫ۜۘۘۢۡۘۤۢۜۘۧۘۤۨۘۖۘ۠ۦۦۗۤۖۘ۬ۘۦۗۙۥۨ۫ۡۘۤۗۦ۠۬ۡۘۧ۬ۦ";
                                continue;
                            case 1129913990:
                                str2 = "ۡۦۘۘۢۘۨۘۢۙۘ۬۟۟ۨۗ۬ۤۚ۟۬۟۬ۤۚۚۨۘۨۛۗۘ۬ۖۗ۟ۖۘۘۗ۟ۦۖۙ۬ۧ۫";
                                break;
                            case 1684293146:
                                String str3 = "ۨ۠ۦۜۖۨۦ۟ۚۗ۟ۘۘ۟ۦۖۘۜ۬ۧۙۗۖۨۨۛۜۧۦۘۖۗۧۧۙ۫ۗۖۗۨۡۤۜ۠ۡۘۚ۠ۥۘۥۚۖۢۚۡۢۡۜۘ۟ۛۨ۬ۙ۬ۧ۫";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1004032326)) {
                                        case -1562497725:
                                            String str4 = "ۤۡۖۧۢۤۢۜۦۘۙۗۦۘۦ۬۫۫۬ۦ۬ۧۘۥۤ۫ۦ۠ۛۢۜۘۢۨۨۥ۫۠ۡ۫ۢۤ۬۟ۦۤۧۧۚۛ۟۫ۛۧۨۖۨ۬ۦ۟۠ۗ۬ۘۤۜۥۥۘ۟۬ۥۜۢۡۜۚۡۖۢۧۧۧ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 371851307) {
                                                    case -2126376441:
                                                        str4 = "ۘۜۙۗۚۖۖۧۘ۫ۙۚۗۙ۬ۙۖۗۤۛۢۚ۫ۦۚ۠ۥۜۗ۫ۘۜۢۙۨۘۘ۟ۢۜۘۙ۫ۥۦۧۡۘۦۤۨۘۘ۬ۗ۟۬ۚ";
                                                        break;
                                                    case -1107767549:
                                                        str3 = "ۨ۫ۖۡ۠ۘۢۜۜۘۨۤۖۘ۟ۘ۫ۥۤۢۦ۠ۡۘ۟ۙۦۘۥۖۨۨۘۧ۫ۤۡۖۖۜۘ۬ۤ۟ۛۛ۫ۦ۟ۘۦۙۡۘۥ۟ۚۡۦۖۘ۫۫ۘۘۙۥۜۘۖۧۧۤۖۘۡۨۛۗ۠ۚ";
                                                        break;
                                                    case -1007264500:
                                                        str4 = !(obj instanceof C0368qb) ? "۟ۢ۟ۛۖۘۘۘ۟ۖۘۦ۟ۨ۫ۗۨۘۦۚ۠ۨۢۜ۠۬ۘۘۧۛۨ۫ۘۥۢۥۘۘۢۜ۟۠ۧۨۢۢۚۚۜۘۨۡ۠ۡۨۢۨۛ۟" : "۬ۜۖۘۘۜۨۘۚۢ۫ۦۖۥۨۤۥۘ۫ۜۥۚۗۛۖ۬ۘۚۧ۠ۧۢۧۤۢۡۦۤۨۘۛۗۦۙۖ۬ۜۢۚ";
                                                        break;
                                                    case 1871440750:
                                                        str3 = "ۤۘۦۘ۫ۚۨۥ۫ۖۖۢۡۘۦۦۘۘۡۥ۠۬۠ۘۡۘ۬ۡ۠۠ۡۢۘۤۧۨۤۥۡۛۦ۟ۙۥۗۜۘۤۛۥۘۚۖۢ۠ۢۦۨۤۤۛۙۧ۬ۥۖ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 494411077:
                                            str2 = "ۛ۠ۤۖۢۥ۠ۜۛۛۤۜۘ۬ۦۘ۫۬ۦ۫ۥۙۘۥ۟ۖۥۛ۬ۖۚۦ۫ۧۤ۟ۥۤۧۖۤۗۨۘ۫ۚۨۙ۟ۗۡۜۗۦ۟ۢ۟ۢۡۘ۟ۘۙۦۨۜ";
                                            break;
                                        case 1389414169:
                                            str3 = "۬۬ۤۘۨ۟ۖۤۗ۫ۘۘۚۗۘۘۛۨ۠ۗۨۘۥۗۦۘۚۛۛۥ۟ۛۛۙ۬ۘۤۖۡۨۤۢۛۘۘۜۤۘ";
                                            break;
                                        case 2014098249:
                                            str2 = "ۚۙ۬۬۠ۤۚۚۦۗۦۙۖۡۨۤ۫ۛۜ۬ۦۘ۫ۜۘۨۗۘۘ۬۫ۜ۫ۗۢۙ۠ۚۛۥۚۖۙۘۘۖۡ۠";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -2009981103:
                    String str5 = "۟ۨۜۘۨۚ۠۫ۨ۬۫۠ۖۖۗۜۘۚۢۖۘۦۢۖۘ۬ۧۖۘۗۖۜۘۦۦ۫ۗۥۧ۬ۜۘۨۢ۟ۘۗۥۚۤۘ";
                    while (true) {
                        switch (str5.hashCode() ^ 1478644181) {
                            case -596830882:
                                str = "۟ۦۥۘۤۙۥۘ۫ۧۥۘۤ۬۟ۥ۠ۡۘۢ۬ۜۢۢۚۚ۬۟ۗۙۡۖۖ۠ۤۧۡۚۖۘۚۡۙۤۗۙ۬ۚۦۘۙۦۧۘۛۘ۠۬ۚۤۚۖۘۙۡۦۨۜۘۢۖۜۘۘۢ۫۟ۥۦۡ۫ۡۡۖۦۥ۬";
                                continue;
                            case -523232968:
                                str5 = "ۛ۬ۨۡۙۨۨۡۥۘۡۥۥۘ۫ۙۨۤۦۨۨۛۙۚۙۤ۠ۤۘۥ۠ۛ۠۠ۢۧۜۧۘۤۜۡۘۛۡۢۤۥۘۦۧۤ۬ۧۛ۠ۘۤۜۧ۟ۘۤۗۖۢۤ";
                                break;
                            case 1034335748:
                                str = "ۗۡۡۚۡۢۛۗۚۛ۫ۘۘۨ۬۟ۗۧۧۜۜۨۘۛۙۛۨ۟ۡ۬ۘۘۚۖ۫ۘۙۜۤۚۥۘۗۚۜۘۨۡۨۖۖ۠ۙۡۦۥۗ۟ۡ۠۫ۡۡۥۘۧۛۦۥ۠ۙۘ۫ۜۦۜ۠";
                                continue;
                            case 1273801374:
                                String str6 = "ۚۡ۟ۜۘۜۜۗۜۘۙۨ۬۫۬ۜۘۧۡۥۘ۬ۛۖۖۡ۟۫۫ۥۘ۟۟۬ۛۙۖۚۛۨۘۦۧ۠ۚۖۘ۟ۡۦۢۦ۟ۘۘۥ۬ۥۘۥ۟ۦۘۘۗ۬ۤۙۘۘۗ۟ۖۘۘۛۤۗۦۙۤۖ۫ۘۜۡ۬ۙ";
                                while (true) {
                                    switch (str6.hashCode() ^ 1164077336) {
                                        case -1275266465:
                                            String str7 = "ۦ۬ۨۘۧ۠ۘۚۦۘ۠ۢۘۘ۟ۘۜۛۤۦۚ۫ۨۧ۟ۡۘ۫ۘ۫ۖ۬ۛۨ۟ۥۥ۫ۡ۠ۤۖۥۘۧۘۖۘۚ۫ۧۡ۠ۖۖ۠۠";
                                            while (true) {
                                                switch (str7.hashCode() ^ 781659665) {
                                                    case -1979212545:
                                                        str7 = "ۘۙۡۥ۠ۖۘۦۦۡۗ۟ۛۢۛ۟ۤۡۘۥۛۨۨۛۙۙۥۘۙ۟ۘۛۦۤۥۦ۠ۤۖۘۦۦۡۘۥۖ۟۟ۜۡۧ۬ۥۘۧۜۚۢۨۘۖۤۗۦۙ۫";
                                                        break;
                                                    case -124980846:
                                                        str6 = "ۖۘۜۘۜ۬ۡۙۤۙۢۘۗۤۡۢ۟ۚۡۘۨۗ۟ۚۡۦۡۥۧۜۤۚۜۖۙۗۦۘۗۨۜۘۧۛۙ۠۫ۗ۬ۜۙۢۡۙۚۤۡ";
                                                        break;
                                                    case 310302125:
                                                        str6 = "ۨۜۛۦ۠ۜ۟ۦۚۖۘۥۘۨۢ۠۫ۥۘۗ۟۬ۘۡ۬ۗۜۦۘۧۘۨۘۢۦۡۡۘۖۧۡۦۘ۟ۖۜۦۗۧۢۘۚۙۦۘۥۥۧۘۧۜۖۜۘۦۘۚۥۜۨۢۖۥۖ۠ۤۗۦۘ۟ۚۤۥۚۡۘۨۨۡۘ";
                                                        break;
                                                    case 674282281:
                                                        str7 = !C0237h4.m864(this.f1049, c0368qb.f1049) ? "ۦۖۖۢۥۛۛۦ۠ۢۖۦۘ۠ۗۙۢۚۦۘ۫۫۫ۥ۠ۙ۫ۡۜ۠۫۬ۗۗۜ۫ۘۨۤۜۨۘۤۦۥ۬ۗ۬ۖۘ۠ۧۦۖۘۥۤۥ۫ۚۛۧ۟۟۟ۡ۟ۦۡۥ۟ۧۧۨ" : "ۛ۬ۘۡۛۦۥۢۛۗۡۦۤۨۙۨۗۡۗۨۖۘ۫ۨۚۘ۟ۡۘۙۦ۟ۘۤ۠۠ۡۘ۠ۧۖۘۗۡۜۦۚ۬";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 773073953:
                                            str6 = "ۧۗۨ۟ۚۜۘۥۢۡۘۛۦ۫ۥۦۗۖۧ۫۫ۖۘۖۚ۟۟ۨۘۘۡۦۥۦۚۙۥۛۥۧ۬ۙۛۧۥۘۡۥۦۘ";
                                            break;
                                        case 1404176815:
                                            str5 = "۠۫ۥۘۡۥۜۜۛۜۢۚۦ۫۫ۙۤۧۥۖۘۜۘ۫ۤۜ۠ۜۤۜۢ۠۫ۦۨۘۥۙۢ۟ۧۘۖۥۡ۬ۤۢۙۚۚۖۦۛۢۥۨۘ";
                                            break;
                                        case 1795626631:
                                            str5 = "ۡۙۡۘ۠۫ۢۢ۟۬ۧۛۗۙۧ۫ۧۗۨۛۘ۫ۧ۠ۥۘۢۨ۠ۨۤ۟ۢۙۖ۫ۘۦۘۜۤۖۗۦۘۨۛۥۘۖۖۗۘۧ۫ۜۦۦۢۖۘۨۜۦۘ۟ۧۤۨۘۨۘۚۘۘۘۦۧ۫ۘ۟ۥۛۛۜۘ۠ۧ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -1962799225:
                    String str8 = "ۘۢۖۘۗۢۨۘۢۧۦۚ۠ۦۘ۬ۧۖۘ۟ۡۘۘۨۧۗۜۘۦۘ۬ۖۨ۠۬ۙۛۥۧۘۖ۠ۤۚۢۘۘ۫ۜ۠ۙۨۢۦۖۙۥۙۧ۟ۜۘۡ۟ۜۘۡۥۦۖ۫ۜۢۧۦۘۡۗۡۘۦۜۖۘۨۦۥۘO۬ۜۡ";
                    while (true) {
                        switch (str8.hashCode() ^ (-995589466)) {
                            case -1878812418:
                                String str9 = "۠ۚۧۧۚ۫ۨۛۗۙۡۥۗۢۨۙۨۧۖۛۙۧۛۡۙۦ۬۠۟ۧۛۘ۠ۚ۠۠ۘۘۛۤ۫ۤۡۖۨۙۖۘ۟ۧۜۦۖۖۘ۬ۡۦۘۧۘۦۘ۠ۢۜۘ";
                                while (true) {
                                    switch (str9.hashCode() ^ 1441773128) {
                                        case -1650122295:
                                            str9 = "ۧۢۨۘۘۛۦۜ۟ۥۥ۬ۥۘۚۛۧۛ۬ۥ۫ۗۥۘۨۧۤۚ۫ۦۛۡ۬ۦۚۦۘۡۘ۬۟ۢۢ۬ۘ۠ۖۚۦۘۢۦۘۘ۠ۜۘۘۨۢۙۨ۬ۢ۫ۧۗۦۖۥۘ۬۬۫ۗ۫ۦ۠ۘۦۗ۬۟ۥۘۖۨۢۘ";
                                            break;
                                        case -525729748:
                                            str8 = "ۡ۫ۢۤۜۘۨۙۨۘۢ۬ۗ۬ۖ۟ۙۛ۟ۛۖۘۦۙۜ۬ۨ۟ۘۡۚۨۦۛ۬ۙۙۖۧۘۙ۟ۖۥۧۜۘ";
                                            break;
                                        case 1240152800:
                                            str8 = "۠ۖۧۘۙۡۖۨۢۨۖ۬ۡۘۡۡ۟ۤۢۜۘۧۛ۠ۜۙۖۘۜۖۙۗۥۖۘۗۜ۠ۡۚۜۦۧۖۘۡۧۛۚۨ۠۫۟ۢۘۦ۠ۢۘۥ۫ۨۘ۟ۖ۠ۡۧ۠ۙۛۦۚ۠ۧۦۙۜۘ";
                                            break;
                                        case 2021741892:
                                            String str10 = "ۧۦۧۘۤۤ۠ۥۨۧۨۗۘۢ۠ۡۘۨۨۧۢۤۜۛۛۡۘ۟۠ۨۘۤ۟ۢۢۛ۫ۙۢۘۘۧۜۨۗۧۖۘ۟ۢ۠";
                                            while (true) {
                                                switch (str10.hashCode() ^ (-985306529)) {
                                                    case -1161400371:
                                                        str10 = "ۖۦۘۘۛۤۥۘ۫ۚۖۦۡۖۘۚۘۧۘۤۨۡۙ۬ۥۘۢۨۥۦ۠ۜۢۦۘۘ۟ۗۘۛۙۧ۬ۤۨۡۥۧۜۙ۟ۜ۟ۘۘۗۖۘۤۨۖۘ";
                                                        break;
                                                    case 234978758:
                                                        str9 = "۬ۖۥۘۗۙۧ۬ۦۥۘ۟۬ۥۥۚۧۙۜۖۘۤۧۢ۫۬ۢۡۦۘۢۥۤۢۦۤۚۥۘۘۤ۫ۥۘۗ۟ۦۘۜۥۥۘۛ۫ۗۢۢۧۤۖۤۨۙۙۖۨۨ۠ۘۡۧۗۤۜۨۨۘۚۖۚ۟ۤۖۤۘۘ";
                                                        break;
                                                    case 399518894:
                                                        str10 = !C0237h4.m864(this.f1759, c0368qb.f1759) ? "۟۟ۘ۫ۨ۠۠۠ۥۖۖۖۛ۠ۡۧۜۗۢۚۖۜۛۧۖۤ۟ۥۢۙۙۜۖۚۢۦۘ۫ۖۥۘۤۚۦۨۜۡۛۦۛۙۜۦۘ۟ۧۛۗ۫ۜۘۡۡۧۘۦۨۜ۫ۛۤۥۢ۫ۛۧۦۘ" : "ۘۦۦ۟ۢۥۢۨۘۢ۬ۤۥۦ۟ۤۡۛ۟ۖۦۖۨۘ۫ۦۥۧۨۧۘۥۥۘۢۙۨۘۢۗ۠ۦۗۥۛۜۦۚ۟ۦۘۡۜۜۢ۠ۛۘ۫ۚۧۛۡۘۜۙۥ";
                                                        break;
                                                    case 1088111398:
                                                        str9 = "ۦ۬ۡۦۛۧۗۚۨۘۡۦۡۛ۬ۙۨۤۖۥۘۦۘ۬ۨۗ۠ۚۦۙۡۦۢۥۥ۫ۧۢۤۗۥۘ۟ۨۤۜۖۛۡۧۢۖۨۧۘۖۙۙۥ۫ۨۘۖ۟ۘۥۚۧ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case -499555080:
                                str8 = "ۨۥۜۘۡۛۘۘۜۖۧۚ۟۠۬ۨ۟ۧۖۘ۬ۤ۬ۢۛۘۘۥ۫ۡۥۗۙۤۘۥۘۛ۠ۤۥ۬ۜۘ۫ۦۛۗۥ۠ۡۜ۠۫۫۟ۙ۫۠";
                                break;
                            case 1848122:
                                str = "ۗۢ۫ۧۘۥۦۨۘۨۘۡۖ۠ۘۙۛۛۧ۟ۥۘ۠ۨۖۘ۠۟ۛۧۨۜۚۗ۬ۗۦۖۦۧۜۘۚۢۧۥۖۜ۬ۗۖۚۚۨۘۖۘۛ";
                                continue;
                            case 66860575:
                                str = "۟ۦۜۘۖۥۜۘۛ۟۠ۗۦۜۘ۫ۨۥۘۜۧۥۘۖۤۢۜۨۘۘ۬ۥۥۘۙۘۖۘۦۥۤۡ۫۫ۥۖ۠ۢ۬ۡۘۥۘۡۧ۫ۡ۠ۖۘۙ۟ۙ۠۫ۛۧۥۧۘۨۧ۟۬ۤۜ۬ۤۥۘۗۜۘۡۢۙۗۙۨۘۜۡۛ";
                                continue;
                        }
                    }
                    break;
                case -1287312138:
                    return false;
                case -1067685295:
                    str = "ۚۢۦ۬ۦۖ۫ۧ۟ۚۡ۠۫ۡ۟ۢۗ۬۬ۥۨۧۖۥ۬۫ۘۘۧۥۛۥۖۡۙۦۚۥۥۤۤۤۛ۫ۤ۫ۡۛۦۘ۬ۚۘۘ۠۫ۡۘۙۗۦۘۤۨۜۘۢۖۦۘ";
                    c0368qb = (C0368qb) obj;
                    break;
                case -929246203:
                    String str11 = "ۨۖۨۘۨۜۤ۠۫ۖ۠۟ۗۖ۫ۖۘ۫ۘۙ۟ۖۥ۬۟ۢۖۜۡۘۨۥۘۗۖۡ۫۬ۤۨۗۖۤۖۥۖ۬ۥۖۛۨۘۜۛۗۧۛ";
                    while (true) {
                        switch (str11.hashCode() ^ (-89909055)) {
                            case -1401047810:
                                str = "۬ۡۤۢۚۥۘ۬ۘۜ۫ۡۚۖۡۘۙۦۘۘۘۢۙۧۘۧۘۦۨۤۡۜۦۨۙۦۘۡۙ۬۬۠ۦۘۜۜۥۦۚ۫ۜۘۡۦۡۘ۬ۡۦۧۛۛۡۘۚۡۤۥۨۗ۫۬ۨۘۨۥۡۖ۫ۢۚۦۚۘۦۡۘ";
                                continue;
                            case 1556534906:
                                str11 = "ۥۛ۬ۦۡۛ۠ۨۤۢۥۛۢ۟۟ۧۨۤ۠ۛۧۗۘۛ۫ۥ۟ۤ۬ۡۦۧۘ۟ۤۚۙۡۗۖۧۡۘۥۖۨ۠ۚۛۛۜۡۨۗۦۙ۫ۧۗۦۥۦ۠۫ۙۚۡۘۜۛۛ۠ۘۡۢۚۨۡۧۘۥۥۥ";
                                break;
                            case 1714080840:
                                str = "ۙۦۧۘۙ۟ۥۘۚۥۙۦۚۛۗۜۦۘ۬ۦۤ۠۬ۥۛ۠ۛۦۗۖۘۘۜ۟ۢۗۦ۠ۦۙۛۜۛ۬ۘۦۗۡۡۧۙۡۙۖۛ۫ۜۙۖۜ۬ۤۡ۠۫ۥۘۦۦ۫ۤۥۙۚ۠۠";
                                continue;
                            case 1768617789:
                                String str12 = "ۡۜۨۘۤۦۚۘۛۨ۫ۥۙۛۜۨۖۧ۬ۨ۠ۜۘۡۢۦۘۜ۟ۤۤ۬ۖۗۤۨۧۢۗۧۛۛۡ۠ۘ۠ۥۘ۬ۖۧۘ۫ۡۡۘ۟۠ۙ";
                                while (true) {
                                    switch (str12.hashCode() ^ 123792807) {
                                        case -1834701435:
                                            str11 = "۬ۘۤۛۨ۬۬ۨۖۘۢۨۗۢۡۘۥۢۨۡۙۡۙۘۦ۬ۚۤۡ۠ۥۦۚۤۙۤ۟۬ۡ۫ۜۡۘۦۢۚۙۥۜۜۧۖۘۥۜۡ۟ۛۡۘۗ۟ۡۘ۠۫ۜۙۨۥۘۡۚ۠ۚۦۥۥۗۖۛۤۨۤۘۡۘ";
                                            break;
                                        case -826824225:
                                            str12 = "ۚۢۛۤۗۧ۫ۤۖۘۤ۠ۥۜۚۤۛۖۘۢ۟ۜۘۙۛۜۘۥ۬۠ۤ۬ۚۧ۬ۘۜۜۖۘۚ۟ۘۤۗ۟ۜۘۘ";
                                            break;
                                        case -203373871:
                                            str11 = "ۧ۫ۙۤ۠ۜۘ۠ۤۘۡۛۜۘۙۥۡ۟ۨۡۨۨ۬ۙۡۙۖۘۢۛۦۡۥۧۖ۟ۡۙۘۨۘۗ۠ۨ۟ۚۙ";
                                            break;
                                        case 917814904:
                                            String str13 = "ۢ۫ۤۛۢۧ۫ۘۘۘۦۨۢ۟ۤۜۡۢۚۥۢۖۢۡۡۤۦۨ۫ۤ۟ۢ۬۠۟ۘۘۨۗۢ۟ۦ۫ۘۘۘ۠ۚۖۨۥۘۗ۟ۚ";
                                            while (true) {
                                                switch (str13.hashCode() ^ 922838005) {
                                                    case -1911713669:
                                                        str13 = this == obj ? "ۧۗ۬ۢۡۨۘۖ۟۟ۗۧۥۘۥ۫۬ۢ۬ۜۘۧۦۥۘۜۢۡۚ۫ۥۘۚۙۨۨۜ۬ۜۚۖۘ۬ۜۘۘۛ۫ۦۡۧ۠ۛۘ۬ۤۧۗۚۡۘۤ۟ۨ۬ۢۖۘۙۗۨ۫۫ۜۘ۠ۖۥۘ۬ۖۙ" : "ۨۡۥۘۙ۠ۛۢ۬ۘۦۦ۠ۢۛ۠ۢۘۘ۫ۙۡۘۡۨۗۤۨۗۡۦ۬ۚۦۘۢۗۥۖۤۧۦۥۡۙۖ۬";
                                                        break;
                                                    case -1852776130:
                                                        str13 = "ۤۛۤۧۦۥۗۜۦۘۘۖۥۗۡۧۥۛۖۘۤۗۨۘۘۘۘۢ۠ۦۦ۫۠ۚۘۡۨ۫ۖۘۛۘۤۥۧ۫ۖۚۘۛۘۤۢ۬۠ۥ۫ۗ۬ۖ۟ۢ۠ۦ۠ۧۚۦۗۘۘۤ۬ۧۙۖۛ۫ۢۦۘۤۖۥ۠ۗ۠";
                                                        break;
                                                    case -875277491:
                                                        str12 = "ۙۧۨۛۢۦۘۧ۟ۛۛۘۖ۟۠ۜۘۜۥۗۖۛ۟۟ۤۡۘۜۦۡ۬ۙۗۛۚ۫ۨۗۙۨ۬ۚۙۧۛۡۚ۬۠۠ۛۛۡۚۚۨۦۘ";
                                                        break;
                                                    case 257240052:
                                                        str12 = "۬ۤۨ۠۠ۤۙۥۘۘ۠ۢۤۗۧۚۨۧۢۤۢ۟ۖۦۦ۠ۙۖۡۛ۠ۡۘۘۥۗۚۖۗۗۡۖۘۢ۫ۛۧۛۘۖۜۥۗۙۘۘۗۗۜۖۚ۠ۤۜۘۙ۫ۗ۠ۙۙۨۗۗۙ۠ۜۘۧۚۡۘ۟ۡۖ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -658984146:
                    str = "ۢۙۥۘۢ۬ۛۛ۬ۧۧۙۡۗ۟ۜۘۚۨۜۘۚ۬۫۠ۢۨ۟ۗۥۘۗۢۥۧ۟ۧۛۥۖۘۙۦۢۢۢۡ۫۬۫ۜۘۤۙۛۖۦۥۖۡۘ۫ۖۙۤۛۧ۬ۙۨۘۘۨۥۚۖۧۘ۠ۦۨۘ۟ۖۡۘۙۦۤ";
                    break;
                case -374028665:
                    return true;
                case -43467195:
                    return false;
                case 125678140:
                    return false;
                case 602161672:
                    return true;
                case 908968341:
                    return false;
                case 1502834577:
                    str = "۬۫ۘۢۖ۟ۚۧۗۧۖۘۜۦۥۢۙۥۖۘۡۘۛۚ۫ۛۙ۠ۥۨۦۖ۟ۘۘۡۤ۠ۧۤۘۧ۠ۨۘۚۥۚۚۛۖۤۦۡۦۚۤ۠ۗ۫۬ۘۙ۬ۥۘ";
                    break;
                case 1993294315:
                    String str14 = "ۖۙۘۖۥۡۘۧۡۨۦۗۦۘۘۗۨ۫ۢۦۚۙۗۚۚۡ۠ۥۤۦۥۘۦۘۛ۠ۘۧۥۢۨۘۙۦۜ۟ۨۥۘۥۧۗۖۡۦۘ۫ۧۡۘ";
                    while (true) {
                        switch (str14.hashCode() ^ (-1175705333)) {
                            case -1465630900:
                                str = "۬۬ۥ۠ۡۨۘ۬۬۬ۙۥۖۗۚ۬ۗۡ۟ۖ۟ۤۗۦۘۨ۟ۡۨۙۡ۫۫ۦۖۜۖۘ۬۠ۦۘۥ۠ۗۢۧۦۘۜۛۨۘۢۙۡۧۡۡۘۜۤۗۦ۠ۖ۫ۙۢۛ۠ۡۖۙۥۜۤ";
                                continue;
                            case -491993305:
                                String str15 = "۠ۜ۬ۡۢۛۚۨۘ۠ۦۨۙ۫ۚۤۜ۫ۢۤۨۨۢۖۘۡۤۖ۬ۜۖۘۛۤ۟ۖۧ۬ۦۤۜۜ۠ۢۜ۬۟ۙۥۧۘۗۗۡ۟ۦۘۜۜۚۘۙۥ۬ۘۜ۬۫۟ۧۛۜۘۦۚۘۘۥۡۘۘۤۨ۠";
                                while (true) {
                                    switch (str15.hashCode() ^ (-2096588933)) {
                                        case -1803038348:
                                            str14 = "۠۟ۧۚۗۘ۬ۗۘ۫۫ۧۤ۟۫ۘۘۘۦۘ۠۬ۦۢۥ۬ۙۘۡ۟ۧۧۢ۬ۖۘۨۜ۠ۜ۟ۧۛۛۜۘۖۥۘۛۧۡۢۤۜۘ۬ۦۛۧۢ۟ۤۢۢ۬ۗۡۘۢۢ۟ۥ۫ۚۖۧۧۚۖۧۦۧ۬";
                                            break;
                                        case -1131420026:
                                            str15 = "ۨ۠ۡۘۙۦۦ۟ۚۡۥۥۦۘۦۜۚۚۛۘۘۤۖۚۡۨۥۘۛۡ۫ۤۗۨۘ۟ۛ۠ۢۛ۠ۗۤۗۚۥۥۖۛۙۗۙۦۘ۠ۘ۠۟ۚ۬ۨۙۛ۟ۦۜۙۡۘۗۡۜۘۖ۠ۖۘ۫ۦۘۙۨۗۡۗۖۘۚۚۨ";
                                            break;
                                        case -604733183:
                                            str14 = "ۖۧۖۛۘۙۘۛۥۘۗۛۡۘۨۨۢۧۙۨۤ۫۫ۤۘ۠ۛۚۥۘۥۙۤۨۗۗ۬ۥۦۘۢۜۖۘ۬۫ۜۥۘۖۘۡۦۙۗۢ۠ۘۧ۫ۦۡۙۖ۠ۖۖۙۘ";
                                            break;
                                        case 460883744:
                                            String str16 = "۟ۚۦۡۤۤۨۛۤ۫۬ۙۙۧۘۘۨۛۤۛ۬ۖۛۥۘۘۜۚۥۘۨۜۢۜۡۗ۫۫ۥۘۢ۬۠ۖۚ۫ۙۚۚۢ۟ۖۘۖ۟ۜۨۙۖۘ";
                                            while (true) {
                                                switch (str16.hashCode() ^ 1339392228) {
                                                    case 137777354:
                                                        str15 = "۫۬ۗۢۥۗۛ۠ۖۘۘ۫ۛۗۛۡۘۙۗۙۘۨۧۥۢۙۥۜۖۘۚ۟ۥۘۙ۬۬ۤۖۢ۠ۡۛۙۦ۟ۜۡۘۘۖۥۘ۫ۜۨۘۤ۫ۖۘۨۗۤ۟ۨ۟۬ۜ";
                                                        break;
                                                    case 703849204:
                                                        str16 = !C0237h4.m864(this.f1050, c0368qb.f1050) ? "۫ۨۦۘۜ۟۫ۘ۫ۖۘۖۧۖۘۧ۬ۦ۬ۧۜۤ۠ۤ۠ۢۧۗۜۜۘۜۖۗۨ۠۬ۨ۬ۨۘۡ۠ۦۚۧۘۘۨۚۨۡۡۘۚۢۢۡۚۖۢ۠۠ۚۘۢۡ۟ۧ" : "ۦۦۡۘ۫ۗۖۧۖۖۗۛ۬ۥۜ۟ۜ۫ۥۘۚۙۚۛۛۘۙۡۜ۟ۤۙۖۛۖۘ۟ۥۥۛۙ۬ۖۧۘۘۜ۫ۧۙۤ۬ۢۡۘۚۛ";
                                                        break;
                                                    case 744990236:
                                                        str16 = "ۗۧۡۘۡ۟۟ۚ۠ۡۡۘ۬ۙۨۜۦۦ۠ۗ۫۫ۙۜۢۜۧ۠ۡ۬ۥۙ۫ۜۨ۠۠ۨۧۘۤۢ۫ۛۥۙ۬ۜۢۤۧۧۚۦۖۘۗۡۦۘ۫ۤۥۘۘۥۨۘ";
                                                        break;
                                                    case 1253439379:
                                                        str15 = "ۧۥۜ۠ۥۘۘۖۚۜۗۘۜ۠ۘۥ۠ۖۘۘۗۦ۬ۡۦ۟۠ۨ۟ۢۚ۠۟۫۫ۘ۫ۙۡ۬ۜ۠ۨۘ۫";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case -268508350:
                                str = "ۘۚۦۤۦۥۘۤۥ۠۬۠ۧ۟۟ۚۡۥۖۘۢۗ۠ۚۛۥۘۢ۫ۘۘۡۙ۟ۙۛۦۘۗۙۢۙۢۙۤۗ۟ۖۘۘۨۢۙۥۘۡۘۚ۬ۗۛۦۢۦۤۦۡ۬ۜۥۖۜ۬۠ۧۙۚ";
                                continue;
                            case 899761296:
                                str14 = "۟ۘۜۤۛۤۨۛ۫ۛۥۚ۫۫۬ۨۜۧۘ۠ۨۘۢۗۦۧۖ۬ۖۧۘۧ۬ۦۘۙۧۜۘۘ۠ۘۘۗۢۜۜۖۙ۬ۙ۫۬ۥۖۘۙۤۚ";
                                break;
                        }
                    }
                    break;
            }
        }
    }

    public final int hashCode() {
        InterfaceC0222g3<C0368qb, Boolean> interfaceC0222g3 = null;
        String str = "ۘۗۡۘ۠ۗۜ۫ۡۨۘۜۧۥۡۛۡۧۜۜۘ۬ۘۥۘۛۜۖۨۗۚۚۥۖۘۤۤ۟ۘۧ۫ۖۗۛۙۜۜۘۢۧۨۘۘۛۡۘۘۤ۬ۦۖۘۘۜۙۚۨۢۜۘ۟ۘۦ";
        int iHashCode = 0;
        int i = 0;
        int iHashCode2 = 0;
        int iHashCode3 = 0;
        while (true) {
            switch ((((((((str.hashCode() ^ 775) ^ 230) ^ 754) ^ 6) ^ 475) ^ 40) ^ 732) ^ 864259584) {
                case -1874887688:
                    return (((iHashCode3 * 31) + iHashCode2) * 31) + i;
                case -1637740340:
                    String str2 = "ۢۗۗ۟ۦۜۘۥۙۜ۬ۦۨۘ۟ۜۥۚۤۖ۫ۡۘ۬ۜ۫ۢ۠ۡۢۥ۬۬ۡۘۧۖۦۜۤۖۗۦ۠ۥۘۜۤ۫ۗۖۚۘ۟ۘۖ۬ۖۘۦۜۡۛۙۨۘۙ۟ۘ۟ۥ۫۟ۜۚ";
                    while (true) {
                        switch (str2.hashCode() ^ (-809521395)) {
                            case -1689727410:
                                str = "ۘۖ۬۫ۘۨۘ۟۬ۜۚ۬ۨۜۨۢۥۛۘۘ۟ۨۚۗۙۗۛۜۙۧۛ۠ۡۢۥۘۧۢۖۘۡۜۦۘۖۚۥۘۤ۬ۦۨۜۥۘ۠۬ۦ۫ۚۡۘۥۦۜ۟ۗۦۤۦ۠ۙۚۤۗۗۙۛۤۥ";
                                continue;
                            case -1617874976:
                                str2 = "ۤ۫ۤۦ۬۟ۨۙۜۘۥۜۢۥ۠ۢۢ۫ۥۗ۠ۜۙۧۚۢۘۘۘۢۨۨ۟ۡۨۦۧۘۢۘۡۗ۟ۥ۬۠ۙۚۚ۫ۥۜۖۘۘۛ۠ۚ۟۫ۜۡۤۤۗۢ";
                                break;
                            case 830646213:
                                String str3 = "ۡ۠ۜۘۦۗۤۙۖۨۦۘۘۘۜ۠ۦۘۙۧۘۘۤ۫۫ۛۚۡۘ۬ۡۚۙ۟۟ۥۙۗۥۚۥ۬۠۟ۜ۬ۜۘۦۤ۬ۡۛۗۥۙۨۘۦۤۖۦ۟ۥۘۥۙۨۘۢ۫";
                                while (true) {
                                    switch (str3.hashCode() ^ (-630686384)) {
                                        case -711401949:
                                            str2 = "۟ۚۘۘۨۖۜۘۙۦ۬ۥ۠ۖۗۗۙۛۙ۫ۥۗۦۛۘۥۗۙۘ۬۫ۖۘۨۦۡۘۘۢۘۘۛۢۖۘۛۘۖۢ۬۬ۗۗۜۘۥۚ۟ۙ۠ۖۘۛۤۗۦۚۥۛۘۥ";
                                            break;
                                        case -700385111:
                                            String str4 = "ۚۜۧۘۢ۠ۥ۫ۦۜۜ۫ۙۢۜ۬ۛۚ۬ۘ۫ۧۤۦ۠ۛۙ۬۟ۚ۬ۤ۟ۦۗۡۢۢۨۘ۫۠ۨۘۘۘۢۧۨۢ۟ۘۨۗۧ۠ۘۦۦ۫ۘۘۨۚۙۤ۟ۛۛۘۜۚ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-998635513)) {
                                                    case -567872981:
                                                        str4 = interfaceC0222g3 == null ? "ۗۖۨۙ۟۟۠ۛۖۘ۟ۙ۟ۨ۫۠ۤۙۖۘ۟ۘۨۘۥۘۨۙۙۥۙ۠ۙۨۗ۠ۥۤۢۡ۫ۘ۫ۗۧ۟ۥ۫ۖۡۘۘۥۚۘۥۤۜ۫ۜۛۥ۟ۜۤۡۘۜۥۦۖۤۨۘۢۥۛۘۙۖۨۘ۫ۧۨ" : "ۡۥۙۥۚ۫ۦۗۦۘۗۡۛۥۘۥ۠ۨ۠۟ۘ۠ۦۥۘۧۗۜۘۨ۟ۘ۫ۨۗۚ۟۬ۦ۬ۥۙۜۧۘۙۡۗۙۨۙۗۨ۬ۧ۫ۘ";
                                                        break;
                                                    case 983213118:
                                                        str4 = "ۖۗۘۘ۫۟ۤۛۢۢ۠ۙ۬ۚۚۙۢ۟ۜۦۙۡۙۧ۫۠ۖۨۤۡ۠ۙۗۖۖۚۘ۫۫ۦۘۛۜۘۥۚۨۘۜۘ۬ۢۦۨۘۡۥ۠ۜۜۤۨۢۜۧۤۡۛۘۙ۠ۤۦۖۦ۬";
                                                        break;
                                                    case 1725654573:
                                                        str3 = "ۥۛۖۦۜۦۘۧ۟ۥۜ۫۬ۘۦۖۨۨۡۚۚۖ۟۫ۥۖۙۨۖۗۨۦۜۗۘۛۢۦۚۨۚۚۥ۠۫۫ۛۛۘۗۜۨۧۗۤۦۢۡۡۙۢۧۡۙ۟ۘ۬ۨۗ۟ۖۦ۟۠ۥۚۥۧۘۜۛ";
                                                        break;
                                                    case 1729784846:
                                                        str3 = "ۤ۟۟ۦۦۚۡۨۡۤ۟۠۫ۥۗۨۢۗۖۤۢ۬ۦۧۡۡۧۘۙ۠ۜۦۖۧ۠ۢۖۘۤۡۤ۫ۦ۬ۖۢ۠ۢۥۨۡ۫ۧۛۢۜ۬ۤۥۘۙ۟۠ۛۤ۠ۤۛۧۧۥۚۦۛ۠";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -643618077:
                                            str3 = "ۨۢۗ۬۟ۥ۟ۡۧۜ۠ۖۘۜۜۛۢۨۥۘۤۢۥۛۧۖۘۢ۬ۨ۠ۧ۬ۚۛۦۘۤۥۦۘۘۚۛۥ۫ۜۘۢۜۧۘۥۜۜۘۧۧ۫ۨ۬ۡۘۦۗۤۡۢۚ۬ۖۦۘ";
                                            break;
                                        case -124365034:
                                            str2 = "ۦۘۧۘ۬ۜۤۚۦ۠ۙ۫ۤ۟ۢۘۘۨ۠ۦۘۡۤۤۢۢۦۦۘۧۘ۠ۗۥۙۢۨۘۗۨ۬ۗۤۗ۟۫ۖۘۨۨ۟ۛ۫ۦۤ۫۬ۡۖ۟ۦۥۡۨۛۜۜۜۜۥۛۜۨۘۚ۟ۥ";
                                            break;
                                    }
                                }
                                break;
                            case 1619080922:
                                str = "۠ۧۘ۠ۧۨۧۨۡ۟ۜۥۖۘۜۘ۬ۜۡ۟ۧۙ۠ۗۥۦۧۧ۬ۨۡۤۤۜۘۥۧۦ۠ۧۘۘۚۤۨۘۙۖۦۦ۫ۙۜۗۜۨۘۖ۟ۦۘ۬ۗۢۦۜۤۧ۫ۗۖ۟ۡۘ۫ۥ۬ۘۛۤۜۖۜ۠ۨۖۘ";
                                continue;
                        }
                    }
                    break;
                case -1485851130:
                    str = "ۖۤۤۧۥۡۘۛ۬ۡۘۘۨ۫ۚۗۗ۠ۢۥۘ۬ۡ۫ۧۨۜۘ۠۟ۜۘۖ۫ۛ۬۬ۙ۬ۚۙۧ۟ۜۘۨۘۧۘۧۚۛۡۧۥۘۢۘۨۨ۫۫ۘۘۜۢۙۥۛۨۘ۟ۢۨۘۦۦۢۜۗ";
                    i = iHashCode;
                    break;
                case -1302503298:
                    iHashCode3 = this.f1049.hashCode();
                    str = "ۡۚۙۗۨۘ۫ۥۧ۫ۙۤۖ۫ۥۘ۫ۦۦۘۙۥۥۘۧۙۢۡۛ۟ۖۗۙ۠ۙۖۧۡۙۛۛۢۛۤۢۡۜۘ";
                    break;
                case -1239946198:
                    interfaceC0222g3 = this.f1759;
                    str = "ۚ۠ۘۘۨۜۖ۠ۥۘ۠۟ۗۡۡۖۘۨۤۤۘۙۜۘۗ۟ۥۘۘۘۡۚۚۢۥۘۘ۫ۖۡۘۛۧۥۘۛۖۜ۠ۚۧۘۡۙۛۜ۠ۢۙۡۘۘۗۨ۟۬ۖ۠ۛ۫۫ۗۦۘۗ۟ۗۡۘ۟";
                    break;
                case -655278902:
                    str = "ۖۘ۠ۜ۫ۙۢۤ۠ۛۛۙ۟ۛۨۤ۟ۘۜۚ۟ۢۨۡۢۦۦۘۘۧۜۡۡۧۘۗ۠۠ۢۤۗۗۢ۠ۥۧ۠ۧ۟ۧۤۦۦۘۨۦ۟۬ۥۙۧۜۨۘۢۨۨۧ۬ۡۗۨۡۤۥ۫ۖ۟ۙ۬ۙۙ۠ۧۥ";
                    break;
                case -548155417:
                    iHashCode = interfaceC0222g3.hashCode();
                    str = "۠ۘۢۥ۬ۢ۟۠ۛۗۤۨۘۡ۫ۥۘۧۗۥۘ۫ۜۗ۫ۦۘ۟ۥۨۦۤۥۘۦۦۡ۟ۡۘۢۜۙۨۤۧۧ۬ۘۘ";
                    break;
                case -391791489:
                    iHashCode2 = this.f1050.hashCode();
                    str = "۟ۚۡۘ۬ۜۨۙۨ۬ۘۦۚۙۚۦۦۛ۫۠ۜۧۘ۠ۜ۠ۘ۬ۜۚ۟ۖۚ۬۟ۛۡۘۢۛۘۗۘۨۘۤۚۙۘۗۡۤۦۨۘۛ۟ۖ";
                    break;
                case 3432414:
                    str = "ۗۙۙۚ۫ۘۗۥۧۙۖۘۧۙ۫ۗۡۖۙ۠ۙۛ۬ۤۨۨۨۘۙۖ۬۠ۦۜۚ۫ۦۘۤۡۙۢ۬۠۫ۡۖۘ۫ۗۖۘۢ۬ۘۘۡۡۡۦۙۡۘۧۨۡۘۨۘ۠ۤۖۢ۫ۦۘۘۗۢ۟";
                    i = 0;
                    break;
                case 1358558414:
                    str = "ۨۥۜۥۖۗۢ۟۫ۙۤۨۘۘ۟ۤ۬ۙۙۜۘۘۘۢۘ۟ۡۖۜۗ۬ۨۨۢۦۧۘۜ۠ۨۘ۟ۦۜۚ۠ۥۘۘۦۦۚۡۧ۬۠ۡۘۜۡۡۘۤۘۦۘ۫ۡۡۘۘۚۖۗۖۡۛۦۤ";
                    break;
                case 2022910650:
                    str = "ۖۤۤۧۥۡۘۛ۬ۡۘۘۨ۫ۚۗۗ۠ۢۥۘ۬ۡ۫ۧۨۜۘ۠۟ۜۘۖ۫ۛ۬۬ۙ۬ۚۙۧ۟ۜۘۨۘۧۘۧۚۛۡۧۥۘۢۘۨۨ۫۫ۘۘۜۢۙۥۛۨۘ۟ۢۨۘۦۦۢۜۗ";
                    break;
            }
        }
    }

    public final String toString() {
        String str = "ۖۙۥۗ۠ۨۘۦ۠ۖۘ۬ۘۡۘۖۘ۫۟ۚ۟ۚۤۥۘۨۚۢۜ۬ۦۘ۬ۛۜۘ۬ۘۧۘۥۗۙۜ۠ۨۘۡۢۡۥۖۙۦۡ۟ۧۛ۟ۧ۫ۚۡۛۚۚۡۘۦۖ۟";
        while (true) {
            switch ((((((((str.hashCode() ^ 411) ^ 318) ^ 990) ^ 176) ^ 870) ^ 249) ^ 673) ^ 1056392474) {
                case -200247227:
                    str = "ۜۥ۫ۡۘۢۡۖۢ۬ۘۢۖۥ۟۠۟ۛۗۜۘۤۜۘۙۗۗ۠ۦۧۘۖۨۧۘۤ۟ۥۦۜۗۦ۠۬ۦۙۖ۟ۙۜۘۚۖۙۧۙۖۘ";
                    break;
                case 61922180:
                    return super.toString();
            }
        }
    }
}
