package p001;

/* JADX INFO: renamed from: ۟.q5 */
/* JADX INFO: loaded from: classes.dex */
public final class C0362q5 extends AbstractC0176d<String> {

    /* JADX INFO: renamed from: ۥ */
    public final C0375r5 f1043;

    public C0362q5(C0375r5 c0375r5) {
        this.f1043 = c0375r5;
    }

    @Override // p001.AbstractC0162c, java.util.Collection
    public final /* bridge */ boolean contains(Object obj) {
        String str = "ۥ۬۟ۚۙۡ۫ۧۡۧۖۡۘ۟ۧۥۢۗ۠ۧۤۚۤۢۗۖۖۡۖۛۡۘۦۥۥۘۨۖۤۤ۟ۖۘۡۜۜۚۘۚ۠ۙۡۘۢۚۡۘۦ۫۠";
        while (true) {
            switch ((((((((str.hashCode() ^ 630) ^ 723) ^ 527) ^ 156) ^ 0) ^ 931) ^ 548) ^ (-728654735)) {
                case -1914753141:
                    return super.contains((String) obj);
                case -779587970:
                    return false;
                case 1751363258:
                    String str2 = "ۡۦ۬ۚۘۨۘ۬ۜۤ۟ۚۦۥۨۡۙۖۢۖۙۨ۟ۡۗ۟۠۬ۖ۬ۢ۟ۨۢۚۘۚ۠ۤۨۜ۠ۨۘۙ۫ۖۘۦۘۡۨۙ۠ۤۦۘۛۡۜۘۚۛۛۥ۟ۤۧۜۜۨۙۘۘۨۢۜۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 174904239) {
                            case -2029563324:
                                String str3 = "ۙۗۤۚ۟۟ۙۤۜۘۛۗۚۤۧۢۡ۠ۥۨۖۢۙۛۚۢۦ۟ۦۗۛۗۗ۟ۡۧۢۨۘۡۧۡۡۤۨۜ۠ۜ۬ۡۧ۫۠ۢۦۦۦ۬ۜۘۤ۟ۦۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-8217765)) {
                                        case -1355618315:
                                            String str4 = "ۦۤۛۗۢۥۘۖۘۜۙۨۛۚ۬ۜۢۛۡۖ۟ۦۘۜۙۚۤۖۙۙۡۗۗۗۙۡ۟ۥۘ۟ۖۦۙ۬ۖۘ۬۬۟";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1205887405)) {
                                                    case -1464672915:
                                                        str3 = "ۢ۬ۖۨۥۛۙۚ۫۬۬ۢۧۛۘۘۛۛۜۘۧۜ۬ۢۙۖۖۧۘۘۙۗۥۘ۫ۙۥۘۙۡۨۦ۫ۢۡۗۡۛۛ۫۟ۙۥۘ۫ۨۤ۟ۘ۬";
                                                        break;
                                                    case -35855896:
                                                        str4 = "ۥۡۥۨ۠ۢ۟ۧۘۨۦۗۚ۬ۦ۠ۥۜ۫ۛۖۘۡۨۚ۫ۢ۫ۡ۟۬ۤۘۙۤۛۘ۫۟ۡۘۢۦۧۘۧۜۨۘ";
                                                        break;
                                                    case 1658486588:
                                                        str3 = "۟۫ۖۖۨۘ۬ۧ۬ۘۗۘۘۗۥۙ۫۟ۜۥۥۛۙۛۜۢۨۛۙۛۥۡۥۘۗۚۛۖۥ۫ۘۧ۫ۖۘۖ۫۟ۖ۬ۡ۬ۜ";
                                                        break;
                                                    case 2021092725:
                                                        str4 = !(obj instanceof String) ? "۬ۛ۟ۥ۫ۨۥۘۘۛۚۛۡۜۨۧۦۤۥۛ۬۠ۢۘ۬ۚۨ۠۬ۜ۬ۜۦ۠ۙ۫ۘۥۙۡۖۘۦۥۤ" : "ۗۜ۠ۗۗ۟ۖۚۨۚۥۥۘۖۨۘۨۢۥۘۜۤۡۚۢۦۘ۠۬۟ۢۜۦۡۥۡۘۤۙۛۨۛۚۛۧۖۢۨۛ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -1292290560:
                                            str2 = "ۘۥۘۧۧۜۘۘۚۚۡۜۚۤ۟ۡۙۖۘ۬ۥۜۘۛۜۜۦۗۗۜ۫ۥۘۢ۬ۜ۫ۜ۬ۜۜۧۧۢۘۘۢ۟ۥۘ۫ۡۨۥۖ۫ۡۖۨۘ";
                                            break;
                                        case -746275298:
                                            str2 = "ۨ۟ۧۛ۫ۜۘۧ۠ۥۘۢۧۜۛۢۥۘۗۖۘۤۧۡۘۘ۬ۨۜ۟ۘۨۖۡ۫ۛ۬ۡۢۤ۬ۤۚ۟ۥۗۥۤۧۘۘۙ۫ۗۙۜۤۡ۬ۜۚ۠ۖۘۛۦۗۙۙۘۦۙۨ۠ۗ";
                                            break;
                                        case -584710770:
                                            str3 = "۠ۚۨۘۖۢ۠۫ۤۢ۠۠ۡۘۖۧۖۘۢ۟ۤۤۦۤۢ۬ۦۦۥۨۚۙۥۥۥۚۥ۟ۖۘۙۦۜۘۤۤۤۚۜۜۘۘۦ۫ۛۨۥۘ";
                                            break;
                                    }
                                }
                                break;
                            case 1532046590:
                                str = "ۗۖ۫ۤۘۧ۫ۦۧ۬ۥۨۙ۬ۜۤ۟ۛۚۜۢۨۢۚۨۗۜۘ۬ۡۛۡۦۗۥ۬ۡۘ۫ۜۜۥ۬ۘۘۨۗۨۘۡۖۦۘۦ۫۫۫ۧ۫";
                                continue;
                            case 1605825794:
                                str2 = "۠۬۫ۡ۬۬۬ۧۧۘۤۜۘۢ۠۬ۦۨۤۖ۠۟ۥۤۘۘ۬ۗۤ۟ۦۢۥۨۖ۬ۥۘۢۛۗۗۛۥۘۛۘۥ";
                                break;
                            case 1894897888:
                                str = "ۜ۠ۧ۫ۙۢۦۥۡۘۛۗۤۚۘۖۙۗ۬ۗۤۛۗۜۜۘۢۥۤۡۤ۫۠ۦۡۘۤۦۜۘۘۜۜۡۥۦۙ۬ۦۘ۠ۜۦۧۤۦۘۙۜۘۧۛۖۘ۟ۥۢۧ۠ۘ";
                                continue;
                        }
                    }
                    break;
                case 1993369826:
                    str = "ۡۗۘۦۢۘۘ۠ۡۘ۬۬۬ۗۢ۠ۦۙۥۘ۠ۥۦۘۛۨۧۘۢۘۖۘۤ۬ۨۘۗ۠ۚۖ۫ۥۘۙۘۥ۟۫ۡۙۨۜ۟ۨۧۘۘۦۜۘۤۧۖۘۛۡۥۖۤۨۘۘۡۦۘۨۖۡۘۛۢ۫ۜ";
                    break;
                case 2068630034:
                    str = "ۚۘۗۥۚۜۜۤۨۙۗۗۨۛۚ۠۟ۡۥۖۖۗۛ۫ۛۘ۬ۧۖۘۘۜۖۘۢۚۚۢۢۥۘۨۚۨۘ۠ۢۘۜ۟ۛۥۘۦۘۤۨ۠";
                    break;
            }
        }
    }

    @Override // p001.AbstractC0176d, java.util.List
    public final Object get(int i) {
        String str = "ۤۜۜۥۜۖۛۙ۠ۢۖۜۡۨۥ۠ۥۨۥۖ۟۠ۤۖۥۢۗۗۜۜۗۘۥۛۚ۬۠ۙ۟ۙ۟ۢۧۧۜ۬ۧۦۘۢ۬ۦۛۖۘۛۙۡۘۜۦۖۘۛۨۜۘ۬۫ۢ۬۬ۖۢۚۖۖۙۨۘۜۢۚۗۛۛ";
        String str2 = null;
        String str3 = null;
        String strGroup = null;
        while (true) {
            switch ((((((((str.hashCode() ^ 370) ^ 564) ^ 170) ^ 635) ^ 478) ^ 161) ^ 401) ^ 1991755889) {
                case -1916476556:
                    strGroup = this.f1043.f1061.group(i);
                    str = "ۦۡۗۖ۬ۙۥۗۥ۠ۤۡۜ۠ۢ۟ۢۖ۬ۚۘۧۚ۠ۛۡۘ۬ۗۢۖۘ۬ۨۛۦ۠ۛۘۙۥۘ۟۫ۘۨ۬ۥۗۨ۠ۨ۠ۚۘۥۗۢۘ۠ۙ۫ۤۢ۬ۢۙۘ۠ۗ۠ۘۖۚۥ۠ۜۢۘۖ";
                    break;
                case -1473320459:
                    String str4 = "ۛۥۖۛ۫۬ۤ۫ۡۥۙۜۦ۟ۨۘ۬ۡۨۘۚۨۜۘۗ۟ۜ۫ۖۘۘۢۥۖۖۘۨۗۚۧۨۡۘۡۧۡۨ۫ۢۗۙۦۖ۠ۦۦۨۘۘۚۜۡ۬ۜۖۦۧۘۨۥۚۤۖ۬ۥۙۦۘ";
                    while (true) {
                        switch (str4.hashCode() ^ (-1809339740)) {
                            case -2009585211:
                                str4 = "ۡۗۡۘۚۡۘۘ۠ۜۡۨ۠ۖۘۥۗۨۘۧۜ۬۫ۧۜۢۧۨۛۢۜۘۗۥۘۗۤۡۘۘ۠ۜۨۘۚۚۙۗۛ۬ۚۙۧ۬ۛ۬۠ۧ۟ۛۘۚۦۘۦۗۨۢۜۘۖۤۥۘ۟ۛۦۜۨۜ";
                                break;
                            case -1671440808:
                                str = "ۜۤ۫۟۬ۦۤۤۡۙۙۡۘۦۦۚۖۨۧۘۘۨۡ۟ۨۜۘۘۖۘۘۛ۠ۙۤۖۦۘ۠۟ۤۤ۟ۙۤۗۜۥۨۘۘۢۘ۠ۧۤۗۗۦ";
                                continue;
                            case -1582244262:
                                String str5 = "۫ۗۦ۟۠ۘۗ۬ۘۦۚۦۖۤۜۥ۠ۜۘ۫ۘۖۙۛۚ۠ۦ۫۬ۡۖۢۙۡۘۛ۠ۡۘۧۗۖۘ۫۬ۤۗۧۚۘۦۘ۫۠ۖ۫ۗۦ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-1360161510)) {
                                        case -1799224986:
                                            String str6 = "ۡۚ۟ۨۧ۫۠ۤۨۘ۠ۧۨۘۚۤۨۚۖۥۜۚ۟ۡۜۘۥۢۥۦۡۧ۠ۖۡۘ۠ۤۖ۟ۨۗ۬۫ۨۘۦ۟ۥۘ";
                                            while (true) {
                                                switch (str6.hashCode() ^ (-1182680474)) {
                                                    case -1284458258:
                                                        str5 = "ۗۘۜۘ۬۠ۦۘۥۢۚۘۢۡ۬ۙۡۘۥۙۨۘۗۢۛۡۙۜۖۙ۬ۙ۟ۢ۠ۦۧۨۢۛ۬ۤ۠۫ۙۥۛۖ۫ۦ۠ۛۤۘۜۦۜۘۘۦۗۜ۟ۦۜۘۙ۟ۚۚۜ۬ۢۦۖۨۦۘ";
                                                        break;
                                                    case 400095686:
                                                        str6 = strGroup == null ? "ۚۤۢۜۡۗۘۤۢ۠ۦۚۖ۫ۨۘۡۖۧۘۥ۫ۨۘۛ۬ۙ۠۬ۖۘۛۘۗۘۥۘۘۧۤۦۨۗ۫ۜۦۡۗۘ۫ۥۘ۫ۘۘۘ۠ۥۤ" : "ۘۖۙۨۗۘۚۦ۫ۙۧۜۘۥۖۖۧۨ۬۠ۜۜۡۡۡۘ۟ۧۗۚۡۢۘۡۧۗۗۘۚۙۡ۫۫ۧ۬ۜۡۘ";
                                                        break;
                                                    case 1215223305:
                                                        str6 = "ۤۙ۠۠ۢۚۤۡۤ۫ۤۚ۬ۘۚ۬ۙ۠ۙۨۘ۟۬۫۠ۖۥۨۙۨۘۥ۟ۙ۠ۡۡۘۦ۟ۚ۟ۚۜ۠۠ۦۚۥۖۖۨ۬ۙۘۘۛۡۥۨۧ۟۫ۡۖۘۖۗۦۙۨۘۢۤۘ۠ۘۗۡ۠ۢۙ۬ۚ";
                                                        break;
                                                    case 1701513680:
                                                        str5 = "ۙۖۥۘۢۚۦۘۚ۬ۗۦۡۡۚۦۨۢۙۘۦ۟ۗۢۥۚ۟ۧ۫ۖۚۢۤ۠ۥۘۚۨ۠ۡۗۧۚۨۡۨۤۧۧۧ۫۠ۧۘۘۤۥ۫";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -408469368:
                                            str5 = "ۜۛۖۧۜۙۜۧۥۚۨۤۙۨۘۦۨۜۙ۫ۢۤۛۥۧۥۘۛۗۢۡۦۘۙۙۜۢۤ۟ۡۖۦۥۡۦ۫ۚ۬۠ۨۡۘۢۦۢ";
                                            break;
                                        case -356244687:
                                            str4 = "ۗۧۦۘ۟۫ۦۢۜۡۘۗۢۡۘۙۜۖ۬ۢۡۙ۬ۤۚ۠۠ۨۚۗۤۥ۠ۡۛۚۘۜۘۦۛۦۛۨۨۖۡ۬ۙ۠۟ۗۗۥ۟ۤ۟۠ۤۤۙ۠ۢ۬ۤ۟ۜۜۚۚۥۨۗۧۦۘ";
                                            break;
                                        case 809011424:
                                            str4 = "ۙ۫ۨۘۢ۟ۖۘۧۡۡۘۜۡۧۘ۠ۘۘۧۦۜۘۜۨۘ۫ۢۡۢ۟ۖۧ۬ۧۚۛۥۜۡۘۢۖ۬ۡۥۖۗ۟۬ۙۙۥ۬ۢۚ۫۬ۦ۠ۥۥۘۚۙۡۘۡ۬ۦۘۜۗۜۘۥۦۖۦ۠ۧ۬ۡۧۘۙۤۘۤۘ";
                                            break;
                                    }
                                }
                                break;
                            case 857063371:
                                str = "ۡۖۘۖۡ۬ۡۗۥۘۧۘۤۤۨۘۖۖۡۘۛۖۘۙۡۜۘۛۡۜۘۦۛۨۜۜۥ۬ۤۤ۠ۤۚۘ۟ۗۗۡۜۚ۟ۗۢۡۘۘۥۚۡۖۦۘۜ۠ۘ۫ۙ۟ۤۧۨۘۨ۠ۡۘۤ۠ۨۘ";
                                continue;
                        }
                    }
                    break;
                case -1188898421:
                    str = "ۜۤ۫۟۬ۦۤۤۡۙۙۡۘۦۦۚۖۨۧۘۘۨۡ۟ۨۜۘۘۖۘۘۛ۠ۙۤۖۦۘ۠۟ۤۤ۟ۙۤۗۜۥۨۘۘۢۘ۠ۧۤۗۗۦ";
                    str3 = str2;
                    break;
                case -870122355:
                    str = "ۖۨۢ۠ۖۜۖ۬۫۬ۦۢ۠ۡۧۘ۫ۜۨۘۧ۠ۖۘۡۚۦ۬ۜ۟ۚۥۘۢۘۖۘۥۨ۬ۨۥۧۢ۫ۘۘ۠ۙۧۖۚۤۨۖۡۧۤۥۥۡۘۧۥۗۗ";
                    str3 = strGroup;
                    break;
                case -523579072:
                    str = "۫۠ۡۘۜۚۜۤۚۦۨۛۖ۟۬ۥ۫ۖۘۤ۫ۦۚ۫۠ۗۦ۟ۥۢۤۜ۫ۨ۟ۢۘۘۘ۠ۘۘ۠ۜۜۡۜۙۥۥۡۘۚۚۢۥۗ";
                    break;
                case 1265412411:
                    str = "ۦۜۨۘۢۗۜۘ۬ۥۘۨ۟ۥۘۛۦ۫۠ۤۗۜ۠ۘۘۦۙۡۘ۬ۦۥۘۛۘ۫ۗۨۘۜ۫ۙۧ۬ۖۚ۠ۥ۫ۜۘ";
                    break;
                case 1629911134:
                    str2 = "";
                    str = "ۜ۫ۛۦۘۨۡۘ۬ۡۘۡۧ۬۠ۙ۟ۛ۟ۖۘۤۙۦۘۡۦۖۡۜۢۡۡۖ۟۫ۙۦۡۜۘۘۤ۟ۛۗ۟";
                    break;
                case 1672790523:
                    return str3;
            }
        }
    }

    @Override // p001.AbstractC0176d, java.util.List
    public final /* bridge */ int indexOf(Object obj) {
        String str = "ۨۛۦۡۡۤۢ۫۫ۢ۫ۦۘ۠۟ۙۢۘۦۘۛۡۜ۫۫ۤۘۡۚۚۛۜۛۤ۠ۤ۬ۦۖ۫ۥۗۡۤ۫ۤۚ۫ۙ۠ۗ۟ۚۥۘۗ۠ۙۖۦۗۢۜۦ۬۫ۖۢۤۖۤ۟ۨۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 875) ^ 823) ^ 828) ^ 801) ^ 29) ^ 46) ^ 752) ^ (-1077414544)) {
                case -1759528174:
                    String str2 = "۬ۢۨۧۤۢۦ۠ۦۚۤۛۥ۬۟ۧۡ۬ۗۚۨ۟ۖۘۜۙۨۘۙۥۘۘۖۛۖۘۜۨۗۚۡۖ۠ۚۨۘۦۢۖ";
                    while (true) {
                        switch (str2.hashCode() ^ 363150199) {
                            case 322885425:
                                str = "۠ۥۗ۟ۜ۬ۖ۠ۘۤۘ۫ۙۚۢ۫ۢۥۥۘۜۘۙۦۢ۬۟۬ۜۦۘۨۚۥۘۡ۬ۡۖۛ۬۠ۜ۬ۤۥۙۖۨۡۘۜۧۦۗۘۜ";
                                continue;
                            case 1146166441:
                                String str3 = "ۚۖ۫ۧۨۧۜۥۦۙۤ۠ۥۜۨۥۜۤۗۥ۬ۧۖۧۜۙۧۜۙۘۘۦۥۥۘۘۤ۬۫ۗۢ۫ۜۗۙۛۖ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-510549112)) {
                                        case -1784283133:
                                            str3 = "ۗۧۜۥۨۘۖ۟۫ۦۨۘۘ۟ۘۖۚۜۖۥۡ۟ۛۡۦۘۙۤۨ۠ۚۡ۠ۘۡۛ۫ۜۦۜۦۘۧۧۦۧۜۜۤۡۙۛۜ۟۫ۥۦۘۙۥۦ۬ۖۖۤۦۚۚۗۘۨۛۚ";
                                            break;
                                        case 463525805:
                                            str2 = "۟ۦۦۥۤۜۘۤۘۢۗۖ۫ۜۧۡۘۚۘ۬ۥۥۜۘۦۘۙۤۨۡ۠۠ۡۘۧ۫ۖۧۙۘ۫ۛۤۗۙۜۘۗۥۗ۠ۜۧۡ۠۟ۘۗۦۘۚۦۨۥۖۨ۠ۙۛۤۖۘۨ۫ۘۖۗۖۥۖۦۘۧ۫ۘۘ۫ۚۡۘ";
                                            break;
                                        case 876276560:
                                            String str4 = "ۧۙۨۘ۫۠ۦۘۢ۠ۘۧۜ۫ۘ۫ۜۢۘۢۢۖۘۘ۬ۗۨۖۙۘۘۡۥ۬ۗۦۜۘۛۚۧۘۛۘۘۚ۟ۦۧۘۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1157814181) {
                                                    case -1736306265:
                                                        str4 = !(obj instanceof String) ? "۫ۙۚۤۨ۟ۚۘ۬ۤۡۘۘۘۘۚۚۜۡۘۡ۟ۦۜۨۘۧۗۦۘۥۨۧۚۨۧ۟ۘۜۘۘۤۖۘۥۜۨۘۢ۫ۥۘۧۥۖۘ۠ۖ۬ۜۗۦۘۘۗۡۡۖۘۘۤۙۧۢۥۧۜ۠ۤۦ۠ۡ۬ۥۡۤۛۖۘ۫۠ۘ" : "ۤۖۢ۟ۜ۫ۡ۬ۢ۠۟ۙۚۖۡۘۗۙۘۘۘۖۖۚ۫۬ۧۚۧۛۦۡۘ۟۠ۨ۟ۗ۠ۙۡۨۘۢۘ۟۠ۨ۫";
                                                        break;
                                                    case -751889131:
                                                        str3 = "۬ۙ۫۫ۥۧۘۢۥ۬ۧۛۧۘ۬ۨ۠۫ۗۖۥۧۘۚۜۢۗۖ۫ۛۧۘۘۥۗۨۧۡۨۥۗۥۘ۬۟ۧۚۗۡۘۗۙۜۡۨۦۘ۠ۢۢ۟ۡۛۨۛۢۤۧۘ۬۬ۡۘ۠۠ۙۗۨۡ۟ۥۢ۠ۚۡۘۨۙۨ";
                                                        break;
                                                    case 83279832:
                                                        str3 = "ۛۡۢۗۧ۟ۢ۠ۦۤۢۤۨۥ۬ۤۢۢ۠ۡۜۥۗۥ۠ۚۡۘۧ۠ۘۧۢ۬۫ۦۤۛۜۜۡ۫۫ۙۗۗ";
                                                        break;
                                                    case 168638402:
                                                        str4 = "ۛۚ۟ۦۛۛ۬ۖۧۢۥۗ۟ۤۥۘۢۙۜۡۜۧۢۙۙۤۧۥۘۚۗۛۖ۟ۦ۟ۦۜۨۖ۠۟۬ۚۥۗۤ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1188810474:
                                            str2 = "ۗۘۥۘۜۦۖۦۘۢ۬ۡۦۘۢۜۘۚۧۧۛۥ۬ۥۘۗ۫ۜۖۘ۠ۛۥۘۖۙۘۘۘۜۘۦۚ۠ۧۛۧۚ۫ۨۘۜۡۜ۫ۘۧۘۜۛۥۚۛۨۘۗۤۡۘۖۚ۫";
                                            break;
                                    }
                                }
                                break;
                            case 1365845358:
                                str = "ۥۘۨۘۤۙۧۜۖۖۘۖۚۦۘۧۛۖۘ۟ۢۚۡۘۥ۬ۥۚۦۧۢۛۨۘۖۘۜۘۜۥۧۘۧ۠ۨۘۘۨۢ۟۫ۢ۟ۦۙۥۘۘ۟ۡۦۗۨۜۘۜۖۖۘۗۖۧۘ۫۬ۖۚۗۛۗۡۥۘۢۧۡۘۥ۫ۖۘۢۡۤ";
                                continue;
                            case 1814476269:
                                str2 = "ۜۦ۫ۘۛۨۙۜۛۤ۠۟ۜۜ۫ۙۗۧ۟۫ۨۦۥۘ۠ۨۥۘۡ۫۫ۥۘ۠ۛۚۖۛ۟ۖۢ۫ۘ۫ۨ۠ۨۗۜۘۢۦۖۧۖ۫ۖۙۖۘ۠ۤۡۘۡۙۦ۠ۚۛۛۢ۬ۗۡۥۛۧ۫ۡ۠ۖۘۖۛ۠";
                                break;
                        }
                    }
                    break;
                case -1738014431:
                    return -1;
                case -1583997923:
                    return super.indexOf((String) obj);
                case -476580902:
                    str = "ۢۥۧۖۖۥۘۢۘۙۙۗۦۘۢۙۖۘ۟ۡ۟ۡۥۤۨۥۘۘۛۧۖ۬ۙ۟۠ۙۨۤۚۜۛۡۙۜ۟۫ۖ۫ۜۖۤۤۚۢۡۧۚۛ۫ۜۢ۫ۚ۟ۘۤۜۘ";
                    break;
                case 1225577596:
                    str = "ۛۛ۟ۢۚۜۘۤ۫ۧ۫ۨۖۘ۠ۚۦۥۢۙۨۛۜۛ۟۟ۗۜۘۢۦۜۘۧۗۜۘۜ۬ۨۨۦۥۚۥ۠ۙۥۡ۬ۦ۫ۙۢۚۙۙۘۘ";
                    break;
            }
        }
    }

    @Override // p001.AbstractC0176d, java.util.List
    public final /* bridge */ int lastIndexOf(Object obj) {
        String str = "ۖۜۜۘۖۖۧۘۤۛۚۡ۫۬ۢ۟۟ۚۦۤ۬ۜۦۘۨۛۤۗۗۤۥ۬ۨۙ۫ۙۥ۫ۗۛۙۨۢۧۘۘ۬ۗۦۙۖۧۘۨ۫ۖ۟ۡۖۘۘۢۤۦۦۨۘۚۛۛۦۘۙۢ۟ۧۢۜۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 939) ^ 793) ^ 794) ^ 213) ^ 910) ^ 988) ^ 440) ^ (-1409227531)) {
                case -1457704617:
                    return -1;
                case -314783321:
                    str = "ۨ۟ۥۘۖۜۘۘۗۧۖۘ۟۫ۡۘ۫ۨۙۧۜۙۗۛۨۘۧ۟۬ۖۤ۫ۨۢۚۥۨ۠ۖۢۥ۟ۨۘۙۢۖۘۙۦۜ";
                    break;
                case 101744069:
                    String str2 = "ۛۛۧ۬ۗ۫۫ۦۙۧۡۖۤۨ۬ۖۤۧۦ۫ۡۧۘۧۤۛۙۗۗۘۖۧۦ۟۫ۨۚۧ۬ۜۧۙۜ";
                    while (true) {
                        switch (str2.hashCode() ^ 105777279) {
                            case -487183023:
                                String str3 = "ۥۘۦۘۙۥۥۨۙ۟ۡۧۘۘۦۥ۟ۜ۠ۖۘۗ۠ۙۙۛ۠ۤ۫ۨۘۛ۟ۚۚ۠۟۠ۜۘۖۙۦۢ۟ۢۜۗ۠ۚۘۧۙۢۡۖۥۤۥۧ۬ۘۗۛۧۛۗ۠ۗۢۦۡۚۤۘۡۧۛۚۤ۬ۡۤۚ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1263940840)) {
                                        case -1966815366:
                                            String str4 = "ۘۘۨ۫۬۬ۤۘۡۦ۫ۜۘۦ۬ۜ۠ۤۙۜۘۡ۟ۖ۠ۘۘۗۢۗۧ۬ۨۗ۫ۨۘ۬ۨۦۘۛۜۦۘۤۢۨۘۘ۠ۦ۟ۛۘۘۗۤۨۧ۟۟ۘۖۥۘۙۥۖۘۡۚۨ۟ۖۘۧۥۡ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-326783092)) {
                                                    case -1657250520:
                                                        str4 = !(obj instanceof String) ? "ۦۨۥۜ۠ۖۥۗۦۘۘ۠۟ۦۙۚۡۡ۬ۢ۫ۨ۫ۚۖۘۥۜ۟۠ۘۥۨۨۖۘ۫ۥ۟۫ۦۨۜۛ۬ۙ۟ۘۜۙۗۖۡۥۜۥۜۤۥۘۨۢۨۦۤۧۗۛۦۥ۬ۖۤۢۨۘۗۚۜۘۡۖۖۙۛۨ" : "۟ۛۨۘ۠ۜۦۜ۬ۢۜۨۢۘ۠ۖۘ۠۫ۢۜ۟ۨۥۡۨۡۜۧۘۥۗۤۛۤۨۘۙۘ۬ۙۤۡۘۚۗۥۘۗۨ۫۟ۨۨۜۡۨۛۛۜۘۧ۬ۙۥۨۘ۠ۙ۟";
                                                        break;
                                                    case -1148343499:
                                                        str4 = "ۢۜ۠ۜۖۖ۠ۧۜ۟ۡۗۤۨۦۗۧۡ۠۟۫۠ۡۦۛ۬ۦ۟ۨۥۘ۠ۗۜۘۜ۬۬ۡۘۖۘۘۢۜۘۘ۠ۨ۠ۛۦۜ۠ۖۘۤۖ۫";
                                                        break;
                                                    case -1133810433:
                                                        str3 = "۬ۜۦۘۢۙۦۘۜۥۚۦۙۨۘ۠ۤ۠ۛۙ۫۫ۚۜۖۜۤۚۤۜۘۧۤۧۧۘۧ۫ۥۖۡۧۘۘۡۦۨۘۡۥ۠";
                                                        break;
                                                    case 766967985:
                                                        str3 = "ۦۘۡۘۖۙۨۢۗۙۡۘۥۖۥۘۙ۠ۧۧۤۥۗۗۡۘۧۖۧۛۢۤۙۢۥۡ۟ۢۢۥۘۘۗۘۗۦۦۙۨۡ۟ۥۜ۫ۤ۬";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -1301886989:
                                            str2 = "۠۫ۤۘۜۢۢۡۡ۟ۚۖۢۛۦۘۙۡۜۘۜۚۨۘ۠ۛۖۘۨۙۚۚۢۥۘ۫ۥۢۤۛۜ۠ۙۚۦۦۖۗۛۖ";
                                            break;
                                        case -40179932:
                                            str2 = "ۗ۫ۜۘۙۡ۟ۨۦۖۘۘۢ۟۠ۦۜۗۗۛۢۦ۟۫۫ۙۙۨۜۘۢۤ۟ۨۨۤۨۡۨۘۜ۫ۧۦ۫ۛۜۧ۫ۧۘۦۡۤۛ۫ۖ";
                                            break;
                                        case 1905027578:
                                            str3 = "ۦۡۖۤۚۡۘۥۙ۫ۚۤ۫ۨۦ۫ۚۛۥۚۨ۬ۥۜۘۘۢ۫۬ۚۢۥۘۗۡۨۘۘۧۘۤۨۤ۟ۦۥۛ۠ۜۘ۬ۢۤ۬ۥۙۜۨۜۘۛۧۨۘۡۡۢۡۜۧۘ";
                                            break;
                                    }
                                }
                                break;
                            case 1246220475:
                                str2 = "ۨۖ۫ۗۨ۫ۥۡۜۘۘۘۧۘۚۖۛۤۢ۬۫ۢ۫ۨۖۤۨۛۘۘۜۙۥۘۚۦۥۨ۠ۥۘۦ۠ۚۚۨ۫ۥۙۙۛ۟ۛۥۨۚۧۤۙ";
                                break;
                            case 1357804097:
                                str = "۫ۗۤۡ۟ۖۚۘۘۗۛۢۥۧ۬ۚ۟ۧ۫ۢۚۗۧۖۘۖۚ۟ۡۘۥۘۥۡۨۚۚ۬ۖۛۨ۟ۚۤۧۘۘ";
                                continue;
                            case 1993492555:
                                str = "۬ۖۜۘۦۘ۟ۛۨ۠ۙۜ۫ۦۘۦ۫ۧۘ۫ۤۨۙۗۘ۬ۧۛۙ۠۟ۜۛۚۨۘ۫۫۟ۘۥۡۘۥۥۖۘۛۗۘۘۖ۟ۥۘۗۛ۫ۛۜ۫ۗۢۖۨۢۨ۠ۙۜۗ۬ۛۜ۟ۢۛۦۙ۠ۘ۟ۡۤ";
                                continue;
                        }
                    }
                    break;
                case 1188570046:
                    str = "ۚۦ۫ۖۥۖ۠ۖۙۡۘۤۛۧۦۗۤۛۚۦۘۨۧۜۡۢۚۥۗۛۜۛۚۧۢ۟۬ۡۨ۠ۗۚۚ۟ۘۘ";
                    break;
                case 1928448635:
                    return super.lastIndexOf((String) obj);
            }
        }
    }

    @Override // p001.AbstractC0162c
    /* JADX INFO: renamed from: ۥ */
    public final int mo828() {
        String str = "۫۠۠ۦۙۖۙ۫۟ۦۧۢۧۚۦۘۤ۠ۙ۬ۡۚۢۜۘۚۧۢۛۧۧۖۦۨۡۡۦۘۘۗۙۡ۟ۥۘ۬۠۠ۚۚۚۛۦۛۦۨۧ";
        while (true) {
            switch ((((((((str.hashCode() ^ 256) ^ 851) ^ 32) ^ 475) ^ 802) ^ 159) ^ 145) ^ (-1041537542)) {
                case -1101438481:
                    return this.f1043.f1061.groupCount() + 1;
                case 1985573713:
                    str = "ۖۡۚۜۗۨۘ۬ۨۗۢۚۥۧۧۥۙۚۥۘ۫۫ۙ۠۠ۤۢۡۘۤ۟۟ۦۧۡۘۧۢۡۘۜۢۛۢۦ۟ۡ۟ۜۘ۬ۨۘۘۛۛۛۛۜۥۘۧۗۨۥۡۤ۬۫ۗۖۧۗۢۗۖۘۜ۟ۛ۬ۘۗۨۗۘ۫ۙۚ";
                    break;
            }
        }
    }
}
