package p215;

import android.view.ViewGroup;
import java.util.Arrays;
import java.util.HashMap;

/* JADX INFO: renamed from: 飘花落叶言子苏兰世楪哲.飘花落叶言子楪苏哲兰世, reason: contains not printable characters */
/* JADX INFO: compiled from: r8-map-id-447c03deab370cabd87f71de7ff996ccc1a6dc9764ce389c731d875d052048e4 */
/* JADX INFO: loaded from: classes.dex */
public final class C8699 {

    /* JADX INFO: renamed from: 飘花落叶言子楪世兰哲苏, reason: contains not printable characters */
    public HashMap f21983;

    /* JADX INFO: renamed from: 飘花落叶言子楪世兰苏哲, reason: contains not printable characters */
    public final C8688 f21984;

    /* JADX INFO: renamed from: 飘花落叶言子楪世哲兰苏, reason: contains not printable characters */
    public final C8696 f21985;

    /* JADX INFO: renamed from: 飘花落叶言子楪世哲苏兰, reason: contains not printable characters */
    public final C8697 f21986;

    /* JADX INFO: renamed from: 飘花落叶言子楪世苏兰哲, reason: contains not printable characters */
    public final C8689 f21987;

    /* JADX INFO: renamed from: 飘花落叶言子楪世苏哲兰, reason: contains not printable characters */
    public int f21988;

    public C8699() {
        C8689 c8689 = new C8689();
        c8689.f21863 = 0;
        c8689.f21862 = 0;
        c8689.f21861 = 1.0f;
        c8689.f21860 = Float.NaN;
        this.f21987 = c8689;
        C8697 c8697 = new C8697();
        c8697.f21967 = -1;
        c8697.f21966 = 0;
        c8697.f21965 = -1;
        c8697.f21964 = Float.NaN;
        c8697.f21963 = Float.NaN;
        c8697.f21962 = Float.NaN;
        c8697.f21969 = -1;
        c8697.f21968 = null;
        c8697.f21970 = -1;
        this.f21986 = c8697;
        C8696 c8696 = new C8696();
        c8696.f21923 = false;
        c8696.f21920 = -1;
        c8696.f21919 = -1;
        c8696.f21918 = -1.0f;
        c8696.f21937 = true;
        c8696.f21936 = -1;
        c8696.f21940 = -1;
        c8696.f21941 = -1;
        c8696.f21938 = -1;
        c8696.f21939 = -1;
        c8696.f21931 = -1;
        c8696.f21930 = -1;
        c8696.f21934 = -1;
        c8696.f21935 = -1;
        c8696.f21932 = -1;
        c8696.f21933 = -1;
        c8696.f21925 = -1;
        c8696.f21924 = -1;
        c8696.f21928 = -1;
        c8696.f21929 = -1;
        c8696.f21926 = 0.5f;
        c8696.f21927 = 0.5f;
        c8696.f21911 = null;
        c8696.f21910 = -1;
        c8696.f21909 = 0;
        c8696.f21908 = 0.0f;
        c8696.f21907 = -1;
        c8696.f21906 = -1;
        c8696.f21917 = -1;
        c8696.f21916 = 0;
        c8696.f21915 = 0;
        c8696.f21914 = 0;
        c8696.f21913 = 0;
        c8696.f21912 = 0;
        c8696.f21903 = 0;
        c8696.f21902 = 0;
        c8696.f21905 = Integer.MIN_VALUE;
        c8696.f21904 = Integer.MIN_VALUE;
        c8696.f21900 = Integer.MIN_VALUE;
        c8696.f21901 = Integer.MIN_VALUE;
        c8696.f21897 = Integer.MIN_VALUE;
        c8696.f21896 = Integer.MIN_VALUE;
        c8696.f21899 = Integer.MIN_VALUE;
        c8696.f21898 = -1.0f;
        c8696.f21894 = -1.0f;
        c8696.f21895 = 0;
        c8696.f21956 = 0;
        c8696.f21955 = 0;
        c8696.f21959 = 0;
        c8696.f21960 = 0;
        c8696.f21957 = 0;
        c8696.f21958 = 0;
        c8696.f21947 = 0;
        c8696.f21946 = 1.0f;
        c8696.f21945 = 1.0f;
        c8696.f21944 = -1;
        c8696.f21943 = 0;
        c8696.f21942 = -1;
        c8696.f21949 = false;
        c8696.f21952 = false;
        c8696.f21951 = true;
        c8696.f21948 = 0;
        this.f21985 = c8696;
        C8688 c8688 = new C8688();
        c8688.f21852 = 0.0f;
        c8688.f21851 = 0.0f;
        c8688.f21850 = 0.0f;
        c8688.f21849 = 1.0f;
        c8688.f21848 = 1.0f;
        c8688.f21847 = Float.NaN;
        c8688.f21855 = Float.NaN;
        c8688.f21854 = -1;
        c8688.f21858 = 0.0f;
        c8688.f21859 = 0.0f;
        c8688.f21856 = 0.0f;
        c8688.f21857 = false;
        c8688.f21853 = 0.0f;
        this.f21984 = c8688;
        this.f21983 = new HashMap();
    }

    public final Object clone() {
        C8699 c8699 = new C8699();
        C8696 c8696 = c8699.f21985;
        c8696.getClass();
        C8696 c86962 = this.f21985;
        c8696.f21923 = c86962.f21923;
        c8696.f21922 = c86962.f21922;
        c8696.f21921 = c86962.f21921;
        c8696.f21920 = c86962.f21920;
        c8696.f21919 = c86962.f21919;
        c8696.f21918 = c86962.f21918;
        c8696.f21937 = c86962.f21937;
        c8696.f21936 = c86962.f21936;
        c8696.f21940 = c86962.f21940;
        c8696.f21941 = c86962.f21941;
        c8696.f21938 = c86962.f21938;
        c8696.f21939 = c86962.f21939;
        c8696.f21931 = c86962.f21931;
        c8696.f21930 = c86962.f21930;
        c8696.f21934 = c86962.f21934;
        c8696.f21935 = c86962.f21935;
        c8696.f21932 = c86962.f21932;
        c8696.f21933 = c86962.f21933;
        c8696.f21925 = c86962.f21925;
        c8696.f21924 = c86962.f21924;
        c8696.f21928 = c86962.f21928;
        c8696.f21929 = c86962.f21929;
        c8696.f21926 = c86962.f21926;
        c8696.f21927 = c86962.f21927;
        c8696.f21911 = c86962.f21911;
        c8696.f21910 = c86962.f21910;
        c8696.f21909 = c86962.f21909;
        c8696.f21908 = c86962.f21908;
        c8696.f21907 = c86962.f21907;
        c8696.f21906 = c86962.f21906;
        c8696.f21917 = c86962.f21917;
        c8696.f21916 = c86962.f21916;
        c8696.f21915 = c86962.f21915;
        c8696.f21914 = c86962.f21914;
        c8696.f21913 = c86962.f21913;
        c8696.f21912 = c86962.f21912;
        c8696.f21903 = c86962.f21903;
        c8696.f21902 = c86962.f21902;
        c8696.f21905 = c86962.f21905;
        c8696.f21904 = c86962.f21904;
        c8696.f21900 = c86962.f21900;
        c8696.f21901 = c86962.f21901;
        c8696.f21897 = c86962.f21897;
        c8696.f21896 = c86962.f21896;
        c8696.f21899 = c86962.f21899;
        c8696.f21898 = c86962.f21898;
        c8696.f21894 = c86962.f21894;
        c8696.f21895 = c86962.f21895;
        c8696.f21956 = c86962.f21956;
        c8696.f21955 = c86962.f21955;
        c8696.f21959 = c86962.f21959;
        c8696.f21960 = c86962.f21960;
        c8696.f21957 = c86962.f21957;
        c8696.f21958 = c86962.f21958;
        c8696.f21947 = c86962.f21947;
        c8696.f21946 = c86962.f21946;
        c8696.f21945 = c86962.f21945;
        c8696.f21944 = c86962.f21944;
        c8696.f21943 = c86962.f21943;
        c8696.f21942 = c86962.f21942;
        c8696.f21950 = c86962.f21950;
        int[] iArr = c86962.f21953;
        if (iArr == null || c86962.f21954 != null) {
            c8696.f21953 = null;
        } else {
            c8696.f21953 = Arrays.copyOf(iArr, iArr.length);
        }
        c8696.f21954 = c86962.f21954;
        c8696.f21949 = c86962.f21949;
        c8696.f21952 = c86962.f21952;
        c8696.f21951 = c86962.f21951;
        c8696.f21948 = c86962.f21948;
        C8697 c8697 = c8699.f21986;
        c8697.getClass();
        C8697 c86972 = this.f21986;
        c86972.getClass();
        c8697.f21967 = c86972.f21967;
        c8697.f21965 = c86972.f21965;
        c8697.f21963 = c86972.f21963;
        c8697.f21964 = c86972.f21964;
        C8689 c8689 = this.f21987;
        int i = c8689.f21863;
        C8689 c86892 = c8699.f21987;
        c86892.f21863 = i;
        c86892.f21861 = c8689.f21861;
        c86892.f21860 = c8689.f21860;
        c86892.f21862 = c8689.f21862;
        C8688 c8688 = c8699.f21984;
        c8688.getClass();
        C8688 c86882 = this.f21984;
        c86882.getClass();
        c8688.f21852 = c86882.f21852;
        c8688.f21851 = c86882.f21851;
        c8688.f21850 = c86882.f21850;
        c8688.f21849 = c86882.f21849;
        c8688.f21848 = c86882.f21848;
        c8688.f21847 = c86882.f21847;
        c8688.f21855 = c86882.f21855;
        c8688.f21854 = c86882.f21854;
        c8688.f21858 = c86882.f21858;
        c8688.f21859 = c86882.f21859;
        c8688.f21856 = c86882.f21856;
        c8688.f21857 = c86882.f21857;
        c8688.f21853 = c86882.f21853;
        c8699.f21988 = this.f21988;
        return c8699;
    }

    /* JADX INFO: renamed from: 飘花落叶言子楪世苏哲兰, reason: contains not printable characters */
    public final void m13790(C8680 c8680) {
        C8696 c8696 = this.f21985;
        c8680.f21782 = c8696.f21936;
        c8680.f21781 = c8696.f21940;
        c8680.f21800 = c8696.f21941;
        c8680.f21799 = c8696.f21938;
        c8680.f21803 = c8696.f21939;
        c8680.f21804 = c8696.f21931;
        c8680.f21801 = c8696.f21930;
        c8680.f21802 = c8696.f21934;
        c8680.f21794 = c8696.f21935;
        c8680.f21793 = c8696.f21932;
        c8680.f21797 = c8696.f21933;
        c8680.f21788 = c8696.f21925;
        c8680.f21787 = c8696.f21924;
        c8680.f21791 = c8696.f21928;
        c8680.f21792 = c8696.f21929;
        ((ViewGroup.MarginLayoutParams) c8680).leftMargin = c8696.f21916;
        ((ViewGroup.MarginLayoutParams) c8680).rightMargin = c8696.f21915;
        ((ViewGroup.MarginLayoutParams) c8680).topMargin = c8696.f21914;
        ((ViewGroup.MarginLayoutParams) c8680).bottomMargin = c8696.f21913;
        c8680.f21772 = c8696.f21896;
        c8680.f21771 = c8696.f21897;
        c8680.f21790 = c8696.f21904;
        c8680.f21773 = c8696.f21901;
        c8680.f21780 = c8696.f21926;
        c8680.f21779 = c8696.f21927;
        c8680.f21798 = c8696.f21910;
        c8680.f21795 = c8696.f21909;
        c8680.f21796 = c8696.f21908;
        c8680.f21778 = c8696.f21911;
        c8680.f21761 = c8696.f21907;
        c8680.f21757 = c8696.f21906;
        c8680.f21776 = c8696.f21898;
        c8680.f21777 = c8696.f21894;
        c8680.f21766 = c8696.f21956;
        c8680.f21775 = c8696.f21895;
        c8680.f21820 = c8696.f21949;
        c8680.f21819 = c8696.f21952;
        c8680.f21765 = c8696.f21955;
        c8680.f21768 = c8696.f21959;
        c8680.f21764 = c8696.f21960;
        c8680.f21760 = c8696.f21957;
        c8680.f21767 = c8696.f21958;
        c8680.f21763 = c8696.f21947;
        c8680.f21759 = c8696.f21946;
        c8680.f21762 = c8696.f21945;
        c8680.f21758 = c8696.f21917;
        c8680.f21784 = c8696.f21918;
        c8680.f21786 = c8696.f21920;
        c8680.f21785 = c8696.f21919;
        ((ViewGroup.MarginLayoutParams) c8680).width = c8696.f21922;
        ((ViewGroup.MarginLayoutParams) c8680).height = c8696.f21921;
        String str = c8696.f21950;
        if (str != null) {
            c8680.f21823 = str;
        }
        c8680.f21824 = c8696.f21948;
        c8680.setMarginStart(c8696.f21903);
        c8680.setMarginEnd(c8696.f21912);
        c8680.m13761();
    }
}
