package com.skyhand.redbookhelper;

import android.app.Activity;
import android.widget.TextView;
import p001.AbstractC0335o4;
import p001.C0237h4;
import p001.C0341oa;
import p001.C0433vb;
import p001.InterfaceC0222g3;

/* JADX INFO: renamed from: com.skyhand.redbookhelper.a */
/* JADX INFO: loaded from: classes.dex */
public final class C0013a extends AbstractC0335o4 implements InterfaceC0222g3<Activity, C0433vb> {

    /* JADX INFO: renamed from: ۥ */
    public final CharSequence f24;

    /* JADX INFO: renamed from: ۥ۟ */
    public final MainActivity f25;

    public C0013a(CharSequence charSequence, MainActivity mainActivity) {
        this.f24 = charSequence;
        this.f25 = mainActivity;
    }

    /* JADX DEBUG: Method arguments types fixed to match base method, original types: [java.lang.Object] */
    /* JADX DEBUG: Return type fixed from 'java.lang.Object' to match base method */
    @Override // p001.InterfaceC0222g3
    /* JADX INFO: renamed from: ۥ۟۟ */
    public final C0433vb mo984(Activity activity) {
        Activity activity2 = null;
        TextView textView = null;
        String strM915 = null;
        boolean z = false;
        boolean z2 = false;
        boolean z3 = false;
        TextView textView2 = null;
        String strM9152 = null;
        TextView textView3 = null;
        CharSequence charSequence = null;
        TextView textView4 = null;
        CharSequence charSequence2 = null;
        String str = "ۗۚ۬ۛ۟ۥ۟ۦ۬۬ۡۘۥۨۢۗ۠ۗۢۚۜۗ۟ۖۘۡۖۥۗۛۗۨۖۨ۬ۛۤ۠ۙۗۚۢۤ۠ۛۘۚۦۡ۫ۢ۟ۛۨۡۤ۬۟ۛۢۗۡۖۦ";
        while (true) {
            switch ((((((((str.hashCode() ^ 279) ^ 255) ^ 237) ^ 987) ^ 677) ^ 550) ^ 708) ^ 206417705) {
                case -2095205786:
                    str = "ۡۙۦۦ۠ۜۘ۠ۙ۫ۥ۫ۚۖ۫ۨۘ۠ۛۢ۠ۡۘ۬۬ۖۚۦۖۗۧ۫۬۬ۦۘۨۢۜۨۗۗۦۘۚۘ۬ۡۧۢۛۖۨ۟ۘۘۡۡۤۗۨۖۤ۠";
                    z3 = z;
                    break;
                case -1996826282:
                    str = "ۙۚۤۥ۫ۜۘۙۦۦۘ۬ۡۨۘۤۤۦۘۛۖۖۖۙ۬ۚۘ۠ۡۦۜۥۥۖۦۘۘۜۢۘۡۜۨۧۡۥۘ۬ۘۘ";
                    z3 = z2;
                    break;
                case -1911787602:
                    str = "ۦۚۜۘۛۤۙ۠ۦۥۘ۬ۙۦۘۨۨۧۘ۟ۧۡۚۥۦۧۥۘۗۨۛۢۤۢۙۘۜ۬ۚ۬ۨۘۡۨۢ۠ۥۖ";
                    activity2 = activity;
                    break;
                case -1817727172:
                    C0237h4.m1090(C0341oa.m915(new byte[]{-50, -27}, new byte[]{-89, -111, 94, 16, 104, -64}), activity2);
                    str = "ۘۨۦۘۦ۠ۛۨۤۤۙۥۘۘ۬ۧ۠ۘ۟ۢۨۚۘۘۧۗۡۗۢۨۘۤۡۘۘۛۚۘۤۚۛ۠ۗۥۘۧۙۜۥۦۘ۫ۛ۠ۦۙۖۥۢۘۚۗۜۗۗۗۡۢۖۘۨۚ۫ۢۡۦۘ۫۫";
                    break;
                case -1475325249:
                    str = "۟ۛۙۗۤ۠ۗ۟ۧ۠ۘۘۘ۟ۥ۠۫ۦۨ۠ۖۢۡۜۥۡۜ۟ۢۗۥۘۙ۟۬ۗ۟ۤۜۦۦۘۙ۬ۖ۫ۦۛۤۜ۟ۙۚۨۘۖۛ۫ۚۧۜۘۙ۫ۗۜۡۡ۬ۖۨۜۥۙۜۦۖ";
                    break;
                case -1381794906:
                    strM915 = C0341oa.m915(new byte[]{-122, 86, -26, 1, 36, 27, -123, 76, -10, 0, 24, 56, -124, 117, -4}, new byte[]{99, -31, 84, -28, -91, -121});
                    str = "ۘۧۖۚۚۗ۠۫ۦۡۚۧۛ۫ۛۜ۠ۖ۟ۧۘۜۘ۬ۜۘۥۨۧۘۘۥۖ۬ۜۜۡۘۧۗۖۚۦۡۘ۠ۢۢۤۤۖۘۦ۫ۘ۟ۥۦۘ۫ۙۡۘۨۡۚۜ۠ۙ۫۠ۜۤۚۨ۟۫ۜۘ";
                    break;
                case -1139278506:
                    str = "۫ۨۨۤۙۖۘۙۜۥۘۢۤۜۚ۠ۗ۬ۨۚۙۤۚۦۡۖۘۥ۟ۗۡ۬۟۬ۨۘۢۤۤۢ۟ۜۘۦۖ۠ۧۘۨۘۛۥۘۖۤۗ۬ۧ۠ۜۛۜۨۘۤۚۨۘۦۚۨۖۜۖۦۜ۬ۚ۠ۥ۬ۘۖ۠۬ۙ";
                    charSequence2 = strM9152;
                    break;
                case -1020372381:
                    str = "ۙۚۤۥ۫ۜۘۙۦۦۘ۬ۡۨۘۤۤۦۘۛۖۖۖۙ۬ۚۘ۠ۡۦۜۥۥۖۦۘۘۜۢۘۡۜۨۧۡۥۘ۬ۘۘ";
                    break;
                case -1003220923:
                    charSequence = this.f24;
                    str = "ۦۙۦۘ۠ۧۙۢۗۚ۠۠ۦ۠ۨۢۜۦۦۘۜۧۙۦۗۘۘۥۗ۠ۥۖۜۘ۫ۥۧۘۗ۟ۘۘ۬۫ۤۛۦۨۡۘۖۘۜ۬۫۟ۡۨۘۗۧۤ";
                    break;
                case -830590144:
                    str = "ۜ۠ۖۘۛ۫ۜۘۘۡۖۛ۫ۥۘۦۨۦۨۚۡ۬ۚ۠ۦۨ۟ۦ۠ۜ۟ۥۘۖۙ۫ۚ۟۠۠۠۠ۦۨۦۧۡۘ۬ۨۗۙ۬۠ۦۦۧۘۧۘۘۤۦۦۗۧۗۢۖ۟ۜۤ۟ۡ۬ۜ";
                    charSequence2 = charSequence;
                    break;
                case -651275140:
                    str = "ۜ۟۠ۜۨۧۘۜۖ۠ۧۗۜۛ۫ۗۗۗۦۜۜۨ۫ۨۛۨ۠۬ۘۨ۠ۦۙۛۨۘۡ۬ۨۘۢۤۤۖ۫ۦۚۤۦۧۘۖۘ۬۠ۡۘۦ۫ۖۛۧۥۘۚۙۘۘ۫۫ۥۘۘ۬ۤۤۜۘۜۜۛ۟ۥۖۨ۬ۥۘ";
                    textView3 = (TextView) this.f25.f1291.m886();
                    break;
                case -541140410:
                    String str2 = "۬ۙۜۘۚ۬ۙۗۖۥۘۨۚۙۛۧۡۘۨۙۤۛۥۡ۟ۡۡۘۜ۫۬ۜۚۦ۬ۘۖۘ۬ۢ۠ۙ۠ۤۦۖۚۦۚۡ";
                    while (true) {
                        switch (str2.hashCode() ^ (-1251173279)) {
                            case -1450350890:
                                str2 = "ۛۗۧۘۢ۠ۡ۟۟ۢۙ۠ۛۘۗ۠ۜۖۘۜۜ۟۠۬ۖۥۥۧۤۜۥۦۤ۫ۘۜۘۚۨۦۢۙۙۘۜۖ";
                                break;
                            case -463230521:
                                String str3 = "ۧۡۗ۠ۖ۬۠ۘۢ۬ۘ۬ۗۧۜۘ۬ۥۗۙۖۧۤۧۤۘۖۜ۫ۨۘۗۢۘۚۛۦۜ۟۠ۡۥۚۧ۫ۢۙۥۘۡۥۛۚۧۥۘۖۙۡۛ۬ۦۘۗۛۦۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ 180973433) {
                                        case -1640582381:
                                            str2 = "ۘ۬ۥۗۖ۟ۖۗۚۘۘۢۧ۫ۛ۬ۖۥۥۨۘۨ۟ۜۧۢۙۜۙ۫ۧ۠۠ۜۤۗ۬ۙۢ۠ۚۛ۬ۗۦۧۡۤۚۥۧ۬ۥۡۘ";
                                            break;
                                        case -348888636:
                                            str3 = "۠۟ۤۗۡۨۘۧۦۖۖۨۖۘۦۘۘ۬ۦۥۦۨۥۗۜۢۦۥ۬۫ۢۛۙۡۢ۬ۗۙۥ۫۬ۘۥ۬ۦۢۥۘۘۚۖۢۨۡۚ۠ۙۦۘ۟ۜ۟۟ۜۚۧ۬۫۟ۧۛۥۖۖۘ";
                                            break;
                                        case -178489438:
                                            str2 = "ۧۛۡۘۨ۫ۧۡۚۖۨۜۗۤۢ۫۠۟ۜۘۦۛ۠ۖۛ۫ۛۖ۫ۥۤۨ۬۫ۗۘۘۦۢۥۥ۟۬ۜۘۨۥۡۖۨۥۘۡ۟ۡۘۤۚ۫";
                                            break;
                                        case 1447733711:
                                            String str4 = "ۡۘۦۛۖۧۦۡۖۘۨۤۖۗۚ۫۬ۨۡۢ۟ۦ۠ۖ۟ۛۨۙۥۡ۬ۖ۬ۜۤۘۘۛ۠۟ۖۙۡۢۥۛۚ۫۬ۗۛ۬ۦ۠۬ۗ۬ۨۘ۠۫ۙۢۡۘۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 585062445) {
                                                    case -1588168227:
                                                        str3 = "۬ۡ۠ۛۨۚۤۨۘۧۖۙۚ۠ۡۙۜۘۘۧ۬ۥۘۧۧ۟۟ۚ۠۠۠ۙ۠ۜۦۘۧۙۖۘ۫ۘ۠ۨۖۦۚۡۤۡۨۧۘ۟ۢۖۘ۠۬ۘۘ";
                                                        break;
                                                    case -1280737100:
                                                        str4 = "ۙۥۜۘۛۜۨ۫۫ۡۘۢۨ۬ۜۖ۬ۗۚۗۦۤۦۛۙۘۘۨ۠ۜۘ۫ۘۙۛۥۜ۠۟ۥ۬ۘ۠۟ۨۡۘۗ۟ۨۘ۫۬ۥۢۡۙۤۢۢ۫ۡۜۘۛۧۗۗۧۤ";
                                                        break;
                                                    case -1125691464:
                                                        str3 = "ۛۙۨۜۜۖۘۚ۫ۘۘۙۘۜۚۚۘۘۦۙۡۘ۬ۜۤۘۜۘ۬۬ۘۘۘۡۥۘۖۡۦۘ۬ۖۖ۫۬ۜۤۥۦۜۚ۫۟۟ۘۥ۬۠ۨۘ۬ۗۨۥۗۨۛۦۨۚۛۡۦۖۘۧۢۥۘ۬ۜۘۙۛ۟ۜۗۜ";
                                                        break;
                                                    case 547541717:
                                                        str4 = z3 ? "ۖۦۘۘۖۨۦۘۚۢ۫۬۬ۨۦۙۦ۫ۚۤۥۜۥۘۛۢ۟ۚۦۡ۫ۤۨۤۚۙۗۘۘۙۚۜۘۥۖۢۦ۫ۜۘ۫ۖۛۙۛۨۘۘ۠ۡۘۨۙۡۥۘ۟ۚۗۥۘ" : "۟ۖۛۖۡۧۘۚۧۦۖۧۖ۬ۨۙ۠ۡۛۥۗۚۙۡۛۤۢۦۥۚۡۛۨ۟ۜۖۤ۬ۦۢۘۗۧۚۚ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 1164361066:
                                str = "ۜۡۜ۠ۡۘۘۖۜۜۘۛۤ۟ۧۧۘ۬ۖ۫ۨۨ۠ۨۡۥۥۜۦۘۘ۟۫ۧۘۘۜ۟ۦۨۢۨۥۜۚۢۗۛۢۨۤۨۛۘۛۛۜۘ۟ۨۜ۟ۚۖ۫ۥۡۛۙۙۥۥۖۤۜ۟ۛ۬۬۫ۨۦۚۗۜۘ";
                                continue;
                            case 1867789036:
                                str = "ۘۙ۟۠ۡۢۖۤۡۤۤۖۘۙ۟ۜۧۘۛۙ۟ۜۜۙۙۧۚۡۘۡۧۤۥۥۛۡۤ۟ۡۦۘۘ۫۬ۚۛ۫ۡۘۢ۫۬ۚۘۘۗۦۜۘ۠۟ۘۘۚ۠ۚۥۚ۠ۦۗۜ۫ۢۜۘۖۜۦ";
                                continue;
                        }
                    }
                    break;
                case -477113745:
                    z2 = false;
                    str = "ۜۤۙۚۘۘۘۦۡۗۨۗۨۜۤۙۜۘ۟ۛۚ۠۬ۖۘۦ۠ۥۤ۠ۦ۫۠ۛۙۚۨۦۚۘۧۜ۬ۤۚۚ";
                    break;
                case -417733551:
                    textView4.setText(charSequence2);
                    str = "۠۫۫ۧۛۡۘۗۗۖۘۗۤۢۛۗۤۖۖۚ۫ۧۚۙۡ۟ۗۡۤۡۛۢ۬ۥۘۤۖۙۛ۟ۛۦۘۧۚۥۘۘ۫ۙۜۘ۟ۚۜۤۛ۟";
                    break;
                case -345798101:
                case 910296027:
                    str = "ۜ۠ۖۘۛ۫ۜۘۘۡۖۛ۫ۥۘۦۨۦۨۚۡ۬ۚ۠ۦۨ۟ۦ۠ۜ۟ۥۘۖۙ۫ۚ۟۠۠۠۠ۦۨۦۧۡۘ۬ۨۗۙ۬۠ۦۦۧۘۧۘۘۤۦۦۗۧۗۢۖ۟ۜۤ۟ۡ۬ۜ";
                    break;
                case -184037899:
                    str = "ۨۖ۬ۨ۠ۦۥۧۛ۫ۗ۫ۜ۠۟ۨ۟ۖۘۦۥۦۘۚۚۛۛۤۤۛۤۙۨۗۧۤ۠۟ۨ۟ۛۢۨۦ۬۬ۤۤ۟ۨۗ۠ۘۘۚۜۘۘۗ۬۟ۜۖۙۤ۫ۤۙ۠ۖۘۥۦۗۚۙۙ۫ۙۛۜۙۚ۬۬۟";
                    textView = (TextView) this.f25.f1291.m886();
                    break;
                case 28363222:
                    String str5 = "ۢ۟۬۟ۦۘۘۨۥ۬ۘۨۥۘ۫۠ۖۘۧ۬ۨۛ۟ۙۢۜۨۘۛۢ۬ۖۖ۬ۧۨۧۧۦۤ۫ۧۛۚۜ۠ۧۦ۬۬ۨۦۘۤۛۨۘۢۧۥۡ۠ۦ۬ۦۚۖۢۤ";
                    while (true) {
                        switch (str5.hashCode() ^ (-302323143)) {
                            case -239896603:
                                str5 = "۠ۘ۬۬ۨۗۢۥۥۧۢۙ۟ۥۡۘۜۡۧۘۙۛۨۨ۫۫ۙۗۥۘۢۡۧۘۥۘۧۘ۫ۤۦۘ۠ۗۨۘۜۚ۟ۙ۫ۢۡۤۥۘۖ۫ۘۘۤۖۨۘۙۤ۠۠ۢۡۘۜۗۥۘۜ۠ۡۘۡ۫ۡ۟ۖۛ";
                                break;
                            case -82697292:
                                String str6 = "ۤۚۦۘۤۧ۟ۘ۬ۖۘ۫۠ۨۜۦۚۨۙۚ۟ۥۢ۬۬۬۬ۡۘ۫ۨۙۥۘ۬ۗۦۛۛ۫ۥۘ۟ۘۖۘۚۙۘۡۤۜ۠ۦۡ۫ۢۛ";
                                while (true) {
                                    switch (str6.hashCode() ^ (-413619608)) {
                                        case -1518750643:
                                            String str7 = "۠ۚ۫۠ۤۛ۬ۜ۟ۥۥ۬ۘۙۦۘ۫۬ۦۘۘۘۨ۬ۧۖۥۘۤۗۤۚۢۘۢۗ۠ۜۘ۫ۘۦ۫ۘۢۖۤ";
                                            while (true) {
                                                switch (str7.hashCode() ^ 1367692042) {
                                                    case 381806062:
                                                        str7 = "ۢۖۨۘۦۢۜۘۚ۟ۡۧۨۦۤۨۙۥۥۘۤۤ۟ۘۚۚۤۨۘ۟ۖۗۙۥۘۘۜۢۖۡۖۘ۟ۜۥۡۚۖۘ";
                                                        break;
                                                    case 828371485:
                                                        str6 = "ۥۤۦۘۤۧۖۢۘۡ۬ۗۚۘۤۤ۟ۜۗ۟ۧۤۜۜۨۚۙۚۡ۫ۡۡۘۘ۠ۧ۠ۚۗ۠ۚۡۗۤۘۢۛ۠ۦۡۤۤۥۧۘۛۖۙۨۘۥۘۨۦۜۖۨۡۘۨۦۤۤۥۘۢۥۛۖۡۨۘۤۗۥۘ";
                                                        break;
                                                    case 860285262:
                                                        str6 = "۟ۡۖ۫ۢۖۤ۟۬ۚۡۘۘ۟ۗ۫ۛۗ۫ۜۤۥۘۡ۟ۤۙۢ۫ۨۦۧۦۚۚۚ۟ۘۘۥۡۨۨۡۖۘۡۦۘۘ";
                                                        break;
                                                    case 1895434793:
                                                        str7 = this.f24.length() == 0 ? "ۨۧۥۘۥۗۛۘ۬ۥۘۙۚۤۧۤ۟ۥۙۖۘۨۥۘۜ۫ۘۘ۟ۢۜۤۛۜۘ۠ۡۜ۫ۧ۟ۤ۟۟ۡۡۘۗۢۖۘۧۥ۫ۚۘۘۜۦ۠ۗۚۦۘۥۧۚۧۧۘۦ۠ۢۥ۟ۙۦۙ۟۟ۡۘۢۢۖۘۢۛ۠" : "ۙۢۗۙ۠ۥۘۜ۠ۜ۠ۚۜ۟۠ۛۦۘۤ۬ۨۘۦۚۙۘۛۨۘۥۦۘۘۨۤۛۧۖۧۘۨ۟ۜۘۙۖۥۘۘۦۚۦۜ۟ۦۤۨۦۧ۠ۥۛۡۘۧۦۜۢ۠ۥ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -1010026957:
                                            str5 = "۟ۥۘۘۗ۟ۜۙۘ۬ۧۡۧ۬ۦۚۢ۬ۘۨ۬ۡۦۧۘ۫۠ۛ۠ۗۥۘۜۧۛ۠ۨۨۘۧۘۧۘۘ۬ۤۚۜۥۘۢۗۖۖۦۘۛۘۡۖۚۙ۟ۦۙ۠ۜۘۧۛۚۨ۫۬۫۬ۥۘۥ۠۬۟ۦۦۘۤۢۖۘ";
                                            break;
                                        case 1705111501:
                                            str6 = "۟ۦۦ۬ۘ۬ۤۛۦۦۖۗ۬ۛۚۗۛۡۨ۬ۖۢۡۗۖۙۖۧۡۡۗۛۨۦۧۘ۟۟۠ۘۖۘۦۤۥۗۙۖۘۥۤۜ۠ۗۘۘ";
                                            break;
                                        case 1997973314:
                                            str5 = "ۜۜۛۤۡ۠ۨۜۡ۠ۥۜۘ۠۠ۙۤۨۜ۠ۙۙۨۡۥۧۧۨۘۤۢۖۧۛۜۦۤۡۘ۟ۗۨۘۦۤ۠ۗۙۘۘ";
                                            break;
                                    }
                                }
                                break;
                            case 645838191:
                                str = "ۚۢۦۘۥۨ۠ۡۧۥۘ۫ۦۘ۟۟ۚۤ۫ۘۘۡ۬ۚ۟ۙۘۤۛۛ۠۠۟ۡۘۤۙۗۦۤۖۘۤۗۙۗ۫ۡۘ۫ۘۘۗۦ۠ۗ۫ۚۧۡۘۤ۟ۡۘۘ۫ۘ۟ۦ۫ۧ۟ۛۤۗۖ";
                                continue;
                            case 1955733312:
                                str = "ۤ۬ۦۘۜ۠ۘۘ۬ۜۨۡۦۘۗۙۜۥۦۖۖۚۘۘ۠ۗۜۤۗ۟ۜۛۨۡۨۦۖۘۗ۠ۘۘ۟ۥۦۘۙۥ۫";
                                continue;
                        }
                    }
                    break;
                case 40831895:
                    z = true;
                    str = "ۛ۬ۘۘۗۜۨۘۖۘ۫۫۬ۚ۟ۡۧ۬ۡۨۙۡۦۘۨ۬ۜۘۥۙۢۡ۠ۙۥۜۧۘۥۘۛۧۨ۬ۚ۟ۦۘۚۨۦۘ۬ۘۦ۠ۗۛۚۙۛۡۙۗۦۙۙۘۦۡۘۖۤۡۘۛۖۘۜ۫۫";
                    break;
                case 90310118:
                    String str8 = "۟ۙۡ۬ۜۡ۫۫ۥۛۤۨۥۚۨۧۦۡۡۨۘۧۚۚۙۤۘۧۗۙۤۗ۟۫ۢ۫ۛۖۦۘ۬ۦۥۖۡۗۜۜۙۗۛۧۙۛ";
                    while (true) {
                        switch (str8.hashCode() ^ 2056260462) {
                            case -1853183415:
                                String str9 = "۬ۡۖۘۥۗۗۨۚۛۧۥ۫ۛۚۜۘ۫۠ۛ۬ۖۧۘۢۡ۟ۙ۬ۖۘۜ۟ۖۘۥ۠ۦ۟ۗۡۧۘ۟۠ۨۘ۫ۚۤۚ۫۫۟۟ۚۖۢۥۡۚ۠۠ۦ۠ۚۙۢ";
                                while (true) {
                                    switch (str9.hashCode() ^ 227070981) {
                                        case -1213828020:
                                            str9 = "ۛۚۦۘ۠۬ۖۧۦۘۘۥۙۘۖ۬ۖۘۜۡ۠۬۫ۦۘۨۨۘۛۢۦۘۤۙۖۘۡۢ۟ۡۚۦۖۧۨۘۦۚۜۘۨۥۢ۠۠ۦۡۛ۫ۙ۟ۢۨۚۜۙۛۖ۬ۘۘ";
                                            break;
                                        case -1123141005:
                                            str8 = "ۨۡۢۡۢۢۘۛۙ۠ۜۜۘۘۤۥ۬ۡ۬ۡۨۘۛۢۗۨۨۨۘۨۦۡۡۖۨ۟ۢ۠ۧۙۛۢ۫۫۬۟ۥۙۛۜۘۛۦ۠۫ۖۦ۫ۤۨۘۚۖۨۚۡۙۤۖۚۛۙ۬۟۫ۨۘ";
                                            break;
                                        case -451317469:
                                            String str10 = "۟ۧۖۘۗۖ۫۫ۜۨۜ۠۟ۤۖۧۘۨۛ۠ۙ۠ۜۘۦ۬ۨ۬۟ۥۘ۟ۖۡۤ۫ۜۨۚۙۥۧۜۨۧۘۖۖۗ۠ۖۘۦۤۘۘ۠ۨۖ";
                                            while (true) {
                                                switch (str10.hashCode() ^ 6012797) {
                                                    case -1427759786:
                                                        str10 = C0237h4.m864(this.f24, C0341oa.m915(new byte[]{-93, -2}, new byte[]{-114, -49, 30, -78, -21, -41})) ? "۫۠۬ۚ۬۟۬ۖۚۨ۫ۗۥۨۗ۫۠ۨۜۘۜۘۗۛۥۡۜۤ۠ۡۖۥۚۙ۠ۥۥۨ۫ۡۨۚۜۚ۠ۖۧۡۡۢ۬ۖۢۛ۫ۡ۟۫۬ۦۡۘۘۘۢۜۥۛۖۚۘۘۨۡۧ" : "ۧۜۙۜۘۧۧۦۡۘۦۨ۫ۡۡۦۛ۫ۖۘۧ۟ۥۘۘۖ۬ۡۖۦۤۛۥۨ۫ۙ۠ۦۤۛۚ۠ۥ۬ۨۘ۬ۜۡۘ۟ۖۨۖۗۥ۟ۖۨۘۗ۟ۦۧۨۚ۠ۚ۠۫۟ۡۢ۠ۘۘ۫ۥۜ";
                                                        break;
                                                    case -233214920:
                                                        str9 = "ۛۛۜۘۚۢۖۘۗ۬ۢ۫۟ۤۜۗۤ۠ۛۙۧۖ۫ۨۛۡ۫ۛۧۛۢۘۥۦۧۗۙۥۘ۟۟ۥۘۥ۬ۦۘۤۧۛۡۛۦ۠ۖۜۘۙ۫ۜۘ۠ۙۡۧۢ۟۫۟ۗ";
                                                        break;
                                                    case 53410720:
                                                        str10 = "ۘۡۜۗۨۥۘۚۙۙۧۛ۬ۛ۫ۜۨۘۛۤۚۧۡۦ۫ۦ۬ۙۥۢ۬ۢۘۡۨۧۦۘۘ۠ۙ۬ۤۜۦۗ۫ۦۧۛۜۖۙۨۛۜۘ۠ۡۧۘ۟ۥۥۘۖۚۨۘ";
                                                        break;
                                                    case 806524318:
                                                        str9 = "ۤۥۜۘۦۖۙۥۨ۟ۦۧ۟ۘۙۨۘۜۧۖۥ۠۬ۘ۬ۛۢۡۡۚۨۗۢۢۚ۫۟ۦۘۨۤۨ۠۠ۧۧۙۜۦۛۡۧۖۤۡۖۗۨۤۘۨ۟ۧ۬۬ۧۛۥ۟۟ۘۢۗ۬ۧۗۡۡۚۧۛۛۡ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 486245811:
                                            str8 = "ۜۙۨۢ۬ۛۥ۟ۖۖۧۥۡۜۨۦۖۖۘۥۥۗۖۖۘۖ۠ۡۙۦۘۗۤۨۛۘ۠ۨۦ۬ۛۜۘۦۛۜۗۦۧۘۚۛۨۘۢۙۦۘ۫ۗ۠ۤۡۦ";
                                            break;
                                    }
                                }
                                break;
                            case -1548559903:
                                str8 = "ۤۘۢۨۨۧۘۚۢۥۚۜۦۘۛۛۥۨۡۧۘۧۘۖۘ۟ۚ۠ۙ۠ۖۘۜۥۧ۟ۚۘۢۢۚۡۡۗۛ۟۬ۡۙۘۘ";
                                break;
                            case 678975528:
                                str = "ۨۚۜۘ۫ۘۚۚۖ۬۬۫ۡۥ۬ۘۥۤۙۙۖۗ۟ۖۘۦۡۨ۟ۥۧۖۥ۠ۨۘ۟ۦۨ۫ۡۜۘۦۦ۬";
                                continue;
                            case 1561882826:
                                str = "ۘۤۢۘۖۤۘۢۤ۟ۜۧۥۨۘۡۢۧۗ۫۠۠ۗۥۘ۫۫۟ۙۙۘۘۨۜۢۘۡۛۛۢۜۘ۟ۙۚ۟ۛۢۙۚۚ۫۟ۨۗۖۘۤ۠ۤۛۦۡۛۨۨۘۜۖۗۦۢۡ۫ۧ";
                                continue;
                        }
                    }
                    break;
                case 236746687:
                    str = "۬ۢۖۘۙۗۗۗ۬ۘ۫ۜۥۢ۟ۨۘۧۘ۫ۛۙۦۚۥۖۥۦۚۙۘ۟ۦۧۜۙ۟ۘۦۗۨۛۡۥۘۧ۟ۤۙۖۘ۫ۨ۟ۚ۟۫۬ۨۨۙۥ۫۬ۛۙ";
                    textView4 = textView3;
                    break;
                case 299814835:
                    return C0433vb.f1163;
                case 646568703:
                    str = "۠ۜۖۖۚۚۦۗ۫ۥۨۥۘۙۛۖ۠۟ۘۘۚ۬ۦۧۖۘۢۜۧۘۖۧۛۡ۫ۛۡۛۨۘۦۤۤۧۢۛۨۨۧۘ";
                    textView4 = textView2;
                    break;
                case 741425078:
                    strM9152 = C0341oa.m915(new byte[]{-104, -66, -37, -19, 70, 101, -103, -80, -18, -31, 76, 126, -107, -72, -5, -32, 104, 91, -108, -120, -42, -17, 96, 73}, new byte[]{112, 48, 108, 8, -55, -13});
                    str = "ۢۘ۬ۧ۠ۧۢۢۥۗۥۡ۬ۜۖۜۤ۬ۤۘۥۘۚ۬ۖۦۨۤۚ۬ۨۗ۬ۜۘۥ۫ۖۘۥۖۦۡۨۘۚۢۖ۬۟ۨ۠۟ۨۘۢ۬ۥ۠ۚ۠ۗۦۘۘۘ۬ۦۘۛۥۧۙۚ۠ۗۢۡۤۚۜۘ۬ۢۖۘ";
                    break;
                case 938976018:
                    str = "ۧۤۘۨۗۦۘۧۥۨۢۧۥۘۚ۬ۗ۠ۚۙۡۖۘۤۧ۬ۨ۠۟۫ۚۨۘۡۨۧۡۗۢۥ۬ۘ۬۫ۧۦ۟ۦۘ۟ۚ۠ۨۧۡۘۙۜۧۥۡۦۘۘ۬ۜۘۛ۬۬ۜۗ۠۟ۙۦۖ۫ۧۨۡۛۧۥۘ۟ۜ۠";
                    textView2 = (TextView) this.f25.f1291.m886();
                    break;
                case 1241755993:
                    str = "ۡۡۚۘۚۘۧۚۧۢۜۛۥۖ۫ۛۧ۟ۜۨۘۜ۬ۘۘ۟ۨۥۘۗۦۛۧۦ۫ۢۦۘۨۖۙۨ۟ۙۖۚۤ";
                    textView4 = textView;
                    break;
                case 1288010675:
                    str = "ۧۗ۠ۡۤۘۘۤۥۥۘۘۥ۟۟ۖۛۜۡۤۢ۫ۥۖ۟ۡۘۡ۬ۚۤ۫ۢۛۤۙۙۛ۠۠ۙۖۥۘۡۥۢ";
                    break;
                case 1725942874:
                    str = "ۚۦ۫ۤۚۥۘۘۚۛ۟۟۟۬ۛۦۡۧۨۜۛۨۥۥۚۚ۟ۡ۟ۨ۟ۦۜۤۥ۠ۧۖۢۧۙۜۛ۬ۡۘ۠۠ۨۘۥۚۦۘۡۜۤۛۘۜۘۖۨۦۘۜۨ۠";
                    charSequence2 = strM915;
                    break;
            }
        }
    }
}
