package p001;

import android.app.Activity;
import android.content.Intent;
import de.robv.android.xposed.XC_MethodHook;

/* JADX INFO: renamed from: ۟.q9 */
/* JADX INFO: loaded from: classes.dex */
public final class C0366q9 extends AbstractC0335o4 implements InterfaceC0222g3<XC_MethodHook.MethodHookParam, C0433vb> {

    /* JADX INFO: renamed from: ۥ */
    public static final C0366q9 f1048;

    static {
        String str = "ۥۢ۟ۖ۫ۖۘۧۢۙۥۤ۠۬ۤۦۘۖۘۡۜ۫۫ۘۡۘۘۢ۟۬ۨۘۗۜۘۘۛۗۘۦۗۤ۬۟ۨۖۘۛۖۥ۬ۥ۠۬ۘ۬ۙۥ۫ۨۨ۫ۜۘۚۤۖۧۤۦ۟ۧ۫";
        while (true) {
            switch ((((((((str.hashCode() ^ 94) ^ 713) ^ 48) ^ 579) ^ 240) ^ 116) ^ 894) ^ 1681592439) {
                case -1466285014:
                    f1048 = new C0366q9();
                    str = "ۦۨۧۡۘۧۘۚۧۦۗۙۖۡۡۘۢۥۗ۫ۛۥۘۢۘۧ۫ۢۚۥۗۙۧۨۘۤۚۗۘۛ۬ۤۦۘۢ۫ۖۜ۬ۖۚۙۙۡۤ";
                    break;
                case 199332950:
                    return;
            }
        }
    }

    /* JADX DEBUG: Method arguments types fixed to match base method, original types: [java.lang.Object] */
    /* JADX DEBUG: Return type fixed from 'java.lang.Object' to match base method */
    @Override // p001.InterfaceC0222g3
    /* JADX INFO: renamed from: ۥ۟۟ */
    public final C0433vb mo984(XC_MethodHook.MethodHookParam methodHookParam) {
        XC_MethodHook.MethodHookParam methodHookParam2 = null;
        Object obj = null;
        Activity activity = null;
        Intent intent = null;
        String stringExtra = null;
        String str = null;
        String str2 = null;
        boolean z = false;
        boolean z2 = false;
        boolean z3 = false;
        C0325n8 c0325n8 = null;
        C0353p9 c0353p9 = null;
        String str3 = "ۨۤۙۖ۠ۖۥۚ۠ۥۡۛ۟ۜۢ۫ۗۜۘۖۧۘۤۗۨۘۘ۠ۨۘۗۗۙۨ۟ۘۤۡۚۗۡۥۘۘۘۜ۟ۦۨۥ۬ۨۘ۬۫ۦ۟ۛۧ";
        while (true) {
            switch ((((((((str3.hashCode() ^ 389) ^ 468) ^ 123) ^ 482) ^ 603) ^ 532) ^ 786) ^ 691252468) {
                case -2053846149:
                    str3 = "ۜۥۥۙۚۘۡۨۖۨۧۥۦ۬ۡۘۤۙ۫ۦۡۖۘۘۜ۠ۥ۟۬۠۠ۚۥۗ۟ۢۦۥۥۘۘۚۘۜ۠ۡۦ۠ۡۙۙ۬ۜ۟ۜۥۘۡۖۘۚۤۨۘۡۤۡۘ۟ۡۦۘ۟۫ۖۘۜۧۡۥ۟ۙۛۙ۟۟ۗۧ";
                    continue;
                case -1881540662:
                    C0325n8.m1161(activity, c0353p9);
                    str3 = "ۤۧ۟ۙۜۡۡۦۨۘۘۤۗۨۚۦۘۢۛ۟ۙۧ۠ۡ۬۫ۙۛۤ۟ۛ۬ۙۡ۬ۢۨۘۥۜۘۨۗۘۘۚۧۨۘۖۢۙۨۤ۟ۦۥۦۙۢۙۚۡۙۨۙ۠ۘۥۜ۫ۧ۟ۥۧۘ۠ۧۗ۫ۤۜۛۦۖ";
                    continue;
                case -1866520444:
                    str3 = "ۖۘۧ۫۠۫۫ۨۡ۠ۗۨۘۖۧۛ۠ۨۥۙۙ۫ۗۗۛۙۖۛ۬ۧۥۘ۠ۨۧ۫ۡۘۧۘۜۘۤۛ۟ۛ۟۫ۛۘۘۤۤۘۘۚۘۦ";
                    str2 = stringExtra;
                    continue;
                case -1605812012:
                    break;
                case -1542546509:
                    c0325n8.getClass();
                    str3 = "۠ۛ۠۫۟ۧۗۦۖۡۚۨۘ۠ۚۧۡۦۥ۠ۦۧ۫۫ۖۘۡۚۤۘۧۨ۠ۧۘۘۚ۟ۛۧۚ۫ۡۛۥ۫ۛۘۘۨ۠ۛۘۛۘۘۧۦۜۘ";
                    continue;
                case -1536760906:
                    str3 = "ۤۧ۟ۙۜۡۡۦۨۘۘۤۗۨۚۦۘۢۛ۟ۙۧ۠ۡ۬۫ۙۛۤ۟ۛ۬ۙۡ۬ۢۨۘۥۜۘۨۗۘۘۚۧۨۘۖۢۙۨۤ۟ۦۥۦۙۢۙۚۡۙۨۙ۠ۘۥۜ۫ۧ۟ۥۧۘ۠ۧۗ۫ۤۜۛۦۖ";
                    continue;
                case -1438031587:
                    stringExtra = intent.getStringExtra("static_image_url");
                    str3 = "ۛۖۥۘۡۨۦۘ۟ۧۧۘۥۖۡۙۜۖۚۡۘۡۧۜۘۘۨۘۛ۟ۤ۫ۥۜۦۨۘۘ۠ۡ۬ۦ۠۫۠ۧۦۘۧ۬ۗۦۡۘۡ۬ۦۡۥ۫ۜ۟ۘۘۧۤۘ۫";
                    continue;
                case -1219788758:
                    str3 = "ۜۥۘۘۗ۟ۡۖۚۥۘۢۙ۬۟ۗۦۙ۟ۥۥۘۘۘۜ۟ۦۘۛۡۨۚ۫۬ۦۛۖۛۜۖۘ۟ۤ۬ۜۤۡۘۧۗ۫";
                    continue;
                case -1008169121:
                    String str4 = "ۧ۬۟ۜ۠ۦ۫ۦۜۦۚۡۚۜ۟۠ۘۦۘۜۡۛۘۤۜۘۥۛۤ۫ۦۚ۠۟۠ۤ۬۠ۜۦۘۨۡۤۧ۫۫ۗۧۢۜ۠ۧۘۜ";
                    while (true) {
                        switch (str4.hashCode() ^ 845295540) {
                            case -510208989:
                                str3 = "ۥۨۚۘۖۜۘ۠ۜ۬ۡۢۥۘۙۖۦۧۜۖۘۖۜۘۘۗۖۛۜۡۥۘۗۛۨۘۥۜ۠۟ۗ۫ۘ۫۬ۤۧۥۘ";
                                continue;
                                continue;
                            case -173433657:
                                str4 = "ۛۢۢۤۖ۬ۦۧۥۢ۫ۗۛۢۜۘ۬ۛۨۘۘۥۥۘۙۢۦۘۥۙۥ۟ۤۙۙۤ۫ۚۛۨۡۤ۟۟ۛۢۡۚۤۖۘۘۧۙۚۗۖ";
                                break;
                            case 1705823320:
                                String str5 = "ۢۢۙ۟ۦۢۖۡۡۛۤۗۘۙۜۤۨۘۙۨۘۘۦۗۢۨ۫۬ۙۜۧۨۡۖۘۚۦ۠ۘۘۖ۫ۘۘۘ۠ۘۦ۬۟ۛ۬ۗۤۥۤۥۘ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-906235202)) {
                                        case -1997177073:
                                            str4 = "ۢۦۡۤۗۧۛۥۗۖۘ۠ۥۤۚۖۥۨۜۨ۟ۛ۫ۗۤۜۘۗۛۛ۠ۤۘۢۗۗ۠ۥۤۘ۟۠ۜۥۖۥ۠ۦۘۚۚۙۧ۠ۨ";
                                            break;
                                        case -1919031503:
                                            str5 = "ۦۦۖۘۘ۫۟ۖ۠ۛۨۜ۠ۨۧۜۨ۠ۜۘ۫۠ۨۘۖۜ۠ۧۡۖۘۗۦۡ۫ۡۤۚۜۥۥۨۚۗۙۚ۫ۧۡۘۗۤۢۥۤ۫ۨۦۨۚۗۘۘۛۦۧۘۦۨۦ۠ۙۢ۫ۡۥۘ۟۬ۨۘۗ۫ۜۘۢۛۡۘ۬ۚ۟";
                                            break;
                                        case -1745982077:
                                            String str6 = "ۜ۟ۦۘۤۡۡۘۚۤ۠ۡۘۦۘۘ۟ۖۘۜۛۦۘۡ۟۠۟ۥۘۢۘۦۥ۠۬ۖۘ۠ۚۖۧۘ۠۠۟ۧۖۤۡۗ۬ۧۙ۠ۨۜ۬ۛۜۡۘۜۤۨۙۥۗۗ۠ۦۘۛ۠ۘ۟ۤ۠ۥۖۗ۫";
                                            while (true) {
                                                switch (str6.hashCode() ^ 1065605736) {
                                                    case -422264244:
                                                        str5 = "ۤۤۧۘۥۡۛۘۘ۬ۢۨۤۢ۟ۥۥۨۜ۫ۘۢۤۧ۟ۡ۠ۘ۠۟ۚ۫ۜۚۙ۬۟ۤ۟ۢۥۘ۟۫ۨۦ۫۬ۥۧۢۢۛۗۧۘۘۘۘۡۧۘ";
                                                        break;
                                                    case 309484024:
                                                        str5 = "۠ۜۛۨۤ۠ۧۨۛۦۨۖۛۨۛۜ۫ۚۧۗۡۘ۬ۙۛۤۤۚۦۜۦۘ۟ۢۜۨۜۨۘۙۡۚۜۜ۬ۘۨ۟";
                                                        break;
                                                    case 1208313407:
                                                        str6 = "ۗۧ۬۫ۦۢۗۜۤ۠ۙۦۤۜۖۘ۫ۙۜۗ۠ۘۘۥ۟ۦۘۜۨ۫۟ۛ۟ۙۨۘۘۢۡۗۦۜۜۜۨۗۢۘ";
                                                        break;
                                                    case 1980113539:
                                                        str6 = intent != null ? "ۖۙۙۥۖۧۘۡۛۨۘۜۘ۫ۥۨۚۙۘۨۘ۫ۦۥۙ۬ۥ۫ۨۡۥۜۡۧۡۘ۬۫ۦۗۥ۬۬ۘۖۛۧۧ۬ۡۦۘۤۖۛۚۧۨۙۖۧ۟ۨۥۡۧ۫ۜۨۛۛۡۗۥۨۡۘ" : "ۗۙۥۘۛۙۖۙۘۗۗ۫۬ۗ۬ۡۘۤ۫ۖۨۗۤ۬ۖ۟ۗۖۥۘۨۚۦۘۖ۟ۡۘۗۘۤۥۘۖۘۧ۠ۧۥۘۧۙۨۘ۫۠ۜۨۦۡۘۚۙۡۗ۠ۗۛۖۦ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -295256050:
                                            str4 = "ۚۙۨۙۘ۫ۚۜۜۨ۫ۜۘ۬۟ۖۖۙۤۜ۬۠۟ۡۘۤ۫ۥۘ۬ۘۨۨ۬ۥۡۙۦ۟ۘۤ۟ۡۧۗۙۗۘۗۦۘ۟ۡۖۘ۫ۙۜ";
                                            break;
                                    }
                                }
                                break;
                            case 1728578518:
                                str3 = "ۜۡۚۧۛۖۘۙ۬ۦۘ۬۬ۜۥۥۖۦۘۦۘۖ۫ۗ۫ۖۨۘۤ۫ۘۘۨۚۛۚۨۡۘۛۤۖۘۜۤۨۗۖۥۘۙۡۗۧۦ۬ۙۖۤۚۥ۬ۛ۟۬ۗۜ۠ۚۤ۠";
                                continue;
                        }
                    }
                    break;
                case -997820137:
                    str3 = "ۜۥۘۘۗ۟ۡۖۚۥۘۢۙ۬۟ۗۦۙ۟ۥۥۘۘۘۜ۟ۦۘۛۡۨۚ۫۬ۦۛۖۛۜۖۘ۟ۤ۬ۜۤۡۘۧۗ۫";
                    str2 = str;
                    continue;
                case -997500538:
                    intent = activity.getIntent();
                    str3 = "ۦۙۙ۟۫ۗۡۧۛۥۛۦۖۨۘۘۛۥۤۨۡۧۘۥۗۘۘ۬ۡۥۨۙۜۗۨ۬۠ۗۜۘۡۧۦ۬ۤۨ۫ۡۘۦۘۤۡۚۖ۫۫۬";
                    continue;
                case -686698799:
                    obj = methodHookParam2.thisObject;
                    str3 = "ۤۛۡۙۗ۟ۖۚ۬ۜۢۗۙ۠ۛۚ۬۠ۗۨۛۨۖۢۖۚۨۘۘ۟۟۟ۡۜۖۗ۠۠ۘۘۢۧۡۘۗۜۦۨۨۘۦۜۢۙۗۤۚۖۦ۟ۛۢۛۛۥۘ۟ۜۙ۬ۤۘۘ۠ۜۥۨۘۗۚۚۚ۫ۡ";
                    continue;
                case -659967801:
                    C0237h4.m1090("it", methodHookParam2);
                    str3 = "ۙ۫ۜۘۡ۫ۚۙ۠ۡۘۖۤۥۗۜۜۘ۫ۜۨۘۦۥۦۘۙۚۖ۬ۜۖۘۜ۬۠ۦۡۖ۬ۚۢۘ۬۬ۥ۫ۨ۫ۦۚ۬ۤۦۡۢۡۘ۟۠ۥۘۗۥۥۢۙۤۖۥۥۡۛۡۘۧ۫ۦۘۛۘ۬ۗۛۜۘ۬ۥۥ۫ۨ";
                    continue;
                case -569783995:
                    c0325n8 = C0325n8.f994;
                    str3 = "ۥۚۧۤۧۜۘۤ۫ۘۙۜۖۥۡۖۨۖۨۘۙۚ۟ۛۗ۬ۛ۫۬ۙۥۜۘۙۡۨۘۥۧۗۘۡ۟ۨ۬ۚۥۘۤۦۢۛۘۥۥ";
                    continue;
                case -170349935:
                    str = null;
                    str3 = "ۡ۟ۦۦۨۚۖۧۨۧۢۦۦ۟۟ۤ۟۬۟ۗۜ۟۟ۖۢ۟ۤۨۢ۫ۦ۫ۡۥۘۗۢۨۘۤۥۙ۟ۤۦۘۥ۠۠۠ۤۧۥ۫۫۬ۜۦ۫ۦ۬ۦ۟ۜۘۥۦۛۙ۬ۤ۠۟ۡ۫ۥۨۘ۬ۦۙۗۜۘۘ";
                    continue;
                case -82877900:
                    C0237h4.m1088("null cannot be cast to non-null type android.app.Activity", obj);
                    str3 = "ۡۢۢۥ۠ۜۘ۟ۢۥۙۤۡ۬ۚۨۘۚۘۦۥۘۜۦ۠ۥۘۜۛۚۘ۠ۦ۫ۗۗۖۨۥۘۦۜۛۜۨۜۘ۠ۗۤ";
                    continue;
                case 240861750:
                    str3 = "ۡۨۗۚۛۘۜ۠ۡۢۜۗۧۨۧۘ۫ۚۡۘۡ۟۫۫ۥ۫ۦ۬ۧۡۛۦۘ۫ۜ۫ۨۘۡۜۤۦ۟ۖۘۛۚۙ";
                    continue;
                case 305268564:
                    str3 = "ۡۧ۠۬ۧۡۘۜۜۥۘۡۥۨۚ۠ۡۚ۟ۖ۫۬۫ۨۥۖۡۥۘ۟ۛۨۢۚۡۢۦۥۘۨ۟ۨۘۗ۠ۙۜۢ۟ۤۙۙۦۥۙۚ۟ۘۘۚ۬۬ۛۢۤ۠۬ۜۙۙۘۥۤۚۙۥۚ";
                    activity = (Activity) obj;
                    continue;
                case 911175238:
                    String str7 = "ۤۙۘۘۜۗۘۛۖۢۡۙۤۜۖ۠ۢۧۚۧۘۡۤۖۤۡۘۘۚ۟۠ۘۨ۫ۤۙۦۥۘ۠ۛۦۚ۠ۥۘۖۛۚۛ۠ۜۚ۟ۨۥۤۥۥۦۖۘۢۘۥۘ";
                    while (true) {
                        switch (str7.hashCode() ^ 2013062791) {
                            case -1998008015:
                                str3 = "ۧۨۙۨۨۤۖ۠ۗۖۜۨۖۗۜۘۗۢۛ۠ۢۡۘ۠ۜۡۚۚ۠ۦ۠ۖۧۡۗۙۚۛۜۚۙۙ۫ۛ۟۠ۥۘ";
                                continue;
                            case -1510160557:
                                String str8 = "ۙۢ۟۟ۥۘۘ۠ۛ۬ۜۘۛ۫ۢۤۢۨۘۨۜۨۘۜۧۖۚۥۦۢۢۧۧۢۦ۟ۘۡۘۗۘۤۚۡۡۘۡۜۜۛۢ۫ۥۥۘ۬ۙۡۘۙۘۧۨۚ۫ۦ۟ۙ";
                                while (true) {
                                    switch (str8.hashCode() ^ (-1502525769)) {
                                        case -1068274625:
                                            str7 = "۟۟ۘۧۨۜۗ۫ۤۚۨۛ۠ۖۥۘۦۤۛ۠ۦۗۖۢۡۘۘ۟ۨۖ۠۠ۖۢ۟۫۠۟ۨۧۖۘۛ۬ۤ۟۟۠";
                                            break;
                                        case -953065225:
                                            String str9 = "ۥۚۦۛ۟ۘۘۢۙ۠۟ۘۘۨۛۥۘۖۨۡۘۜۘ۟ۢ۫ۨۘ۬ۚۜۡۜۘۘۤ۟ۜۘۜۘۧۛۛۤ۠ۦۘۖۡۗۗۦۖۢۚۦۘۥۚۡ";
                                            while (true) {
                                                switch (str9.hashCode() ^ 852585056) {
                                                    case -719948946:
                                                        str8 = "۠۫ۡۘ۠ۦۘۘۨ۫ۥۙۢ۠ۢۦۧۧۗ۟ۦۜۧۘۖۨۛۘ۟ۤ۟ۨۧ۬ۗ۫ۚۧۡۧۨۛ۫ۢۖ۟ۘۢ۬ۦۡۘۧۥۢۙۙۥ";
                                                        break;
                                                    case -494080279:
                                                        str9 = "ۦ۠۬ۢۘۨۡۦۧۤۡۘۡۤۤۥۤۨۘ۠ۨۨۘۡۦۛۦۢۦۘۗۧۨۘۦۛۦۘۗۜۚۤۦۗۗۘ۠ۡۧۘۘۧۖۘ۟ۢۧۧۢ";
                                                        break;
                                                    case 1516394732:
                                                        str9 = str2.length() == 0 ? "۫ۢۛۗ۫ۢۥۘۤۖۖۡۦۜۨۘۗۥۜۜۘۖۤۨ۬ۤۘۨۚۧۙۧۡۘۤ۟ۡۘۢۦۦۚۗۦۘۘۢۨ" : "ۚۚۘۘۗۖۦۘۚۨۘۘۡۤ۠۠ۥ۟ۥۦۦۥۥ۟ۗۥۘۜ۠۠ۘۢۖۘ۬ۛۘۘ۠ۥۤۗۙۛۧۡ۠ۨۦۢۗۖۗ۟ۛۛۘۡۗ۬ۦۙۘۦ۟۫۫ۛۜ۫ۥۚۨۘ۟ۤۤ";
                                                        break;
                                                    case 1558358271:
                                                        str8 = "ۨۗۚۡۧۗ۫۟ۨۤۥ۟۟۟ۗ۫ۡ۟ۢۢ۬ۖۥۘۢۙ۬ۥۧۥۡۘۜۢۗۥۨۖۧۘۡ۬ۘۖ۠۠ۢۗۛۢ۟ۜۡ۠ۨۘۦ۟ۜۘۛۡۗ۟ۛۦۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -714904459:
                                            str8 = "ۢۗۡۘۙۘۙ۫ۤ۫ۘۡۡۘ۠۫ۖۘۥ۬ۧۡۛۨۖۢۨۘۙۘۦۛۢۜۦۢۚ۫ۢ۟۟ۘۘۧۡ۠۬۬ۡۢۛ۟ۛ۫ۚۦ۫ۡۘ";
                                            break;
                                        case 265606000:
                                            str7 = "ۦ۫ۨۡۥۚۦۖۗۖۨ۬۠ۘۜۚۤ۬ۙۥۚۖۚۡۜۥۧ۬۫ۜۘ۬ۡۧۘۨۡۘۙۢ۠ۛ۠۬۠۠ۘۢ۠۫ۗۨۦۘۙۢۦ";
                                            break;
                                    }
                                }
                                break;
                            case 195019325:
                                str3 = "ۚۨۢۡ۟ۢۗ۟ۧ۫۬ۖۘۖ۟ۦۢۨ۫ۡۦ۬ۘۢ۠ۗۡۙۗ۠ۦۘۤۛۖۘۖۖۛۜۦۘۙۤۚۨۧ۫ۦۜۥۘۙۜۨۖۡۦ";
                                continue;
                                continue;
                            case 1048209189:
                                str7 = "۫ۤ۬ۖۤۨۗۨۥۤ۫ۥۘ۬ۦۦۘۚ۠ۤۥۤۛ۠ۗۧ۟ۨۨ۟ۜۙۖۤۘۘۖۖ۫۟ۧۢۧ۠ۨۤۨ۟۫ۨۜۗ۫۟ۧ";
                                break;
                        }
                    }
                    break;
                case 1125636339:
                    String str10 = "ۤۘۧۜ۫ۦۦ۟۬۬ۥۘ۫ۡۢۢۡۦۘۘۤۚۨۜ۠ۢ۬ۨۘۦۦۨۜۗۘۘۧ۟۟۫ۢۥۘۖۧۥۘۨۥۡۘ۫ۢۘۘ۠ۘۜۘۛ۬ۨۘ";
                    while (true) {
                        switch (str10.hashCode() ^ (-1706325365)) {
                            case -2145394516:
                                str10 = "ۦۢۧۧۨۜۘۚ۟۫ۙ۠ۥۘۢ۟ۘۘۦۖۘۦۡۙۙۡۘۘۖۗۨۘ۫ۨۘۘۖۛۗۛۥۥۘۤۤۜۖ۟ۧۛۜۜۘ";
                                break;
                            case -1756367930:
                                str3 = "۫ۧ۟ۖ۠۠ۢۥۤۚ۬ۡۨۧۖۘۡۥۘۘۜۚۦۢۖۥۘۡۚۛۘ۫ۦۘۤۤۢۦ۬ۤ۟۟ۡۘۖ۠ۦۥۘۘ۫ۜۦۜۙۨۘۜۥۙۨۗۗۡۦۜۘۜۦ۟۫۬ۘۘۦۘۘۖۧۙ";
                                continue;
                            case -845047700:
                                str3 = "ۨۛۨۘۤ۠۫ۨ۟ۙ۟ۙۖۘۚۖۨۙۜۦۘۙۖۘۥۡ۬ۛۦۨۘۨۖۗۦ۟ۨۘۨۘۖۜ۟ۜۢ۫ۗ۟ۤۜۘۛ۟ۙۛ۫ۜۘۚۦۘۘۥۗۚ۫ۗ۟ۨ۟ۢۗۢۜۘ۫ۖۜۘۡۛ";
                                continue;
                                continue;
                            case -47460228:
                                String str11 = "۠ۖۧۥۢۧ۬ۤۨۙۘۗۦۛۜۦۡۢۢۨۘۙۘ۫ۡۖۙۖۗۤۚ۫ۦۘ۟ۚۦۘۛ۫ۛۦۥۥۘۜۧۨۤۚۡۗۚ۠۠ۘ۬۫ۨۨۙۥۛۧۛۧۨۨۢۙۙۖ۠۠ۛ";
                                while (true) {
                                    switch (str11.hashCode() ^ 819563505) {
                                        case -1163439007:
                                            String str12 = "ۖ۫ۜۘ۫ۦۡۘۘۚ۬ۜ۟ۖۤۦۤۡ۫ۧۧۙۜۖ۫ۨۚۙ۫ۙ۠ۨ۠ۚۤۥۛۨۘۨۖۚۨۚۖ۫۟ۡۢۙۘۡۚۧ۠۬۬ۗ۠ۧۨۦۡۥۡۥۘۛۙۖۘ۠ۧۡۘۡۘۖۘ";
                                            while (true) {
                                                switch (str12.hashCode() ^ (-1224031789)) {
                                                    case -1846756138:
                                                        str11 = "۫ۙۡۘۡۡۤۥۜۘۘۨۛۜ۬۠ۢۡۤۖۘۢۚۗۘۘۤۨۡۜ۠ۖۘۧۖۘ۟ۘۛۨۤۡۘۡ۟ۡۘۖۦۜ";
                                                        break;
                                                    case -1153126615:
                                                        str11 = "ۛۙۖ۠ۗۡۤۧۨۘۡۚۖۖۚۘۘۗۙۜۘۖۖۦۗ۟ۢۡۡ۠۬ۜۚۗۛۨ۫ۖۜۨۖۧۚۢۦۖۖۘۥۚۢۚۜۘۧ۬۟ۡۡۘۗۦ۠ۡۛۖۘۥۙۡۧۘۘۘ۫ۡۜ";
                                                        break;
                                                    case -810269019:
                                                        str12 = "ۥۧۖۗ۠ۗۚۛ۫ۢۤۥۤۢۘۘ۬ۧۨ۠ۚۛۙۚۧۥۤۡ۬۠ۤۡۨۦۢ۠۫ۖۘۧۦۧۥۧ۬۟ۨۚۖۥۨ۠۬۫ۗۡۘۨۥۧۦۚ۬ۗۡۥۨۛۡۘۛۙۢ۬۟ۨۘ۫ۢۡۚۙۦ";
                                                        break;
                                                    case 761697639:
                                                        str12 = z3 ? "ۢ۫ۜۘۨۛۧۢۗۦۛ۬ۡۘۨ۠ۢۢۜۘ۬۠ۧ۬ۥۥۥۤۦۘۗۘۚۙۘۨۘۥۢ۟ۜۖ۬ۘۦۘۨ۫ۧۧۗۥۘۜۚۧۘ۟ۙ" : "ۤۨۖۛ۟ۖۗۚ۠ۤۙ۟ۜۗۖۛۙۧۖۛۢ۟ۘۤۚۙۧۧۛۦۘ۠۬ۧۡۤۨۨ۬ۦۘ۫ۨ۫ۛ۫ۥۗۚۢۜۛۨۘۜۖۖ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 375378710:
                                            str11 = "ۚۥۗ۠۟ۧۦۦۨۘۦۚۚۙۘۗۦۧۜۤۥۨ۬ۗ۠۬ۦۧۙۛۨ۬ۜۨۚۦۘۤۧۘۘۧۗۨۘۘۤ۠";
                                            break;
                                        case 633730952:
                                            str10 = "ۛۛۜۢۗۖۡۜ۟ۡۘۦۘۚ۟ۢۛ۬۠۟ۗۛ۟ۚ۠ۗۛۡۘۧۥۡ۬ۚۦۤ۬ۤۡۘ۬ۥۜۘۢۗۤ۫ۤۜۘۤ۟ۡۘۛۥ۫";
                                            break;
                                        case 1799875249:
                                            str10 = "۬ۜۥۡۤۖۘۧ۠ۚۡۘۡۘۙۛ۬ۚ۫۬ۛ۫ۛۡۙ۟ۨۜۧۘۚۘۦۘۚۢۡۘۤ۬ۛ۬ۦۛۢۢۜ۟۠۠";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1159669743:
                    str3 = "ۗۢۖۗۜۛۨۦۢۗۧۤۗۨۦۦۛۦۘۥۡۚۜۥۘۘ۠۬ۨۦۧۘۙۦۘۧۚۢۧۨ۬ۤ۠ۨۤ۬ۥۘۜۧۨۘۦ۫ۤۗۢ۠";
                    continue;
                case 1214056486:
                    return C0433vb.f1163;
                case 1469947432:
                    z = false;
                    str3 = "ۜۗۘۢۢۡۦۛۦۘۗۗۖۨۦ۠ۛ۫ۗۖ۫ۢۜۘۚۘۡۘۛۤۦ۬ۗۡۨۗۖۧۘۚۤۡۙۧۦۤ۬ۨۘ۠ۥۥۘۢۧۦۘۡۥۦ۟ۜۜۙۦۚ";
                    continue;
                case 1766706742:
                    str3 = "ۨ۬ۢۜۦۦۘ۬۟ۙۚۢۢۘۜۖۘۥۜۘۘۧۚ۟ۜۚۖ۬ۛۤۜۨ۠ۥۚ۠۬ۦۨۘۗۡۘۤۥۛۦۥۘ";
                    z3 = z;
                    continue;
                case 1796574749:
                    str3 = "ۗۢۖۗۜۛۨۦۢۗۧۤۗۨۦۦۛۦۘۥۡۚۜۥۘۘ۠۬ۨۦۧۘۙۦۘۧۚۢۧۨ۬ۤ۠ۨۤ۬ۥۘۜۧۨۘۦ۫ۤۗۢ۠";
                    z3 = z2;
                    continue;
                case 1797021111:
                    str3 = "ۤ۟ۡۦۚۡۘ۠ۘۤۙۘۗۜۧ۫ۤۤۤۘۗۧۦ۬ۙۥۡۚ۠ۤۡ۠ۜۢ۫ۡۘۦۘۧۥۜۢ۫ۦۚۨۗۨۧۗ۫ۡۗۡۦۗۖۘۗۙۜۖۘۧۘۘۗۜۢ۠ۨۘۛۗۦۘ";
                    methodHookParam2 = methodHookParam;
                    continue;
                case 1909494168:
                    String str13 = "ۖۜۘ۠ۧۧۚ۬ۡۘ۬ۦۨۛۘۗۘۗ۬ۥ۬ۚۦۛ۬ۗۧۡۛۡۘ۫ۚۘۦۤۥۘۦ۬ۜۘۚۜ۫۠ۗۚۗۛۡۤۡۨۘۙۗۦ۬ۦۡۡۙ۫ۜۗۨۘۗۚۜۡۜۧ۠ۘۖ";
                    while (true) {
                        switch (str13.hashCode() ^ (-653088632)) {
                            case -1837793047:
                                str3 = "ۜۙۡۘ۠ۡۧۘۜۨۨۛ۟ۨۛۛۡۖۤۘۘ۟ۚ۟۟۠ۙۨۛۢۦۘۜۘۗۗۦۚۤۚۨۧ۟ۡۤۢۘ";
                                break;
                            case -1253119049:
                                str13 = "ۛ۫ۥۦ۠ۜۧۖ۟ۢۦۘۜ۬ۥۘۥۚ۬ۙۨۘۜۥۜۖ۫ۨۘ۫ۗۤۨۨۨۡۜۘ۫ۡۤۘۢۖۨۤۥۜ۟ۥ۟ۗ۟ۚ۫ۧ";
                                break;
                            case -553498769:
                                break;
                            case 944538375:
                                String str14 = "ۡۦۜۘ۟ۧۘۖ۠ۢۗۚۨۨۘۥۘۜ۬ۧ۠ۤ۫ۖ۟۫ۜۨ۠ۧۦۦۘۜ۫ۨۘۖۥۘۢۦۦۘۡۡ۠ۢۨۗ";
                                while (true) {
                                    switch (str14.hashCode() ^ (-1521393277)) {
                                        case -829310405:
                                            str13 = "ۤۙۥۥۛۥ۠ۡۗ۟ۤۥۘۨۙۙۚۙۛۥ۫ۨۘۨۚۘۨۖۖۘ۟ۡۦۢۨۥۡۨ۫ۜ۠ۧۧۤۢۜۥۖۥ۬۠۠۠ۦۦۜ۬ۖۜۜۨۡۥۘ۬۬۟";
                                            break;
                                        case 1336416363:
                                            str14 = "ۢۗۤۦۛ۠ۙۥۢۢۥۜ۬ۛۚۛۥ۬۟ۨۘۤۛ۟ۜۡۘۖۗۜۘۦۖۦ۠ۡ۠ۙۧۗۡۗۦۘۡۜۢۚ۠ۖۙۥۘۚۧۚۧۜۘۜۙۡۜ۬ۗۨ۟ۥۚۧۥۢۙۖ";
                                            break;
                                        case 2110539875:
                                            str13 = "ۧ۬ۖۘۚۖۖۘۜۡ۟ۡۥۘۙۥۦۘۜۧۥۦۧۘۛۡ۫ۡ۠۠۫ۛ۟۫۠۟ۢۡۧۘۧۖۛۥ۫۫ۖۢۥ";
                                            break;
                                        case 2115608572:
                                            String str15 = "ۖۛۡۘۦ۬ۘۗۦۚۤۙۖۘۨۘۡۡۘۢۙۖۤ۬۬ۛ۟ۚۧۛۤ۠ۦۥۘ۬۟ۦ۠ۤۡۢۤۛ۟ۖۥۘۜۦ۫ۖۧۤۘۜ۬ۤ۠۫۟ۡۥۢ۫ۥۗۛۤۦۙۙۗۙۦ۠ۡۘ۬۠ۡۤۗۦۘ";
                                            while (true) {
                                                switch (str15.hashCode() ^ (-42913323)) {
                                                    case -2142439433:
                                                        str15 = str2 != null ? "۫ۙۡۘۧۛۡۢۨۥۘۗۤۧۥ۠۟ۚ۠ۘۙۚۘۖ۬ۦۨۗۧۚۥۦۘۖۧۡۘ۟ۗۦۦ۟ۘۡۢۛۚ۫ۚ۬ۡۥۥۖۢ۫ۧ۬ۛۖۖۘۤۤۜۗۜ۬ۛۡۦۘۥۘ۫ۤ۬۠ۖ۟ۤ۬۬۠ۨ" : "۟ۙۙۨ۟ۡ۫ۖۛۛ۟ۥ۬ۢۦۘۛۚۘۘ۬ۥۨۘۡۨۧۘۥۥۘۢ۠ۦۘۨۦۙۛۡۚ۫۠ۥۖۥۤۗ۫ۚ۟۫ۡۤۨۧۘۢۗۗ";
                                                        break;
                                                    case -1303577678:
                                                        str14 = "۠ۨۖۘ۬۠ۖۘۙۜۦۘۛۖۦۘۖۡۜ۠ۧۧ۫ۜ۠ۨۨۘۙۦۛۧۡ۠ۤۡۗۦۚۦ۟۫ۘۖ۟ۘۘۛۨۦۙۧۢۥۗۖۘۛۢۜۘ۫ۜۧ۠ۦۧ۠ۛۛ۬۫ۡۘۨۚ۟ۡۦ۬";
                                                        break;
                                                    case -154332215:
                                                        str14 = "ۚ۫ۡۘۧۗۙ۠ۧۜۘۥ۠ۥۧۥۜۨۗ۬ۨۨ۠۟ۡۙۜۖۘ۫ۡ۫ۧۛۛۦۨۖۤۜۖۨۖۚۧۧۚۡۧۨۛ۠ۖۥۚۨ";
                                                        break;
                                                    case 660883460:
                                                        str15 = "ۨۗۦۤ۟ۦۘۧۖۢ۫۠ۙ۫ۡۘ۫ۙۗ۠ۛۘ۠۫ۥ۠ۨ۬ۙ۫۠۟ۦۡ۬ۨۘۦ۠ۡۤۨۡۘۗۘ۬ۜۛ۫ۚۥۥۙۙۖۘۥۚۙۜۥ۫ۨۦۦۙۚ۠ۧۡۖۖۖۘ۫ۦ۬ۢۦۛۦ۫ۡ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 2091133947:
                    c0353p9 = new C0353p9(str2);
                    str3 = "ۥ۬ۥۚۡۡ۟۫ۙۘۧۥۘۦۙۚۧ۟ۦۘ۠ۨۘۖ۟ۜۚۖۘۖۥۦۘۢۦۘۡۙۡۡۜۖۘۨۙۤۜۙۨۘ";
                    continue;
                case 2130397218:
                    z2 = true;
                    str3 = "ۤۨۘۨۛۨۧۛ۠ۤۡۜۛۥ۬ۖۜۢۡ۟ۥۘ۟ۖۗ۫ۛۨۗۡۦۤۨۘۢۥۘۘ۫۫ۥۥۘۙۗۖۗۘۜۘۡ۫۫۠ۚ۠ۦ۟ۨۧۢۘۘ۟۠ۧ۠ۚۖۜۘۘۙۦۙ";
                    continue;
            }
            str3 = "۠ۥۜۖۤۚۛۥ۫ۥۙۦۘۗۨۙۛۦۥۘۢ۠ۜۘۛ۟ۜ۫۠۫ۤ۬ۢۗۖۥۘۜۖۖۡۛۡۘ۟ۨۥۘۥۨۚۨۤۛۡۤۢۛۤۤ۠ۖۧۘۗۧۨۘۡ۫ۡ";
        }
    }
}
