package p001;

import android.view.View;
import android.webkit.WebView;
import android.widget.EditText;
import android.widget.TextView;
import com.skyhand.hookhand.dialog.view.SwitchButton;
import com.skyhand.redbookhelper.MainActivity;
import p001.C0371r1;

/* JADX INFO: renamed from: ۟.q1 */
/* JADX INFO: loaded from: classes.dex */
public final /* synthetic */ class ViewOnClickListenerC0358q1 implements View.OnClickListener {

    /* JADX INFO: renamed from: ۥ */
    public final int f1037;

    /* JADX INFO: renamed from: ۥ۟ */
    public final Object f1038;

    public /* synthetic */ ViewOnClickListenerC0358q1(int i, Object obj) {
        this.f1037 = i;
        this.f1038 = obj;
    }

    @Override // android.view.View.OnClickListener
    public final void onClick(View view) {
        int i = 0;
        int i2 = 0;
        boolean z = false;
        InterfaceC0208f3 interfaceC0208f3 = null;
        AlertDialogC0403t7 alertDialogC0403t7 = null;
        AlertDialogC0168c5 alertDialogC0168c5 = null;
        EditText editText = null;
        String string = null;
        boolean z2 = false;
        boolean z3 = false;
        WebView webView = null;
        SwitchButton switchButton = null;
        TextView textView = null;
        int i3 = 0;
        int i4 = 0;
        C0371r1.b bVar = null;
        C0344p0 c0344p0 = null;
        InterfaceC0222g3<? super C0344p0, C0433vb> interfaceC0222g3 = null;
        C0430v8 c0430v8 = null;
        InterfaceC0208f3<C0433vb> interfaceC0208f32 = null;
        String str = "ۡۨۡۛۡۦۘۚۜۛۗۧۘۙۢۗۚۘۥۘۦۖۘۘ۟ۤۦۘۜۗۥۘۜۗ۠۠۠۠۫۟ۦۢۥۧۧۘۡۜۦ۠ۧۘۨۖۢ۬ۛۖۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 216) ^ 289) ^ 856) ^ 79) ^ 746) ^ 19) ^ 51) ^ (-1123523398)) {
                case -2128738946:
                    str = "ۜۡۨۘۢۢۤۛۙ۠ۢ۟ۥۘۜۘۧۘۜ۬ۖۘۡۨ۟ۙۘۘ۟ۢۜۜۖۘۢۚۤۙۗۤۘۙۥۘۨۡ۫ۚۤۜۘ۬ۨۨۘ۫ۨۥۛ۠ۨۨۢۘۘۙ۠ۤۥۢۗۛۢۖۥۧۜۘۦۧ۟ۦۜۥ۠ۛۨۘۚۘۨ";
                    c0344p0 = (C0344p0) this.f1038;
                    break;
                case -2116066812:
                    z2 = false;
                    str = "ۨۚۜۥ۬ۧۚۙۤۥۗۖۙ۬ۢۦۘۨۡۧۘۙۥۦۘۢۗۜ۬ۗۨۢۙۧۨۜۘۜۡۡۨۛ۫ۥۨۧۤۖۧۘۗۘۜۧ۟ۨۘۖۚۨۘۙ۬ۘۖ۠ۦۘ۟ۤ۠ۡۤۙۢۥۧ۟ۚۡۡۥۜۘۗ۟ۥۘ";
                    break;
                case -2066573971:
                    str = "ۥ۠ۖۘۚۗ۬ۜۥ۫ۗۘۙۢۧۖۘۚۤۦۘۢۗۘۘ۠ۙۧۢۗۨۦۖۥۘۢۥۗۚۧۘۘ۬۫ۖۘۖ۠ۖ۬۬ۖ";
                    textView = (TextView) this.f1038;
                    break;
                case -2010570094:
                    z = true;
                    str = "ۘۦ۫ۥۖ۬ۗ۬ۦۚ۟ۧ۠ۜۡۥۗۦۘۖۙۨۨۗ۫۬ۖۧۘۖ۬۠ۥۢۖۤۚۗۚۖۘۛ۬ۤۙۗۙۤ۠ۥۖۘۘۘۛۢ";
                    break;
                case -1897713786:
                    i3 = 8;
                    str = "ۦۤۡۘۨۛۙ۟۟ۨ۫ۧۢۖ۬ۦۘۢۜۥۘ۫ۜۙ۟ۥۜ۟ۙۡۘۗۗۨۥۘۘۘۖۧۘۘۛۚۤ۠ۚۧ۬";
                    break;
                case -1813957508:
                    str = "ۨۧ۫ۥۙۧۜۘۜۤۙۨۥۙۘۘۛۛۡۧ۫ۡ۬ۛۛۖ۫۠ۘۡۘۡۜۖۘۥۗۘۘۗۚۛۖۤۡۘۚۗۗۡۛۘۖۤۖۦۙ۟ۘۨ۫ۦ۫ۜۘ۬ۖۦۘ";
                    break;
                case -1798616489:
                    webView.post(new RunnableC0258ib(alertDialogC0168c5, string, 3));
                    str = "ۨۤۤۡۧۙۡۚۤۤۜۗ۫ۖۗۡۡۖۧۗۤۖۡۘۚۘۘ۫ۙ۬۠ۨۘ۬ۘۘۙۢۚۚۜۡۦ۬ۖ۫ۚۨۡۡۨۘۛۥۜۘۨۗۙ۠ۨۡۘۥ۫ۗۚۜۖۙۛۥۘۗۢۖ";
                    break;
                case -1737487745:
                case -939227006:
                case -472108535:
                case -457779917:
                case -178014505:
                case 1382849639:
                case 1404719892:
                case 1881582256:
                    return;
                case -1734456134:
                    int i5 = AbstractAlertDialogC0471ya.f1877;
                    str = "ۢۖۖۙ۫ۙۨۢۜۘۢۨۖۘۚۤۖۦۤۡۘۡۖۖۗۦۘۧۡۢۨ۫۟ۜ۬ۨۘۙۘ۬ۢۦۙۙۚۥ۬ۙۤۙۡۙۦۜۜۗۦۘ";
                    break;
                case -1622520902:
                    String str2 = "۬ۜۗۚۖۘۘۡۤ۠ۤۙۘۗۡۥۘۧۤۡۚۡۧ۫ۡۘۤ۫۬ۜۙ۫ۡۖۡۘۧ۠ۥۘۛۢ۟ۢۖۖۘۜۡۚ۠ۙۨ۬ۤۜۛۢۥۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 870054247) {
                            case -1155163345:
                                str = "۫ۡۙ۬ۥۘۙ۟ۖ۬ۗۦۡۡۨ۫ۛۡۧۤۦ۠ۦۜۦۘۙ۠ۦۦۙ۠ۚ۟ۨۧۥۦۥۨ۬ۚۤۘ۠ۗۤۦۢ۠ۗۨ۠ۦۥۤ۠ۥۧ۬ۥۗۦۘۚۦۤۛۥۚۘۘ";
                                continue;
                            case -630862224:
                                String str3 = "ۤۙۙ۬ۘۖ۬ۗ۠۫۬ۨۘۤۦۚۨ۬ۧ۟ۦۦۘ۠۫ۥۘ۬ۗۢۧۛۘۘۦۨ۬ۡۥۘۜۜۖۘ۠ۗۨۘ۠۫ۨۚۜۡ۬۫ۜۘ۠۠ۘۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-727609175)) {
                                        case 757956478:
                                            str2 = "ۚۤۙۘ۫۟ۤۜۜۚ۠ۨۘۙۛۨۘ۬ۛۗۧۜۨۥۤ۟ۡۧۖۧۧۢۜۥ۠ۥۦۥۘۤۙ۫۟ۛ۟۠ۨۘ";
                                            break;
                                        case 1006656011:
                                            str2 = "۠۫ۡۘۙۗۡۘ۫ۗۤۥۧۦۢۜۤۦۧ۫ۥۗۦ۟ۘۘۛۥۘۘ۫۫۫۬ۦۗۢۖۗۧ۠ۥ۬ۘۘۘۥ۫۫۫ۦۘۗۡۜۘ۠۫ۜۖۚۢۜۧ۫ۗۥۜ۬ۧۛ۟ۧۡۘۦۤۜ";
                                            break;
                                        case 1174558070:
                                            str3 = "ۜۧۖۘۢۧۘۘۜ۠ۗۖ۬ۚۦۧ۫ۘۖۚۡ۬۠ۙۨۙۘۛۨۘ۫ۛ۠ۖ۫ۤۗ۠ۘۘۦۛۚۘ۬ۚۢۚۢۤ۠ۖ۠ۤۨۧۛ";
                                            break;
                                        case 1828585392:
                                            String str4 = "ۧۛۧ۫ۤۢ۫ۗۛۢۖۘۢۦۥۚۢۡۦۚۧۗۦۘۘۡ۠ۘۨۛۗ۟ۛ۬۫ۦۦۦۦۚ۫ۦۨۧۗۡۢۚۡ۫ۤۛۧۖۥۢۡۘۧۘۖۗۖ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-148267324)) {
                                                    case -1128487079:
                                                        str3 = "ۛۜۘۢ۠ۡۛۧۛ۟ۜۧۘۨۙۖۖۚۨۥۚۚۤۡۘۡۧۦۘۨۖۥۗۧۡۘۡۙۨۘۛۧۡۘۙۘۢ۬ۥۨ";
                                                        break;
                                                    case -283002038:
                                                        str3 = "۬۟ۢ۫۫ۙ۫ۡۘۘۡۜ۫۫ۛۖۛۛۦ۠ۨۚۤ۫ۜۘۙۧۦۥۖ۬ۗۥۖۤۧۥۜ۟۬ۧۨۢۖۧ۫۬ۘۦۛۤۥ۠ۗۘۢۗۨۘۗ۫ۘ۠ۨۧ";
                                                        break;
                                                    case -259637077:
                                                        str4 = interfaceC0208f32 != null ? "ۛ۫ۖۘۙۧۥۘۢۙۜۘ۫ۢۥۨۢۨۤۘۘۤۖۥۘۚۨۖۙۨۥۥۙۥۜۖۡ۫ۘۘۜۥۙۚۗۗۧۛ۠ۙ۠ۡۘۘۨۥۖۘ" : "ۡۜۗۦ۫ۨۘ۠ۖۘۗۜ۫ۘۦۙۘ۫ۥۛۨۦۘ۠ۡۙۙۡ۟ۛۥۗۙۜۦۘۘۡ۠ۙۦۧۘۚۦۨۥۡۦۘ";
                                                        break;
                                                    case 870416543:
                                                        str4 = "ۤۜ۟ۧۙۜۘ۠ۤۦۢۧۘۘۚۢۡۘۧۢ۫ۤ۠ۡۤۜۜۘ۬ۨ۠ۘۖۧۘۖۘۨۘ۟ۜ۠ۧ۟ۙۥ۫ۖۤ۠ۨۘۛۛۖۘ۬ۛۗۖۥۗۨۦۚ۫ۖۨۘۢۖۘۘۘۜ۟ۙۜۡۘۤۤۥۧۗۨۜۤۦۜۡ۟";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 83254992:
                                str2 = "ۢۛۖۘۙۦۘۘۜۗۥۘۧۥۘۨۧ۟ۛۛۖۘۚۢۘۖ۫ۛۜۛۚۚۖۖۘ۫ۘۚۡۡۖۜۡۧۧۥ۬ۧۡ۫ۙۦ۬ۙ۠ۖۘۖ۬ۥۧۨۘۥۗۡۘ۫ۦۥ";
                                break;
                            case 393740247:
                                str = "ۦۙۤۛۦۛۖ۠ۘۡۖۘۛۨۗ۟ۘ۠ۥۨۡ۫ۛۡۧۛۙۛۢۛۚۜۘۤۖ۬۬ۛۡۘۢۜۦۘۦۗۘۘ۠ۚۨۜۛۦۚۘۘ۟ۢۘۘۘۤۤۚۙۨۚ۟ۦۛۦ۠ۚۢۥۘ۬ۧۙۙۗۖۖۖۥ";
                                continue;
                        }
                    }
                    break;
                case -1530758414:
                    String str5 = "ۤ۟ۡۘۖۢ۬ۤۘۙۨ۫ۢۘ۠ۡۛۛۨۘۙۧ۫۠ۨۜۘۘۧۨۡۦۖۘۙۘۦ۫ۡۛ۫ۜۖ۫ۡۨۦۜ۬۬ۤۙ۟۬ۜۤۙ";
                    while (true) {
                        switch (str5.hashCode() ^ 1321356059) {
                            case -1301387915:
                                String str6 = "ۜۗۜۘۨۢ۬ۦ۠۫۟ۥۖۘۥۗۥۚ۬۬ۘۙۨۘۨۥۨۛۙۤۘۘۜۤۖۥۨۧۘۜۜۖۘۦۨ۠ۘۡۖ۬۫ۘ۟ۘۘۘۤۜۘۖۛۦۙۥۘۜۧۡۛۖۦۘۚۦۨۘۤۢۦۘۡۖۤ۠ۙۘۘۖۡۖ";
                                while (true) {
                                    switch (str6.hashCode() ^ (-1731319414)) {
                                        case -132700659:
                                            str6 = "ۚ۟ۥۘۨۢۦۧۛۨۘۛۗۤۚ۫ۜۘۘۙۚ۬۬ۚۘۗ۟ۨۦۘۗۗۙۗۗ۫ۦۤۢۖ۟ۡۘۢۦۨ۬ۦۚۧ۟ۨ۟۟ۘۘۖۛۤۗۤۗۖۖۖ۟ۡۧۘ";
                                            break;
                                        case 124628942:
                                            str5 = "ۧۥۥ۬ۗۥۢۡۘۘۖ۟ۤۦۚ۟ۜ۠۬۟ۛۜۘۦۧۦۜۨۧۘۙ۠ۖۘۚ۟ۨۘۧۛۨ۫ۚۘۥۚۖۘ۟ۜۖ";
                                            break;
                                        case 1674064689:
                                            str5 = "ۨۨۙۡۜۖۚۛۘۘۨ۟ۡ۠ۢ۫ۧۤۢۥۡۥۘۖۤ۠ۗۗ۠ۥۛۛۙ۬ۤ۟ۜۘۘۢۖۘ۠ۨۘۘ۬ۗۗ۬ۚۦۘۡۚۛۦ۟ۘ۬ۨۧۘۤۛۘۘ۟ۨۧ";
                                            break;
                                        case 1734368733:
                                            String str7 = "ۘۦۤۗۦۖۘ۬۟ۙۤۘۧۘۛۗۜۘۚ۫۟ۚۧ۫ۖۧۖۙۗۦۦ۟ۡ۫ۗ۠ۘۡۘۛۨۥۘۗۖۖۚ۟۠ۢۗ۫۫ۖۧ۠ۡۘۜۖ۫۫ۢۢ";
                                            while (true) {
                                                switch (str7.hashCode() ^ (-1869700827)) {
                                                    case 196816928:
                                                        str6 = "۠ۙۛ۫ۚۥ۫ۗۚ۬ۤۨۨۖۖۗۗۖ۠ۖۢ۠ۨۘۦۖۘۗۚ۬ۢ۟ۥۦۢۚۤۧۥۜۢ۬ۗۤ۫";
                                                        break;
                                                    case 747626198:
                                                        str7 = editText != null ? "ۨۜۜۨ۠ۨ۠ۥۢۛ۠ۦۜۡۨۘۖۥۡۥۗۜۘۧۘ۫۬۠۟ۘ۬ۛۙۡۡۘ۠ۡۡۜۘۢ۫۠ۤۥۤ" : "ۨۧۧۦۙۦۘۛۡۡ۟ۙۤ۫ۦۧۗۗۤۦ۫۫ۢۚۥ۟ۜۡۦۧۘۘۙۗۚۢۙۛۥۙ۟ۨۘۥ۫ۥۧۧ۬۫ۜ۠۬ۦۘ";
                                                        break;
                                                    case 1674174123:
                                                        str6 = "ۥۡۤۤۡۥۨۡۘۘۚۘۨۘۛۚۛۜۡ۫ۖۤ۠۟ۨ۫ۡۢۗۡۢۜۨ۠ۨۚۡۛ۫ۘ۬ۢ۬ۥۘۢۦ۬ۖۥۘۢۡۧۗۗۦۘ";
                                                        break;
                                                    case 1766601559:
                                                        str7 = "۬ۤۥۘۢۗۜۘۛۢۙۙۨۖۘ۬۬ۨۨۛۨۘۖ۬۬۟ۤۚۧۡۘۘۚۗۡ۠ۢ۠۠ۥۖۘۙۥۖۘۗۙ۬۬۟ۦۘۥۢ۫ۜۤۡۘۡۢۙ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case -20650897:
                                str = "ۡۚۦ۠۫۫ۚۙۗۚۥۘۦۚۦۗۘۛ۟ۚۦۢۦۦۘۖۨۧۘۤۤۖ۠۫ۢۧۥۚۤۥۙۘ۟ۗۢۥ۟ۤۡ۠ۘۧۘ۠ۜۘۖۜ۬ۥ۬ۦۧۨۧۘ۬ۚۦۘۤ۟ۥۙۨۥ";
                                continue;
                            case 322091440:
                                str5 = "ۥۗۜ۫۠ۦۘ۫۠ۜۨۦۥۗۘۨۘۘۡۢۧ۬ۦۘۛۦۡۘۗۛۢۨۘۘۖۨۗۢۖۗ۫ۥۦۘۘۢۘۘۜ۬ۦۘۦۤۘۘ۫ۘۚۡۤ۟ۧۙۚۨۤ۫ۤۖۚ";
                                break;
                            case 690256511:
                                str = "ۧ۟ۦۘۘ۬ۦۛۡۘۢۘ۬ۢۘ۟۟ۛۧۛۚۛۥۡۡۘ۬ۥۗ۟ۨۖۡۘۘۖ۬ۦۛۦ۬ۨۥۘ۬ۡۖۘ۬ۘۦ۟۠ۦۧ۫";
                                continue;
                        }
                    }
                    break;
                case -1528981197:
                    str = "ۧۘ۬ۤۢ۫ۥۦۨۘۜۦۘۘ۬ۘۥۘۗۚۦ۟ۙۜ۠۟ۜۛۛۗۢۛۧۥۘۘ۬ۗۢۢۢۥۘۖۧۤۚۛۗۚۦ۬۟ۖۚۦۦۙۗ۠ۘۘۜۨ۠ۤۢۥۛۥۧۘۚۙۗ۬ۨۛۡۧۤ۟ۢۡۜۡۘ";
                    bVar = (C0371r1.b) this.f1038;
                    break;
                case -1513235559:
                    String str8 = "ۦ۬ۥۘ۟۬ۤۚۨۗۡۙۜ۠ۧۖۧۜۜۘ۫ۗۜۘۙۖۥۦۤۦۘۡ۟ۖۡۙۥۘۧۚ۠ۛۜۖۛۙۛۗۦۦۘ";
                    while (true) {
                        switch (str8.hashCode() ^ (-244950700)) {
                            case -1870214160:
                                str = "ۘۗۗۛ۫ۙ۬ۘۘۘۦ۬ۙۤ۫ۥۘۨ۬ۜۚ۠ۘ۫ۚۡۘۘۙ۟ۙۚۘۙۜۘۘۛ۬۬۬ۙ۬۬ۜۘۢۙۤ";
                                continue;
                            case -777396248:
                                str = "۫۬ۙۥۨۡۘۜۢۖ۫ۚۘۜۥ۠ۨۦ۠ۡۚۜ۫۬ۛۧۨۘ۫۫ۗۥۦ۠ۡۥۗۙۧۘۛۡۧۧۥۡ۫ۗۖۢۤۜۘۚۤ۠ۛۖ۟ۛۤ۬ۧۤۥۖۥۧۨ۬ۦۙۘۘ۫ۘۜۜ۠ۜۖۦ";
                                continue;
                            case 162283096:
                                str8 = "۟ۡۧ۬۟۬ۦۛۢۦۢۘ۟ۥۘۘۡۚۛۖۜۚۤ۠ۘۧۡۧۘۦ۫ۨۜۨۤ۟ۤۥۘۥ۠ۡۜۨۤۘ۟ۨۘ۟ۨ۟ۦۨۘۘۧۛۖۘ۠ۧۚۗۨۜۥۦۡ";
                                break;
                            case 894347784:
                                String str9 = "ۛۙۙ۠ۖۘۗ۠ۥۘ۠ۥ۫ۛ۟ۛۚۖۙۧۦۦۖۢۡۘۦ۠۠ۛۦۙۗ۫۫ۨۛۤۡۛۥۙۘۨۦۨۨۥۖۢۖۙۦۘۦۘۥۘ۟ۥۤۨۖۘۘۢۚۙۛۦ۟ۥۙۛۤۨۥۘ";
                                while (true) {
                                    switch (str9.hashCode() ^ (-1383782702)) {
                                        case -1207647812:
                                            str8 = "ۤۤۦۘۦۦۦۦۖۥۙ۟۟ۘۙۥ۫۫ۗۘۡۜۗۤۚۤ۫ۨۡ۬ۤۥۚۢۜۧۧۧۙ۬۟ۡۘۤۛ۫";
                                            break;
                                        case -710996361:
                                            String str10 = "۬ۖۛۦۙۡۘۡۢۧۙۨۚۥۤۚۡۢۡۘۨ۠ۚۜۘۨۚۜۨ۫ۢۦۤۖۚۦۤۤۥۧۥۜۙ۫ۨۧۛۖۤ۫ۦ۫ۡۚۜۘ";
                                            while (true) {
                                                switch (str10.hashCode() ^ (-1347827170)) {
                                                    case 79552077:
                                                        str9 = "ۦۤۘۙۚۖۘۢۙۦ۫ۤ۠ۡۥۡۧۗۦۜۖۛۡۜۛ۟ۧ۟۫ۖۢ۟۠ۤۛۛ۠ۛۡۘۘۥۤۛۢ۠ۡ۠ۜۘ۫ۙۜۨ۟۟ۡۧۨۗۜۨۧۨۡۘۤۚۜۘۡۜۥ۫ۥۧۗۡۦۘۢۛ۟ۦ۟ۤ";
                                                        break;
                                                    case 292602089:
                                                        str10 = "ۚۚۘۡۢۥۛۢۨۚۖۡۖۗۨۘۗۢۨۘ۠ۨۙۛۨ۠۬۟۟ۥۗۙۜ۟ۤۨۨۗۜۧۡۘۦ۫ۨۘۥ۫۟";
                                                        break;
                                                    case 492093108:
                                                        str10 = textView.getVisibility() == 0 ? "ۗ۠ۥۘ۟۬ۨۢ۬ۨۨۡۧۘ۟ۤ۠ۚ۬ۥۤ۟ۦۧۖۧۜۦۥۚۡۧۘۜۦۘۡۙۡۘ۬ۜ۟ۖۚۜۘ" : "ۨۗۜۘ۟۠ۨۘۦ۟ۜۡ۫ۨۙۙۤۜۗ۫ۗۡۘۦ۟ۗۦۥۥۢۖۢۦۨ۬ۧۖ۫ۜ۠ۧۛۖۚۗۤۚۗۗۖۡۧۙۧۜۢۨ۫ۛۗۧۢۚۥۤۛۡۜۘۨۜۢۘۜۘ";
                                                        break;
                                                    case 617194437:
                                                        str9 = "ۥ۠ۧۦۖۘ۟ۦۧۘ۫ۤۖ۫۠ۦۥ۟ۙۢۘۖۘۛۧۗۚۖۦۨۘۘۙۘ۠ۦۢۛۤۖ۠ۙۙۚۘۥۥۙۦۤ۫ۤۖۘۘۤ۫";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -322306925:
                                            str8 = "ۛ۟ۡۘۨۖۦۘۘۡۦۘۡۚۥۘ۠۟ۧۦۗۘۚۧ۫ۨۥۖۘۖ۟۠ۥۖۨ۬ۛۨۘ۟ۤۛۥۗۢ۟۠ۡۖۨۖۘۤۢۨۘۚۛۦۘۤ۟۟ۢۗۚۙۨ۟ۢۢۦۘ۬ۘۖۘ۠ۥۨۘۜۤۚۥۜۨۘۢۘۡۘۨۢ۠";
                                            break;
                                        case 1580284924:
                                            str9 = "ۨ۠ۙ۟ۛۜۘۢۨۡۛ۠ۧۙۜۥۘ۬ۙۘۘۤۧ۟ۧ۟ۥۡۥ۠ۗۚۛۧ۟۟ۧۨۘۚۧۨۘۛۛ۬ۥۘۘ۬ۘۥۘ۫۫۟۬ۜۤۛۤۦۧۨ۬۬ۢۘۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -1343588504:
                    str = "ۦ۬ۖۢ۬ۡۦ۬ۘۢۙۙۧ۫ۘۦ۬ۢۥۨۘۖۨ۟ۚ۟ۘۘۤۙۧۛ۬ۥۧ۟ۡ۠ۨ۬ۘۡۘۙ۬ۧ۫ۢۧۙ۫ۦۡۦ۟ۖۧۘۤۡۗۜ۬ۤ۟ۢ۟۠ۧۜۘۥۗۢۙۚۚۡۦۖۘ۠ۖۚ";
                    switchButton = (SwitchButton) this.f1038;
                    break;
                case -1207524479:
                    string = editText.getText().toString();
                    str = "ۚۗۘ۟ۧ۠ۦۘۚۢۨۘۛۨۥۗۘ۟ۚۢ۫ۡۥۗۦۚ۟ۨۖۨۥۢ۫ۛۨۥۛۡ۫ۖۚۚ۟ۧ۫ۗۦۖۗۢۨۧۤۨۡۘ۫ۗۨۘۨ۬ۨۢ۟ۧۚۦۨۥۘ";
                    break;
                case -1148504717:
                    C0237h4.m1090("this$0", alertDialogC0403t7);
                    str = "ۚۦۗۤ۟۠ۛۦ۟ۧۤۡۢۜۖۤۚۧۜۥۥۘۙۗۨۛ۬۟ۡۛۥۛۡ۟ۤ۟۬۬ۧۨۘ۟ۛۘۘ۫ۢۜۘۧۦۨۘۡۦۜۘۜۧۦۘ";
                    break;
                case -1142076596:
                    str = "ۨۤۤۡۧۙۡۚۤۤۜۗ۫ۖۗۡۡۖۧۗۤۖۡۘۚۘۘ۫ۙ۬۠ۨۘ۬ۘۘۙۢۚۚۜۡۦ۬ۖ۫ۚۨۡۡۨۘۛۥۜۘۨۗۙ۠ۨۡۘۥ۫ۗۚۜۖۙۛۥۘۗۢۖ";
                    break;
                case -1122549659:
                    str = "ۘۗۗۛ۫ۙ۬ۘۘۘۦ۬ۙۤ۫ۥۘۨ۬ۜۚ۠ۘ۫ۚۡۘۘۙ۟ۙۚۘۙۜۘۘۛ۬۬۬ۙ۬۬ۜۘۢۙۤ";
                    i4 = i3;
                    break;
                case -1054380822:
                    switchButton.m983(true, false);
                    str = "۫ۡ۫ۗۜۖۖ۫ۥۛۨۜۘۥۥۖۘۤ۫ۛۥۘۙۙۘۥۘ۟ۧ۠۬ۧۜۘۥۗۘۗۖۨ۫ۛۚۤ۫ۘۘ۠ۜۦ۟ۨۧۘۖۖۧۡۤۖۤ۟۬۫ۖ۟ۤۡ";
                    break;
                case -955792018:
                    str = "ۛۘۙۢۥ۟ۗ۬ۦۤ۫ۤ۠ۙ۫ۤۙۜۜۙۨۘۡۨۨۘۛ۬ۡۘۛ۟۬ۗۦۜۛ۫ۨۘۡۘۛ۬ۖۘۘ۟ۜۥۘۘۤۙۛۖۨۘۡ۬ۧ";
                    alertDialogC0168c5 = (AlertDialogC0168c5) this.f1038;
                    break;
                case -953205970:
                    C0237h4.m1092("mEditAddr");
                    str = "ۜۧۨ۬ۚ۠ۤ۟۬ۚۡۤۜۢۜ۫ۘۗ۠ۙۙ۫۟ۢۚۨۥۚۚۢۛۜۛۦۤۨۘۥۛۨۥ۫ۥۘۨۛۖۜۗۙۙۧۦۘۤ۫۬ۥۧۘۘۧۥۥۦۜۡۜۙ۟ۥۙۡۘۖۧۥ۠ۡ۠ۡ۬ۨۘۤۦۜ";
                    break;
                case -861199947:
                    webView = alertDialogC0168c5.f1408;
                    str = "۟۬ۜۘۘۦۛۜ۬۬ۦ۫ۘۘۛۢ۬ۘۢۧۜ۫ۡۙ۠۠ۦۗۖۥۢۥۨۨۖۧ۠ۦۜ۫۬ۜۛۖۧۥۡۥۖ۟۠ۚۦۤۡۘ۟ۙۥۘۙۨ۬ۗۜۘۘ۬ۙۥ۫۠ۖۜ۠ۤ۫ۡۛۖ۟۟ۡۖ";
                    break;
                case -826186748:
                    str = "ۙۤ۬ۥۚ۫ۛۘۦۘ۠ۛۜۘۖ۟۬ۥۢۛۢ۠ۢۤۗۖۘ۠ۤ۠ۢۘۗ۫ۙۡۛۜۜۘۘۗ۠ۦۧۥۘۖ۬ۢۢۚۚۧ۬۫ۙۥۘۢ۠ۨۘۧ۟ۛۦۨ۬ۖۦۙۥۛۨۤۤ";
                    break;
                case -683147179:
                    alertDialogC0403t7.dismiss();
                    str = "۟ۧۧۚ۠ۛۥ۟ۦۘۛۤ۫ۚۦۘۘۢۛۡۦۛ۠ۘۢۨۘۧ۠ۤۦۦۛۡۛۨ۠ۨ۠ۗ۫ۨۛۡۘ۫ۨ۬ۦۢۗ۟۫ۜۘۜ۟ۤۛۡۛۧۥۜ۬ۡ";
                    break;
                case -676029711:
                    str = "ۨۧ۫ۥۙۧۜۘۜۤۙۨۥۙۘۘۛۛۡۧ۫ۡ۬ۛۛۖ۫۠ۘۡۘۡۜۖۘۥۗۘۘۗۚۛۖۤۡۘۚۗۗۡۛۘۖۤۖۦۙ۟ۘۨ۫ۦ۫ۜۘ۬ۖۦۘ";
                    z3 = z2;
                    break;
                case -615060407:
                    C0237h4.m1092("mWebView");
                    str = "ۚۜۖۘۛۗۤۘۘۘ۫ۚۨۘۦۗۘ۬ۥۧۥ۫ۢۗ۟۠ۢۨ۟ۥ۟ۥۘۡۦۡ۬ۘۥۛۗۥۚۥۧۘ۬ۘ۫۬ۙۨۘۡ۬ۧۡۡۦۘۦ۫ۡۘۗۜۛۛۧ۟ۢۖۚۡۧۘ۫ۙۜۙۦۢۥۤ۬۠ۘ۬";
                    break;
                case -596582462:
                    C0237h4.m1090("this$0", alertDialogC0168c5);
                    str = "ۢ۠ۦۤۘۘۡۗ۫ۘۤۦۘ۬ۘۗۛۢۦۦۦۘۗۙۢۥۥ۫ۙۧ۟ۗۡۨۜۢۘۥۙۦۘۖۜۥۘۡۗۜ";
                    break;
                case -443594151:
                    i = this.f1037;
                    str = "ۜۗۙ۠۫ۨۚۜۚۧ۠۫ۨۛۡۘۜۦۛۜۜۡۘۤۛۖۨۚۖۗۤۡۦ۬ۘۘ۠ۡ۠ۢۖۖۘۨۜۨۘ۠۫ۦۘۧ۟ۤۘۚ۠ۡ۟ۧۙ۠ۖۜۥۗۖ۠ۖ";
                    break;
                case -379980469:
                    textView.setVisibility(i4);
                    str = "ۨۡۧۖ۫ۥۘۦۧۜۨ۬ۙۙۚ۬۟۠۟۬ۡۘۛۧ۟۟ۨۜۗۥۜۘۦۤۗۡۙ۫ۨۘۘۤۤ۟۠ۢۥۜۙۥۡۗۤۢ۬ۦۘۦۡ۟ۦ۟ۡ۫ۨۘ";
                    break;
                case -286611553:
                    C0237h4.m1090("$item", c0344p0);
                    str = "۟ۦۦۗۡۧۢۘۥۘ۟ۦ۫۟ۜۥۡۨۤۛۖۨۧۘۥۡۛۧ۫ۛۨۦۡۘۤۥۡۘ۠۠ۚۥۘۢۥۙ۫ۦۡۡۧۦۦۨۘۢۗۦۦۦۜۘ۟ۦۘۘ۠ۤۘۘۚ۬ۡۘۥۤۡ۫ۤۘۘ۟ۢۘۘۘۖۖۘ";
                    break;
                case -280821804:
                    str = "ۛۙ۬ۥۗۖ۟ۜۥۡۜۥۘۥۥۗۖۤ۠ۛۗۦۥ۬ۡۘ۟ۨۛۤۨ۫ۤۚۜ۠ۜ۬ۡ۟ۨۤۡۘۖۙ۟۟ۛۦۘۜ۠۫ۗۖۨۗۜۨ۬ۘۡۘ۠ۚۦۘ";
                    break;
                case -253369028:
                    C0330o.m1173(0, "搜索请输入地址，例如：北京");
                    str = "ۙۛۜۘۖۗ۫ۨۨ۟ۤۘۡۢ۬ۖۨۧۘۥ۫۬۫ۨۛ۟ۛۙ۟۠ۛ۬ۨۧۨ۫ۚ۟ۜۨۘۥۛۦۦۖۡۛ۫۫ۘۜۛۤۜ۠ۛۡۖۘۙۚۜۥۚ";
                    break;
                case -224974371:
                    str = "ۖۖۨۛۗۛۛ۬ۙۖ۠۠۟۠ۢۧۖۘۚۘۧۘ۠ۚ۠ۜۨۚ۬ۙ۬۟ۜۦۖۧۢۗۦ۫۟ۧۖۘۡ۬ۙ۟ۛۥ۫ۛ۠۠ۡۚ";
                    i4 = i2;
                    break;
                case 78777050:
                    int i6 = C0330o.f1000;
                    str = "ۛ۟ۧۡۡۨۜ۟ۤۙۘۖۗ۫ۗۗۙۤ۫۫ۜۖۨۡۘۥۢۜۘۦۗۦۘۤ۟ۨ۠۠ۙۤۖۗۛۚۚۜ۬ۛ";
                    break;
                case 280440681:
                    interfaceC0208f32 = c0430v8.f1156;
                    str = "ۚ۠ۖۜۦۘ۠ۜۨ۬۠ۜۙ۟ۧۢۖۦۘۘ۟ۘۖۡۡۢۗۙۥۘۘ۬۟ۜۢۥۨۘۦۦۘۜ۫۫۫۬ۦۘۘۧۨۛۛۤۨ۟۫ۘۛۥۨۥۛۡۚۧۥۡ۟ۖۧۘۗ۫ۧ۫۫ۜۘ۠ۗۗۥۤۡ";
                    break;
                case 334075091:
                    interfaceC0208f3.mo7();
                    str = "ۢۥۖۧۢۦۜۤۖۘ۟۠ۡۙۦۦۘ۠۠ۗ۫ۗۧۢۡ۫۫ۛۢۢۦۨۖۙۛۙۡۧۧۦۥۡۡۥۢۨ۠";
                    break;
                case 366086945:
                    C0237h4.m1090("$rebootView", textView);
                    str = "ۧۨۤۥۡۢۡ۬ۥۜۦۗۥۦۜ۠ۙ۟۫ۦۙ۠ۚۨ۫ۖۤۙۨۥۘۙۛ۠ۙ۠۫ۨۜۜۘۘ۬۠ۡۚۤۨۦۘۡۧۜۥ۫ۤ";
                    break;
                case 396846648:
                    throw null;
                case 401963741:
                    str = "۟ۛۖۗۖۘۡۡۗۖ۠ۨ۠ۨۦۢۘۘۖۖۖۙۡۘ۬ۖۛۘۗۨ۟ۗۛۦۧۚۜۗۧۚۦۘۢۙۛۢۨۘ۟ۢۥۘۛۛۨۙۚۙۗۡ۠۬۬۟ۥۨۤۖۨۢۨۧۚ";
                    c0430v8 = (C0430v8) this.f1038;
                    break;
                case 569490412:
                    str = "ۤۗۖۧۘۤ۟ۜۙ۫ۡ۫ۡۤۗۛ۬۫۠ۧۜۚۡۧۘۜۛۖۘۢۗۧ۬۬ۡۘۡۨۖۘۙۤۦۦۛ۠ۘۚۘ۠ۘۛۙۖ۟ۦۦ۬ۖۥۘۧۖۨ۬۟ۤۡۗۛۛۗۗ۬ۜ";
                    alertDialogC0403t7 = (AlertDialogC0403t7) this.f1038;
                    break;
                case 607197277:
                    interfaceC0222g3.mo984(c0344p0);
                    str = "ۛۘۥۨۛۚۧۖۛ۬ۜۤۡۘۦ۠ۙۖۘ۟ۖۖۢۙۖ۬ۖ۟ۘۘۡۨ۠۫۠ۚۧ۟ۤ۬ۥ۠ۚۡۢ۬ۥۨۡۛۗۧۖۦۚۖۘ۫۬ۘۤ۟۟۫";
                    break;
                case 692455596:
                    String str11 = "ۙۨ۫ۜۤ۟۠ۧۢۡۡۢۤ۬۟ۖ۫ۚۢۡۨۘ۫ۨۜۘ۟۠ۨۘۡ۫ۗ۬ۢۧۚۛۦۘۨۡۥۘۗۤۘ۠ۙ۫۫ۙ۟ۡۚ۬ۡۡۘ۟۠ۙ۟۫ۦۖۛۚۡ۟۟ۦۘۢۘۚۡ۟۫ۦۗۦۦۘ۟ۛۥ";
                    while (true) {
                        switch (str11.hashCode() ^ 2083637385) {
                            case -1034114473:
                                str11 = "ۢ۬ۤ۬ۨۧۢۙ۠ۥۡ۬ۥۚۖۧۢۡۘۘۧۨۘۦۤۗۚۚۥۘۡۜ۟ۡۨۢ۬ۤۗۜ۟ۢ۬ۗۤۧۗۘۨۦۘۧۜۙۛۧۨۖۤۤۚۜۥۨۛۜۘ۫ۧۦۚۙۛ۬ۘۛۜۘۢۖۛۖۘۧ۫ۜۘ";
                                break;
                            case -977861873:
                                str = "ۖ۫ۥۘ۠ۙۡۨ۬ۡۘۘۜۦۗۤۙ۟ۢۢ۠ۛ۟ۗۢ۬ۛۙۡۘۙ۠ۘۘۡ۫۬۠ۦ۫ۡۦۧۘ۬۬ۨۡۡۥ";
                                continue;
                            case -209863577:
                                String str12 = "ۜۨۜۥۥۘۤۙ۫۟ۗۦۛۢۙۤۘ۠ۨۧۦۘ۫ۖۢۚ۬ۛۜۢۥۡ۬۠ۙۡۚۛۧ۫ۤ۟ۧ۬۫۬";
                                while (true) {
                                    switch (str12.hashCode() ^ 1028692446) {
                                        case -1951449697:
                                            str12 = "ۚۛۨۘۚۖۙۗۜۘۘۧۘۜۨۜۢۦۨۨۘۧ۫ۥۘۜۦۤۘۘۥۘۥ۠ۡۙۛۦۘۥۙۘ۫ۨ۬۠ۖۡ۟ۥۘ";
                                            break;
                                        case -1931358945:
                                            String str13 = "ۨۖۖۘۤۢۦۘۚ۬ۖۘۧ۬ۤۖۛۦۧۗ۬ۚۜۜۘ۟ۙۦۘ۫۫ۙۘۢۨۘۜۢۥۘ۟ۜۤۜۢۦۥۧۘۢ۟۟";
                                            while (true) {
                                                switch (str13.hashCode() ^ (-99785205)) {
                                                    case -1308459338:
                                                        str12 = "ۚۖۨۘۢ۠ۙۜۖ۠ۙ۠ۧ۫ۙۨۘۡۜۦۘۚۘۨۘ۫ۖۛۜۖۡۘۘۚۧ۫ۖۦۘۘ۫ۦۘۦۜۧۡۘۘ۟۟ۥ";
                                                        break;
                                                    case -537245302:
                                                        str13 = webView != null ? "ۡ۫ۡۘۨۢۖۘۡ۟ۡۥۖۚ۫ۦۢۧ۬۠ۜۜ۟ۤۚ۫۠ۡۤۨۥۘۙۦۦۘۡۦۜۚۗۥۘ۬ۤۦۘۦۛۥۘۖۗۥۘۚۤۦۘۡۗۥۧ۠ۥۘ۬ۚۚۙۘۤۤۤ۠ۨۥۗۛۥۡۨۗ۬ۛۜ۫ۧۨۜۘ" : "ۙۨۨۘۘۢ۟۠ۨۦۘۙۘ۟ۡۢۗۛۙۥ۫ۤۡ۬ۗ۠ۖ۠ۖۢۚۙۜ۟۠ۙۥۜۘ۠ۥۘۥۙۥۡۛ۟ۖۚۦۙ۬ۘۢۙۙۨ۬۠ۙۡۥۘۗۦۧۘ";
                                                        break;
                                                    case 765118893:
                                                        str12 = "ۥۗۤۧۖۗۙ۠۟ۗۘۛۛۛۥۘۡ۟ۤۥۦۦۙۙۦۨۢۦۥۗ۬ۛ۟ۧ۫۟۟۠ۤۖۘۜ۠ۜ۟ۙۖۘ۫۬ۦۤۜۨۘ۟ۘۡۘ";
                                                        break;
                                                    case 1538441875:
                                                        str13 = "ۗۛۚۧۨۧ۠۫۠ۙۘ۬ۢۚ۫ۨ۫ۚۛۡۘ۠ۥ۟ۥ۬ۖۚ۬ۦۚۨۙۖۚۘۘ۟ۡۥۘۤ۫ۢۤ۟ۖۛ۫۫ۗۤۡۖۘۘۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -616508062:
                                            str11 = "ۥۖۖۘۘۛۤۜۦۖۥ۟ۡۘۖۥۡۨۛۨۡۙ۫۟ۙۘۚ۠ۥۚ۟ۦ۬۫ۤ۫ۖ۫۟۠ۤۥۙۗۘۗۦۨۗۙۗ۫ۦۘۖۚۨۘۛۡۘ۬۬ۢۡۖۚ";
                                            break;
                                        case 2132907219:
                                            str11 = "۫ۦۢۖۡۥۘۨۥۦۤ۫ۦۘۢۦۖۘ۟ۡۙۛۤۜۘ۬۠ۧۚۚۨۙ۬۟۠ۚۙۡۨۨ۬ۡۨۡۡۡۧۢۤۦۢۙ۠۫ۚۦۨۘۨۨۨۚ۫ۜۘۢۦ۟ۥ۠ۛۗۤ۫ۚۛۨۘ";
                                            break;
                                    }
                                }
                                break;
                            case 902679383:
                                str = "ۘ۠ۖۥۡۧۥۤۢۜۖۘۢۦ۫ۧ۟ۚۨۢۢۦۗۘ۬۫۠۠ۛۦۘۙۡۨۘۨۥۢۢ۠ۘۘۦۖۘۘ۬ۜۛۙۥۘ۟۠۠ۦۦۚۚۜۧۘۨۗۡۘۦ۟ۤ";
                                continue;
                        }
                    }
                    break;
                case 718885550:
                    C0237h4.m1090("$this_apply", bVar);
                    str = "ۖۢۚۙۢۙۥۢۨۘ۫ۦ۠ۙ۟ۛۙۡۦۘ۠ۘۡۧ۫۟ۖۨۖۖۘ۟ۗ۫ۨۛۧۜۡۤۨۦۘۖۘۚ۟ۘۛۨۧۦ۟ۚۜۡ۫ۧۨۦۛۦۛۦۜۘ";
                    break;
                case 861715926:
                    String str14 = "ۦۙ۠ۚۜۘۨۘۘۘۧ۬ۡۙۥۜۘۘۙۙ۫۟ۘۘۚۖۤۗۚۧۖۙۨ۫ۥۚۧۖۗۡۧۖۗۨۢۡۡۘۗ۠ۢۧۡۤ۠ۘ۟۫ۨۜۘۚۜۨۘۚۥۧۥ۟ۦۘ۠ۜۨۘۡۤۢ۬ۥۡۘۚۢۚۡۛۧ";
                    while (true) {
                        switch (str14.hashCode() ^ (-77312500)) {
                            case -424682487:
                                str = "ۤ۬ۥۘ۠ۧۦۘۚۜۚۗۧۘۥۤ۟ۘۙۘۘ۬ۚ۫ۨۘ۬ۚۙۥۛۘۘ۬ۖ۟ۛۡۨۜۜۖۢۧۗۖۥ۟۟ۛۘۛۜ۠ۤۨۨ";
                                continue;
                            case 110352220:
                                String str15 = "۫۬ۡۢ۟ۖۛۢ۠ۗۢۦۧۥ۫ۡۢ۟ۢۢۧۨۜۛۢۙۖۙۨۦۘۙ۬ۚۗۧ۠ۨۙۨۦۖ۬ۦۦۥ";
                                while (true) {
                                    switch (str15.hashCode() ^ 1978099285) {
                                        case -1448161920:
                                            str15 = "ۢ۟ۖۘۖۡۙۚۙۨۘۚۧۚۜۦۨ۫ۚۤۜ۬ۘۥۚۖ۫ۧۗۗۖ۫ۚۦۨۛ۠ۨۖ۟۟ۨ۬ۜۘۗۢ۟۟ۚۨۘۤۚ۫۬ۜۘۖۜۡۧۥۧۨ۠ۢۡۤۛۗۥۧۤۙ۫";
                                            break;
                                        case 649022713:
                                            str14 = "ۢۧ۬ۘۤۡۘۗ۟ۚۚۖ۫ۛ۠ۚۡۥ۠۠۠ۨۘۡۜۖۘۥۧۜۚۦۧۘۦۦ۠ۜۤۘۘۘۛۨۘۙۘۖۘۛۜۡ";
                                            break;
                                        case 816163946:
                                            str14 = "ۢۙۡۤۘۗ۫ۡۡ۟ۙۛۢۘۘۙۚۖۛۖۨۛۖۖۘۧۢ۠۟۬ۛ۠۟ۙۗۙۥۘ۠ۘۦۚۢۘۘۢۡۙۧۨۥ۫ۙۡۡۦۡۧۤۖۘۥۘۢۥۜۦۘۖۢۦۤۨۖ۟۠ۨۘۧۨۘۤۦۖۙ";
                                            break;
                                        case 1090023254:
                                            String str16 = "ۜ۬ۢۛۘۦۖ۠۠ۢۦۦۘ۠ۢۨۘۢۚۧۘ۫ۨۢۨۖۘۥ۫ۜۘ۟ۧۦۦۤۨۘۛ۬ۡۘۘ۬۠ۗۧۡۦ۫ۢۜۨۘۥۤۤۤ۬ۖ";
                                            while (true) {
                                                switch (str16.hashCode() ^ 223836351) {
                                                    case -820923163:
                                                        str16 = z3 ? "ۡۤۖۡۚ۫۫ۧۘۨۡۧۥۛۗۡۤۛۡۤۙۢۧۦۘۨ۟ۥۘۤ۫۫ۛ۠ۦۧ۠ۧۖۚۙۖ۟ۥۘۖۡۧۦۦۘۘۗۢ۬ۚۡۙۗۚۚۢۘۗۤۘۡۖۧ۬۬ۖۡۜۜۘ" : "ۘۦ۟ۖ۬۟ۤۜۡ۫ۥۥۘ۟ۖۙ۬ۙۦۛۜۤ۬ۢۤۙۥۦ۬ۥۙۙۡۡۤ۬۬ۤۢۘۡۗۙۡۛ۫ۘۖۜ۟ۚۥۘ۟۟ۖۘۤۥۢ۠ۛ۠ۢۦ۬ۘۜۥۘۙ۫۟۠ۛۥۘ";
                                                        break;
                                                    case -313924624:
                                                        str15 = "ۥۙۥۨۦ۬ۥۥۘ۠ۙۨۘۜ۠۠۟ۜ۠۠ۧ۫ۡ۟ۗۛۤۥۘ۠ۡ۠ۡۚۨۦۥۘ۟ۨۨۘۛۤۖ۟ۡۘۘۙۨۦۘ۫۫ۤ۠ۥۨۙ۫ۜۘ۬ۚۦۘۨ۟ۡۡۜۤۦۡۨۘۢۨۜ";
                                                        break;
                                                    case -25307640:
                                                        str16 = "ۤۦۖۥۜۧۘۨۥۚۡۗ۬ۗۨۘۡۚ۠ۡۜۨ۬ۤۥۘۙۙۧۖۛۥۙۤۖۘۛۧۙۘۡۨۚۘۤۗۙۨۥۡۡۤۙۗ۟ۢۨۘۚۨۜۘۖۙۦۖۥۖ۬ۜۗۥ۟ۡ۫ۡ";
                                                        break;
                                                    case 651505064:
                                                        str15 = "ۡۡۡۛۘۧۢۨۚۜۦۘۢۖۧۘۖۖۘۢۙ۟ۥۗۖۤۗۧۘۦۘۘۜۨۥۘۤۤۜۥۛۨۘ۬ۦۖۙۛۗۡ۫ۨۘ۟ۡۥۖۢۨۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 2004391596:
                                str14 = "ۛۖۙۖۖۛۚۧۨۘۗ۫ۦۘۨۙۨ۟ۖۚۘۗ۫۟ۛۗۜۥۘۦۦۢۧ۟ۢۡۧۧ۠ۡۘۘ۟ۗۦۘ۬ۛ۬ۜۡۛۜۨۚۡ";
                                break;
                            case 2038194320:
                                str = "ۚۛۨۘۦۨۘۥۦ۠ۖۨۖۘۥۚۨۘ۠۫ۥۘۙۗ۬ۥۢۙۜ۠ۢۥ۫ۥۘۛۚۚۦۡۥۘۦ۟ۖ۫ۘۡۘۛۘۡۘ";
                                continue;
                        }
                    }
                    break;
                case 862058922:
                    switch (i) {
                        case 0:
                            str = "۠ۥۘۗۧۖ۠ۨ۫ۖۖۘۘۧۥۚۤۖ۠ۦۖ۠۬ۦ۫ۜۗۨۨۨۛۘۦۜۡۨۨۥۧ۠ۨ۠۬ۥۥۧۖۗۧۚۨۡۘ۬ۗۦۘ۠۠ۡۘۜۤۜۘۗۥۤ";
                            break;
                        case 1:
                            str = "ۙ۬۫۠ۛۖۜ۬ۙۖ۬۠ۡۜۛۨۖۦۘۧۦۘۚ۬ۘۖۖۙۦۡۖۖ۫ۡۖۖۢۤۖۘ۠ۨۢۛۤۛ۟ۙۧ۟ۦ۬ۤۚۖۘ";
                            break;
                        case 2:
                            str = "۫ۙۙۥۦۥۘۦۘۢۙۚ۫ۙۢۖۘۖۡۜۘۧۥ۠۬ۜۡۘۚۤۙۦۨ۫ۡۗۤۙۤۘۘۘۤۘۤۖۥۗۢۙ۫ۗۧ۟ۥۨۘۘۚۢۛ۫ۜۘۥۛۜۤۖۘ۫۠ۡۘۢۙۥۘۨۤۨۢۜۢۡۨۖۘۢ۬ۙ";
                            break;
                        case 3:
                            str = "ۥۘۧۘۙۚ۟ۧۖۘۥۨۛۜۢۜۙۘۖۘ۬۟ۙۗ۬ۤۧ۠ۚ۬۫۫ۚۙۡۘۛۥۨۢۛۛ۟ۧۚ";
                            break;
                        case 4:
                            str = "۟ۛۜۘۥۛ۬ۧۙۜۘۦۘ۟ۛۜۨۘۙۦۘۖۦۨۖۧۤۜۧۘۘۛۛۢۛۜۘ۠۬۠ۥ۬ۚۘۢۡ۬۫ۚۧۘۖۘ۫ۤۖۘۙۧۘۥۥۦۧۢۤۥۧۨۡۨۘۘۜۧۡۘۢۢۥۘ۬ۥ۠ۘ۫ۛۘۦۙ";
                            break;
                        case 5:
                            str = "۟ۤۥۘۜۘۦ۫ۦ۠ۢۦۚۤۗۘ۠ۨۘ۟ۧۨۘۛۘ۠ۨ۫ۧۚۥۘۤۛۨۘۜۖ۬۫ۥۨۘۤۖ۬۠۫ۜۘ";
                            break;
                        case 6:
                            str = "۟ۡۥۘۨ۟ۦۘۧ۫ۙۙ۫ۦۜۡۧۜۧۘۧۗۦۡ۠ۚۦ۬ۗ۫ۢۛۢۚۦۘۡۚۨۥۥۖۨۗۖۘۦۘۦۥ۬ۘۘۚۛۨۘۢ۟۬ۨۙۤۨۧۨ۬ۡۘ";
                            break;
                        default:
                            str = "ۧۡۜۘ۬ۖۨۛۙۗۗۤ۟ۛۛۖۘۜۜ۟ۗۙۢ۬ۘۧۧۤۖۘ۫ۤۥۧۧۗ۬۬ۦۜۥ۫ۢ۟ۦۤۦۦۘۙۚۗ۠ۧۘۘۧۤۜۘۨۛ۫۠ۦۨ۟ۧۜۙۗۗۘ۠ۨۘۗۨۜۘ";
                            break;
                    }
                    break;
                case 942380099:
                    throw null;
                case 1004704836:
                    interfaceC0208f32.mo7();
                    str = "ۦۙۤۛۦۛۖ۠ۘۡۖۘۛۨۗ۟ۘ۠ۥۨۡ۫ۛۡۧۛۙۛۢۛۚۜۘۤۖ۬۬ۛۡۘۢۜۦۘۦۗۘۘ۠ۚۨۜۛۦۚۘۘ۟ۢۘۘۘۤۤۚۙۨۚ۟ۦۛۦ۠ۚۢۥۘ۬ۧۙۙۗۖۖۖۥ";
                    break;
                case 1017550134:
                    C0237h4.m1090("this$0", c0430v8);
                    str = "ۤۤ۟ۘۚ۠ۧۥۙۤۙۗۚ۟۠ۙۥۛۧۨۛۨ۫ۡۚۖۧۘۘۘۚۙۜۤۗ۠ۥۘۥ۠ۡۘۜۢۥۧۛۢۢۜۥۥۦۘۦ۬ۨۘۜۖۚۙۤۥۘۧۧۤ";
                    break;
                case 1106323618:
                    i2 = 0;
                    str = "۫ۢۖۘۦ۬ۦۘۥۢۨۖۡۦۘ۠ۘۧۙۧ۠۟ۘۚۗۥۤۦ۬ۦۖۨۥۨ۫ۤ۬ۢۖ۫۟ۥۛ۟ۦۚۨ۠ۛۖۦ۫ۘۗۛۘۙ۬ۢۚۢۦۗ";
                    break;
                case 1109880428:
                    C0237h4.m1090("$click", interfaceC0208f3);
                    str = "۫ۧ۬۬ۦۚۛۤۤ۫۟ۜۦۘۡۘ۠ۗۦۘۥۡۡۘۘۙۤ۟ۖ۟ۢۧۦۙۘۡۘ۠ۤۦ۫ۥۗۦۘۚۖۡۧۘۙۚ۫۟ۦۧۗۢ۠ۧۜۜۤۖ۬۟ۘ۫ۗۚۘۘۦۙۜۚۗۙۡ۬ۦۘۦۜۧۤ۫ۙ";
                    break;
                case 1123771651:
                    String str17 = "ۘ۟ۖۚۨۡۨ۫ۖۤۜۢ۟۬ۢۗۚۗۡۦۜ۟ۢۖۘۗ۫ۖۘۨ۬ۘۘۜۘۘ۫ۡۜۘ۠ۧۨۘۧۥۘۛۙۨۜۥۘۡ۫۟ۥ۠ۛۥۦۗ۫ۛۧۧۛۦ۟۠ۙۥۤۖۥ۟";
                    while (true) {
                        switch (str17.hashCode() ^ 320905294) {
                            case 307030866:
                                str17 = "۫ۗۘۘۨۤۥۦۜ۬ۤۡۘۧۤۜۘۛ۬ۨۘۦۚۙۛۚۜ۠ۨۘ۫ۜ۟ۨۚۥۘۚ۠۟۠ۦۨۚۖۜ۟ۡ۟ۥۘۗۚۤۡۘۖۜۖۢۥۖۘ۫ۙ۟ۥۨۨۘ";
                                break;
                            case 529798023:
                                String str18 = "ۖۙۜۨۜۥۘۚۨۨۧۛۡۘۜ۠ۖۘۨۧۛۖۦۗۛۢۥۘ۬ۥۚۛۚۛ۠ۡۘۘۗ۬ۘۙۘۡۘۤۡۦۘۘۗۜۘۖۚۦ۫ۚ۟ۧۡۥۘ۫۠۫ۙۦۜۚۧۚ";
                                while (true) {
                                    switch (str18.hashCode() ^ (-1360937310)) {
                                        case 261302870:
                                            str18 = "ۚ۫ۧۥۘۧۖۙۘۛۢۡۘۦۥۦ۠ۚۡۘۥۗۥۡ۫ۛ۠ۡۧۡ۠ۦۘۘ۫ۜۦۥۙۘۘ۟ۚۙ۬۫ۥۤۛۜۗۧ۠۠ۛۤۚۦۜۜۛ۠۟ۢۤ۫ۗۥۘۙۦ۟";
                                            break;
                                        case 682923712:
                                            String str19 = "ۗ۬۬ۤۨۚ۫ۚ۠۫ۜۡۘۦ۟ۡۤۨۤۥۘۜۘ۫ۗۨۖ۟ۤۥۗۦۘ۟ۦۛ۫ۛۙۘ۠۬ۚۥ۟ۘ۠ۦۘۡۦۛۚۜۥۦۦ۠";
                                            while (true) {
                                                switch (str19.hashCode() ^ (-341703185)) {
                                                    case -122888417:
                                                        str19 = C0432va.m1260(string).toString().length() == 0 ? "ۢۗۜۘۘۘ۠۬ۧۡۘۢۦۚۛۧۜۛۜۧ۟ۗ۟ۛ۬ۢۦۜ۫ۜۥ۟ۤۤۦۢۙۧۙ۫۬۫ۢۜۧۘۧۗۢۖۨۜۘۢ۠ۖۦۥۖۘۘ۟ۜۙۥۨۘ۬ۖۖۘۖۦۘ۬ۜ۬ۢۖۥۘ۫ۚۛۦۘۙ" : "ۚۨۡۘۚۤۦۘۗۨۗۥۖۦۘۥۖۡۗۘۘۚۛ۫ۖ۠ۦۥۧۥۘۖۡ۠ۧۦۗۡ۫ۛۛۗۗۖ۬۫ۚۛۖۘۛۥ۟ۡۚۤ۬ۖ۟ۘۡۘۘۖۤۨۚ۟۬ۦۥۚۨۡۜۚۚۢۗ۠ۢۥۦۘۦۨۧ";
                                                        break;
                                                    case 571200369:
                                                        str19 = "ۨ۟ۘۘۤۜۜۦ۫ۘۘۧۨ۬ۨۤ۫ۜ۟ۡۡۤ۫ۚۘۦ۠ۗ۠ۖ۠ۜۜۢۖۘ۠۫ۘۘۖۚۘۚۚۧ۫ۡۜۧۜۡۜۖ۬ۜۦۧۘ۬ۜۥۘۧ۟ۛۛۡۤۥۦۖۘۧۛۨۢۨ۟ۥۨۗۜۦۗ۠ۘۘ";
                                                        break;
                                                    case 2096289982:
                                                        str18 = "ۘۥۧۘۖۥۜۤۤۜۚۖۥۘۤۨۨۘ۫ۨۦۘۡۤ۬ۧ۬ۥۘۛۜۤۗۡۨۜۤۖۜۡ۫ۚۦۨۘۢۙۘۘۖۤۨۘۨۥۚ۬۟ۨۘۡۘۥ";
                                                        break;
                                                    case 2096774978:
                                                        str18 = "ۥ۟۟۠۟ۖۨۢۘ۬ۙۨۥۤۥۘۙۧ۬۠ۧۜۘۧ۬ۧۚۚ۟ۧۦۨۛۥ۟ۨۗۧۘۘۤۚۢۙۢۜۘۖۨۘۡۥۙۨۡ۟ۤۧۥۘ۫ۚۖۘ۫ۦ۠";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 790862032:
                                            str17 = "ۤۜۥۙ۬ۤۛۖۗۥۨۘۘۧۤ۫۬ۢۗ۬ۧۥۢۦۥۘۤۗۖۗ۠ۚۚۜۘ۬ۥۜۧۗۗ۟۠۬ۡۘۥ";
                                            break;
                                        case 2098688875:
                                            str17 = "ۢۜۥ۫ۧۡۘۥۚۡۧۚ۟ۗۙۚۧ۫ۛۘۜۥۜۥۡۘۘۜۤۨۚۡۗۢۢۘۜۨۥۥۗۧۤۛۤۧۖۜ۟ۤ۬ۙۧۥۙۛ۟۬۠ۦ۟ۥۘۜۥ";
                                            break;
                                    }
                                }
                                break;
                            case 1593923976:
                                str = "ۙۥۛۛۡۥۘ۠۬ۛۜۧۢۙۦۙۨۤۛۘۤ۠ۙۗۛۧۤ۬ۚۡۢۜ۫ۢۛۥۦ۟ۚۖ۟ۡۘۘۚۙۤ۬۫ۖۗۜۘۘۜۖۘ۫ۦۘۢۤۡۡۜۧۡ۫ۡۘۦۙۖۦ۠ۜۤۤۥۨۖۘۘۡۗۤ";
                                continue;
                            case 1950065849:
                                str = "ۧۜۘ۠ۧۦۘۡ۬ۙۘۚۦۘ۬ۢۚۥۚۛۙۜۛۦۡۙۚۡۨۡۛۙ۟ۖۘ۠ۢۤۘۛۨۗۚۘۤۖ۠۟ۗ۫ۤۢۨۖۛۖۘ۟۠ۜۘ۫۫ۨ۠ۥۨۘۨۡۡۘۗۦۦۖ۬ۖۘۢۗۜۘۚۜۜۦ۬ۦ";
                                continue;
                        }
                    }
                    break;
                case 1187479012:
                    editText = alertDialogC0168c5.f1406;
                    str = "ۦ۫ۤ۟ۦۢ۠ۥۧۘۙۤۢ۟ۥۧۨۧۘۚۦۧۘ۬ۜۨ۟ۘۨۖۤۜ۫ۗ۠ۛۜۥۘۜۛۗۜۜۧۘۙۖۧ";
                    break;
                case 1436641211:
                    str = "۫۟ۥۘۢۛۦۘ۟ۖ۟ۛۡۦۘۘۧۗۙۨ۬ۗۢۚ۫۫۫۟ۦۢۢۤۦۦۢۤۖۧۘۥۧۨۘۡۖ۬ۚۦ۟ۙۧۦۗۢۡ۠ۘۜۘۦۚۘۧۤۙۡۡ۬۟ۛۥۘۚۜۡۘۦۧۘ";
                    z3 = z;
                    break;
                case 1523465070:
                    int i7 = AlertDialogC0168c5.f1401;
                    str = "ۤۢۜۜۙۛۙۥۖۦۖۜۨۙۨۥۘۥۘۗۜ۟۫ۖۜۛۦۨۘ۠ۛۜۖ۫ۤ۬ۤ۠ۢۨۜۦۡۨۘۤۢۧۙۗۚ۠ۤۧۗۥۦ";
                    break;
                case 1631483756:
                    bVar.f1760.toggle();
                    str = "ۢۙۚۜ۟ۖۘۧ۬ۧۤۦ۠ۧۥۘۗۜۤۧۙۥۖۡ۠ۜۢۖ۠ۡۘۘۖۨۚۜۨۖۥۙۦۤۛۛ۫ۜۧۘ";
                    break;
                case 1770155457:
                    interfaceC0222g3 = c0344p0.f1738;
                    str = "ۡ۫ۘۘۙۜۜۘۗۛ۠۫ۨۘۨۖۘ۠ۘۙ۬ۛۨۜ۬ۘ۫ۗۡۘ۫ۗۖۨ۫۠۬ۥۙۨۗۡۘۥۤۙۧۧۤۖۡۦۘۗۚۥۘ۠ۛۥ";
                    break;
                case 1799683989:
                    String str20 = "ۙۧۘ۫ۨۘۘۛۨ۫ۢۖۦۗۨۜۘۘۤ۠ۙۚۥۘۤۡۛۙۖۡۜ۠ۚۜ۟ۘۘ۠ۙ۟۟ۖۜۘۧۢۘۘ۫ۨۗ";
                    while (true) {
                        switch (str20.hashCode() ^ (-959644924)) {
                            case -1158739747:
                                String str21 = "ۨۢۨۨ۟۟ۛ۫ۧۧۥۚۤۗۜۨۥۡۘۦ۫ۧ۬۫ۘۤۧۚ۟۫ۢۛۥۚۨۙۗۖۙ۬ۧۡۢۥۖۖۘۡۡۜۜۢۗۛۧ";
                                while (true) {
                                    switch (str21.hashCode() ^ 268493482) {
                                        case -1401458548:
                                            str21 = "ۨ۟ۡۘۤ۠ۜۡ۬ۨۦۤۚۨۤۡۡۧۜۘۚۘ۠ۛۘۚۢۖۢۥۙۖۘ۫ۧۥۨۨۧۘۗ۟ۖ۫ۡۜۘۨۧۚ۠ۡ۟ۛۢۧۨۘ۠";
                                            break;
                                        case -1377608470:
                                            str20 = "ۢۤ۬ۘۨۧۘ۠ۥۜۗ۠ۦۘۛۤۡۦۤۛۚۚۗ۠ۘۨ۫ۦۢۨۦ۫ۜۨۚۛۦۘۘۡ۠ۙۤۡۦۘۧۡۢۛۥۤۤۡۨۨۘ۠ۙۦ۬ۛۖۘۢۙۜۘ۬ۚۜۘۙۚ۟۟ۡۘۦۧۦۘۙۦۖۥۚۧ";
                                            break;
                                        case -970110810:
                                            str20 = "ۜ۠ۚۦۛۖۘ۠ۡۡۘۚۡۢۡۗۥ۬ۤ۫۠ۦ۫ۢ۬ۨۘۦۦۚۡۙۦۛۖۧۧ۟ۛۗۦۘۥۢ۠ۦۨۡۤۛۖۘ۟ۙۧۡۨۨۘۙ۬ۦۜۤ۫ۨۦۤۚۡۘۜۢۤۦۥۦ";
                                            break;
                                        case -351910025:
                                            String str22 = "ۦ۟ۡۘ۫۟۫ۚۖۘۖۛ۫ۦۙۦۘ۟ۗۖۖ۠ۥۘۧۖۧۧۢۛ۫ۡۘۦۧۜۘۖۦۖۙۢۜۛۛۢۖۘۦ";
                                            while (true) {
                                                switch (str22.hashCode() ^ (-990151685)) {
                                                    case -2070677862:
                                                        str22 = interfaceC0222g3 != null ? "۫ۧۡۘۘۙۜۘۛ۠ۙ۬ۡۡ۬ۡۘۘۖۘۙۙۙ۫ۨ۬ۡۜ۫ۘۘ۟۟ۚۜۡۧۗۜۧۙۙۜۘۥ۬ۢ۠ۦۘۤۨۦۘ۠ۤۨۥۥۤ" : "ۗۢۗۗۧ۫ۨۖ۬۬ۨۧۚۘۖۘ۠۬ۜۘۡۨۘۘ۬ۚۨۘۜۜۧۘ۠۫۠۫ۜۦۢۢۨۘۢۖۜۘۚۨۜۘۦۖۙۗ۫ۗۚۘۖۘۖۦۧۘ۬۠ۧۜۖۘۦۡ۬ۜۗۡۘۤۡۧۘۛۦۧۘ۟۫۬ۥۛۖۦۗ۠";
                                                        break;
                                                    case -1132821399:
                                                        str21 = "ۥۘۜ۫۠ۜۤۦۦۘۢۥۥۘۗۧۜۦ۠ۨۘۥۥۖۘۥۙۡۢۚۥۘۛ۬ۨۙۥۜۘۘۜۖۥ۠ۨۘۜ۠ۗۗۡۘۤ۬ۦ۟ۘۦۘۦۜۤ";
                                                        break;
                                                    case 2082171831:
                                                        str21 = "ۖ۬ۜۖ۟ۦۘۜۨۨ۠ۘۨ۬ۚۤۦۦۤۥۙ۠ۢ۬ۧۜۥ۬ۘۤۨ۬ۚۙۖۙ۫۬ۗۦۘۡ۫ۜۘۤ۫ۥۘۦۚۖ۠ۡ۟ۨۥ";
                                                        break;
                                                    case 2094299923:
                                                        str22 = "ۢ۫ۜ۠۬ۖۘۢۢۦ۬ۦۗۛۤۥۘۤۗۡۨۤۤۗۜۗ۟ۘۤۡۦۨۧۥۥۘ۠ۛۘۥۤۧۦۡۜۡۘۜۘۛۨۥۘ۬ۨۢ۠ۚۡۘۛۜۨۘۗۘۡۘۨۨۖ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 146070021:
                                str = "ۛۘۥۨۛۚۧۖۛ۬ۜۤۡۘۦ۠ۙۖۘ۟ۖۖۢۙۖ۬ۖ۟ۘۘۡۨ۠۫۠ۚۧ۟ۤ۬ۥ۠ۚۡۢ۬ۥۨۡۛۗۧۖۦۚۖۘ۫۬ۘۤ۟۟۫";
                                continue;
                            case 429507585:
                                str = "ۤ۬ۥۦۥۙۖۢۨۚۨۨۘۢۘۖۘ۟ۨۖۚۙۛۘۚۦ۫ۡۢۗۚۗۨۦۤ۟ۘۥۗ۫ۧۛۙۡۘ۫ۖۥۚۙۜۘۚۢ۠ۛۖۛ";
                                continue;
                            case 2060473054:
                                str20 = "ۙۡ۬۠ۖۜۡۦ۟ۥۜۖۘۦۗۗۘۥۤۨ۟ۨۘۤۢۦۦۤ۫ۖۜۤۤۚۢۨۜۡ۟ۖۘۧ۬ۜۘۜۜۖ";
                                break;
                        }
                    }
                    break;
                case 1828705648:
                    str = "ۢۦۤ۟۟ۗۨ۟۬ۚۧۨۘۧۘۢۚۢ۬ۦ۫۫ۖۦۘۥ۫ۜۘۧۚ۫ۦۧ۬ۙۡۜ۬ۗۘۛۗۛ۬ۤۧ۫ۙ۟ۡ۫ۖۧۘ";
                    break;
                case 1915084406:
                    str = "ۘۧۜۥ۬ۚۛۜۘۘۖۢۨ۠ۦۧۡۗۥۘ۟۬ۨۘۤۖۦۘۦ۟ۛ۬ۛۖۘۚۜۚ۬ۤۦۘۦۛ۟ۨ۠۟ۤۡۥۘ";
                    interfaceC0208f3 = (InterfaceC0208f3) this.f1038;
                    break;
                case 2036042115:
                    int i8 = C0430v8.f1829;
                    str = "ۥۦۨۘۚۡۡۘ۠ۖۛ۬ۘ۬ۗۗۖۡۖ۫۫ۚۥ۬ۨۧۘۢۙۥۘ۫ۧۨۨۧ۫ۛۘۘۨ۠ۘ۟۬ۥۚۚۜۘ۬ۤۘۘۛۦۛۛۖۢۗۧۦ۠ۤۖۜ۫ۚ۬۬۟ۖ۫ۡۘۢۨ۠ۘۚۛۛۘۜۚۙ";
                    break;
                case 2073924864:
                    C0286kb c0286kb = MainActivity.f1289;
                    str = "ۚۦۖۥۤۢ۟ۗ۫۬ۚۙۥۦۡۧۜ۫۫۫ۗۤۨۘۘۚۘۜۘۨۗۡ۠ۨۤۘۢۦ۬۫ۢ۬ۗۨ۟ۨۗ۬۟ۦۘۦۧۜۘۨۥۨۧۨۘۤۤۚۧۗۙۤۤۦۘۖۗۦۘۧۡۚۥۜۚۖۜۥۘۛ۟ۦ";
                    break;
            }
        }
    }
}
