package p199;

import android.view.ViewGroup;
import java.util.Arrays;
import java.util.HashMap;

/* JADX INFO: renamed from: 飘花落叶言子苏兰世楪哲.飘花落叶言子楪苏哲兰世, reason: contains not printable characters */
/* JADX INFO: compiled from: r8-map-id-447c03deab370cabd87f71de7ff996ccc1a6dc9764ce389c731d875d052048e4 */
/* JADX INFO: loaded from: classes.dex */
public final class C7870 {

    /* JADX INFO: renamed from: 飘花落叶言子楪世兰哲苏, reason: contains not printable characters */
    public HashMap f21638;

    /* JADX INFO: renamed from: 飘花落叶言子楪世兰苏哲, reason: contains not printable characters */
    public final C7859 f21639;

    /* JADX INFO: renamed from: 飘花落叶言子楪世哲兰苏, reason: contains not printable characters */
    public final C7867 f21640;

    /* JADX INFO: renamed from: 飘花落叶言子楪世哲苏兰, reason: contains not printable characters */
    public final C7868 f21641;

    /* JADX INFO: renamed from: 飘花落叶言子楪世苏兰哲, reason: contains not printable characters */
    public final C7860 f21642;

    /* JADX INFO: renamed from: 飘花落叶言子楪世苏哲兰, reason: contains not printable characters */
    public int f21643;

    public C7870() {
        C7860 c7860 = new C7860();
        c7860.f21518 = 0;
        c7860.f21517 = 0;
        c7860.f21516 = 1.0f;
        c7860.f21515 = Float.NaN;
        this.f21642 = c7860;
        C7868 c7868 = new C7868();
        c7868.f21622 = -1;
        c7868.f21621 = 0;
        c7868.f21620 = -1;
        c7868.f21619 = Float.NaN;
        c7868.f21618 = Float.NaN;
        c7868.f21617 = Float.NaN;
        c7868.f21624 = -1;
        c7868.f21623 = null;
        c7868.f21625 = -1;
        this.f21641 = c7868;
        C7867 c7867 = new C7867();
        c7867.f21578 = false;
        c7867.f21575 = -1;
        c7867.f21574 = -1;
        c7867.f21573 = -1.0f;
        c7867.f21592 = true;
        c7867.f21591 = -1;
        c7867.f21595 = -1;
        c7867.f21596 = -1;
        c7867.f21593 = -1;
        c7867.f21594 = -1;
        c7867.f21586 = -1;
        c7867.f21585 = -1;
        c7867.f21589 = -1;
        c7867.f21590 = -1;
        c7867.f21587 = -1;
        c7867.f21588 = -1;
        c7867.f21580 = -1;
        c7867.f21579 = -1;
        c7867.f21583 = -1;
        c7867.f21584 = -1;
        c7867.f21581 = 0.5f;
        c7867.f21582 = 0.5f;
        c7867.f21566 = null;
        c7867.f21565 = -1;
        c7867.f21564 = 0;
        c7867.f21563 = 0.0f;
        c7867.f21562 = -1;
        c7867.f21561 = -1;
        c7867.f21572 = -1;
        c7867.f21571 = 0;
        c7867.f21570 = 0;
        c7867.f21569 = 0;
        c7867.f21568 = 0;
        c7867.f21567 = 0;
        c7867.f21558 = 0;
        c7867.f21557 = 0;
        c7867.f21560 = Integer.MIN_VALUE;
        c7867.f21559 = Integer.MIN_VALUE;
        c7867.f21555 = Integer.MIN_VALUE;
        c7867.f21556 = Integer.MIN_VALUE;
        c7867.f21552 = Integer.MIN_VALUE;
        c7867.f21551 = Integer.MIN_VALUE;
        c7867.f21554 = Integer.MIN_VALUE;
        c7867.f21553 = -1.0f;
        c7867.f21549 = -1.0f;
        c7867.f21550 = 0;
        c7867.f21611 = 0;
        c7867.f21610 = 0;
        c7867.f21614 = 0;
        c7867.f21615 = 0;
        c7867.f21612 = 0;
        c7867.f21613 = 0;
        c7867.f21602 = 0;
        c7867.f21601 = 1.0f;
        c7867.f21600 = 1.0f;
        c7867.f21599 = -1;
        c7867.f21598 = 0;
        c7867.f21597 = -1;
        c7867.f21604 = false;
        c7867.f21607 = false;
        c7867.f21606 = true;
        c7867.f21603 = 0;
        this.f21640 = c7867;
        C7859 c7859 = new C7859();
        c7859.f21507 = 0.0f;
        c7859.f21506 = 0.0f;
        c7859.f21505 = 0.0f;
        c7859.f21504 = 1.0f;
        c7859.f21503 = 1.0f;
        c7859.f21502 = Float.NaN;
        c7859.f21510 = Float.NaN;
        c7859.f21509 = -1;
        c7859.f21513 = 0.0f;
        c7859.f21514 = 0.0f;
        c7859.f21511 = 0.0f;
        c7859.f21512 = false;
        c7859.f21508 = 0.0f;
        this.f21639 = c7859;
        this.f21638 = new HashMap();
    }

    public final Object clone() {
        C7870 c7870 = new C7870();
        C7867 c7867 = c7870.f21640;
        c7867.getClass();
        C7867 c78672 = this.f21640;
        c7867.f21578 = c78672.f21578;
        c7867.f21577 = c78672.f21577;
        c7867.f21576 = c78672.f21576;
        c7867.f21575 = c78672.f21575;
        c7867.f21574 = c78672.f21574;
        c7867.f21573 = c78672.f21573;
        c7867.f21592 = c78672.f21592;
        c7867.f21591 = c78672.f21591;
        c7867.f21595 = c78672.f21595;
        c7867.f21596 = c78672.f21596;
        c7867.f21593 = c78672.f21593;
        c7867.f21594 = c78672.f21594;
        c7867.f21586 = c78672.f21586;
        c7867.f21585 = c78672.f21585;
        c7867.f21589 = c78672.f21589;
        c7867.f21590 = c78672.f21590;
        c7867.f21587 = c78672.f21587;
        c7867.f21588 = c78672.f21588;
        c7867.f21580 = c78672.f21580;
        c7867.f21579 = c78672.f21579;
        c7867.f21583 = c78672.f21583;
        c7867.f21584 = c78672.f21584;
        c7867.f21581 = c78672.f21581;
        c7867.f21582 = c78672.f21582;
        c7867.f21566 = c78672.f21566;
        c7867.f21565 = c78672.f21565;
        c7867.f21564 = c78672.f21564;
        c7867.f21563 = c78672.f21563;
        c7867.f21562 = c78672.f21562;
        c7867.f21561 = c78672.f21561;
        c7867.f21572 = c78672.f21572;
        c7867.f21571 = c78672.f21571;
        c7867.f21570 = c78672.f21570;
        c7867.f21569 = c78672.f21569;
        c7867.f21568 = c78672.f21568;
        c7867.f21567 = c78672.f21567;
        c7867.f21558 = c78672.f21558;
        c7867.f21557 = c78672.f21557;
        c7867.f21560 = c78672.f21560;
        c7867.f21559 = c78672.f21559;
        c7867.f21555 = c78672.f21555;
        c7867.f21556 = c78672.f21556;
        c7867.f21552 = c78672.f21552;
        c7867.f21551 = c78672.f21551;
        c7867.f21554 = c78672.f21554;
        c7867.f21553 = c78672.f21553;
        c7867.f21549 = c78672.f21549;
        c7867.f21550 = c78672.f21550;
        c7867.f21611 = c78672.f21611;
        c7867.f21610 = c78672.f21610;
        c7867.f21614 = c78672.f21614;
        c7867.f21615 = c78672.f21615;
        c7867.f21612 = c78672.f21612;
        c7867.f21613 = c78672.f21613;
        c7867.f21602 = c78672.f21602;
        c7867.f21601 = c78672.f21601;
        c7867.f21600 = c78672.f21600;
        c7867.f21599 = c78672.f21599;
        c7867.f21598 = c78672.f21598;
        c7867.f21597 = c78672.f21597;
        c7867.f21605 = c78672.f21605;
        int[] iArr = c78672.f21608;
        if (iArr == null || c78672.f21609 != null) {
            c7867.f21608 = null;
        } else {
            c7867.f21608 = Arrays.copyOf(iArr, iArr.length);
        }
        c7867.f21609 = c78672.f21609;
        c7867.f21604 = c78672.f21604;
        c7867.f21607 = c78672.f21607;
        c7867.f21606 = c78672.f21606;
        c7867.f21603 = c78672.f21603;
        C7868 c7868 = c7870.f21641;
        c7868.getClass();
        C7868 c78682 = this.f21641;
        c78682.getClass();
        c7868.f21622 = c78682.f21622;
        c7868.f21620 = c78682.f21620;
        c7868.f21618 = c78682.f21618;
        c7868.f21619 = c78682.f21619;
        C7860 c7860 = this.f21642;
        int i = c7860.f21518;
        C7860 c78602 = c7870.f21642;
        c78602.f21518 = i;
        c78602.f21516 = c7860.f21516;
        c78602.f21515 = c7860.f21515;
        c78602.f21517 = c7860.f21517;
        C7859 c7859 = c7870.f21639;
        c7859.getClass();
        C7859 c78592 = this.f21639;
        c78592.getClass();
        c7859.f21507 = c78592.f21507;
        c7859.f21506 = c78592.f21506;
        c7859.f21505 = c78592.f21505;
        c7859.f21504 = c78592.f21504;
        c7859.f21503 = c78592.f21503;
        c7859.f21502 = c78592.f21502;
        c7859.f21510 = c78592.f21510;
        c7859.f21509 = c78592.f21509;
        c7859.f21513 = c78592.f21513;
        c7859.f21514 = c78592.f21514;
        c7859.f21511 = c78592.f21511;
        c7859.f21512 = c78592.f21512;
        c7859.f21508 = c78592.f21508;
        c7870.f21643 = this.f21643;
        return c7870;
    }

    /* JADX INFO: renamed from: 飘花落叶言子楪世苏哲兰, reason: contains not printable characters */
    public final void m13231(C7851 c7851) {
        C7867 c7867 = this.f21640;
        c7851.f21437 = c7867.f21591;
        c7851.f21436 = c7867.f21595;
        c7851.f21455 = c7867.f21596;
        c7851.f21454 = c7867.f21593;
        c7851.f21458 = c7867.f21594;
        c7851.f21459 = c7867.f21586;
        c7851.f21456 = c7867.f21585;
        c7851.f21457 = c7867.f21589;
        c7851.f21449 = c7867.f21590;
        c7851.f21448 = c7867.f21587;
        c7851.f21452 = c7867.f21588;
        c7851.f21443 = c7867.f21580;
        c7851.f21442 = c7867.f21579;
        c7851.f21446 = c7867.f21583;
        c7851.f21447 = c7867.f21584;
        ((ViewGroup.MarginLayoutParams) c7851).leftMargin = c7867.f21571;
        ((ViewGroup.MarginLayoutParams) c7851).rightMargin = c7867.f21570;
        ((ViewGroup.MarginLayoutParams) c7851).topMargin = c7867.f21569;
        ((ViewGroup.MarginLayoutParams) c7851).bottomMargin = c7867.f21568;
        c7851.f21427 = c7867.f21551;
        c7851.f21426 = c7867.f21552;
        c7851.f21445 = c7867.f21559;
        c7851.f21428 = c7867.f21556;
        c7851.f21435 = c7867.f21581;
        c7851.f21434 = c7867.f21582;
        c7851.f21453 = c7867.f21565;
        c7851.f21450 = c7867.f21564;
        c7851.f21451 = c7867.f21563;
        c7851.f21433 = c7867.f21566;
        c7851.f21416 = c7867.f21562;
        c7851.f21412 = c7867.f21561;
        c7851.f21431 = c7867.f21553;
        c7851.f21432 = c7867.f21549;
        c7851.f21421 = c7867.f21611;
        c7851.f21430 = c7867.f21550;
        c7851.f21475 = c7867.f21604;
        c7851.f21474 = c7867.f21607;
        c7851.f21420 = c7867.f21610;
        c7851.f21423 = c7867.f21614;
        c7851.f21419 = c7867.f21615;
        c7851.f21415 = c7867.f21612;
        c7851.f21422 = c7867.f21613;
        c7851.f21418 = c7867.f21602;
        c7851.f21414 = c7867.f21601;
        c7851.f21417 = c7867.f21600;
        c7851.f21413 = c7867.f21572;
        c7851.f21439 = c7867.f21573;
        c7851.f21441 = c7867.f21575;
        c7851.f21440 = c7867.f21574;
        ((ViewGroup.MarginLayoutParams) c7851).width = c7867.f21577;
        ((ViewGroup.MarginLayoutParams) c7851).height = c7867.f21576;
        String str = c7867.f21605;
        if (str != null) {
            c7851.f21478 = str;
        }
        c7851.f21479 = c7867.f21603;
        c7851.setMarginStart(c7867.f21558);
        c7851.setMarginEnd(c7867.f21567);
        c7851.m13202();
    }
}
