package p001;

import de.robv.android.xposed.IXposedHookLoadPackage;
import de.robv.android.xposed.IXposedHookZygoteInit;
import de.robv.android.xposed.callbacks.XC_LoadPackage;
import java.util.ArrayList;
import java.util.Iterator;

/* JADX INFO: renamed from: ۟.m3 */
/* JADX INFO: loaded from: classes.dex */
public abstract class AbstractC0306m3 implements IXposedHookLoadPackage, IXposedHookZygoteInit {

    /* JADX INFO: renamed from: ۥ */
    public static String f959 = "";

    /* JADX INFO: renamed from: ۟.m3$a */
    public static final class a {
        /* JADX INFO: renamed from: ۥ */
        public static String m896() {
            while (true) {
                switch (((((((("ۗۗۘۘ۬ۨۖۘۗۙۦۚۜۜۘ۠ۦ۠ۛۜۘۘۘ۬۬ۢۡۘۢۙۤۘۛۥۖۙۤۧۢ۬ۜۦ۠۬ۘۖۢۛۢ".hashCode() ^ 959) ^ 94) ^ 36) ^ 30) ^ 255) ^ 590) ^ 735) ^ (-1099337374)) {
                    case 1881266031:
                        return AbstractC0306m3.f959;
                }
            }
        }
    }

    public final void handleLoadPackage(XC_LoadPackage.LoadPackageParam loadPackageParam) {
        Iterator it = null;
        String str = "ۙۗۘ۠ۛۨۛۥۗ۫ۘۚۧ۫ۧۤۤۥۗۘ۠ۧۛۤۘ۟ۡۘ۠۟۬ۗۛۖۘۖۧۨۦۜ۟ۙۨۖۤۨۡۨۦۥۚۧۧ۫";
        while (true) {
            switch ((((((((str.hashCode() ^ 667) ^ 197) ^ 970) ^ 522) ^ 446) ^ 411) ^ 173) ^ 1098213094) {
                case -2130709286:
                    ((InterfaceC0425v3) it.next()).mo919(loadPackageParam);
                    str = "ۥۥۘۘۢۚۨ۬ۙ۫۠ۨۘۖۦۦۘۤ۟ۜ۠ۧۗۡۡۦۘۘۖۚۨۢۥۘۙ۟ۥۘۗۚۦۚۡۨۜ۠ۦۦۢۗ۫ۡۨۘۡ۫ۙۖۧۘۘۧۢۧۨۚۘۘۥ۟ۡۘۙۢ۟ۦۤۧۧۡۧ";
                    break;
                case -2122634615:
                    return;
                case -1635047599:
                    str = "ۥ۟۬۟ۗۖۘۤ۬ۥۘۥ۬ۜۖ۫ۖۘۜۖۘۘۖۢۖۚ۠ۜ۬۬ۦۖۖۜۘۘۜۖۘۡۦۦۘ۬ۚۨۘ۠ۢ۬۬ۖۘۘۘۗۨ۬ۖۡۘۤۤۗ";
                    break;
                case -1469970316:
                    C0237h4.m1090(C0341oa.m915(new byte[]{62, 7, 38, 100, 81, -99, 63}, new byte[]{82, 119, 86, 5, 35, -4}), loadPackageParam);
                    str = "ۚۡۥۘۡۖۜۙۤ۟۠ۨۦۦ۬ۨۘۤۘۛۢۖۘۦۧ۫ۤۗۥۘ۬ۤ۠ۧۥۧۛۙۘۘۘ۟ۜۘۘۡۛ۫۬ۢ۠ۡۨۘۜۤ۬ۥ۟ۘۘ۬ۗۛ۠۠ۦۜۖۦ";
                    break;
                case -905560090:
                    String str2 = "ۖۧۥۤۖۛۚۨۜۥۧۘۛۢۜۜۛۖۘۖۤۨۚۙۦۘۗۦۖۘۡۖۢ۬۫ۖۤۨۘۛۨۚۦۚۥ۫ۧۦۘۢ۟ۨۘ۬ۢۨ۫ۜۜۘۚ۬ۗۦۧۜۨ";
                    while (true) {
                        switch (str2.hashCode() ^ 1361025785) {
                            case -1326076416:
                                String str3 = "ۗۛۥۡۤۙۤۛۨۧ۟ۚۨۙ۫۫ۡۜۚ۠ۜۥۥۤۤۧۢۚۚ۫ۨۢۜۡۙۤۘ۟۠۠ۢۜۚۡۙۚۛۖۧۛۗۘۥۗ۬ۗۛۖۧ۫ۡ۬۟۬ۚ۠ۛۜۥۨۘۥ۬ۚ۬ۖ۫ۦۘۡۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-875160642)) {
                                        case -206347308:
                                            str2 = "۬ۖۘ۬۠ۤۗۙۘۘۙۚۙۖۖۡۘۛ۠ۜۘۦۚۚۢۧۢۤۧۢۡ۫ۥۘۚۚۜۢ۫ۘۥ۬۫۫۫ۜ۬ۨۘ۠ۘ۬ۗ۠۫ۥۘۘ";
                                            break;
                                        case -129880299:
                                            str3 = "ۛ۠۬ۚۜ۟ۤۚۢۨ۠ۧ۠۫ۤۜۗۚۢۥۘۖۢۤۜۛۥ۠ۚ۟ۖۤۛۥ۟ۙۦۦۚۚۙۤۗۛۢۛ۫ۚۢۛۘۙۜۘۡ۬ۢ۠ۥ۠ۤۗۧ۟ۙۚۡۦۨ۠۬ۖۧ۬ۜۙۗۥۘۧ۫۟";
                                            break;
                                        case 1425420258:
                                            str2 = "۫۟ۙۗۚۜۘۛۚۘۤۘۚۦۛۦۘۢۗۜۘۢۖۡۘۢ۠ۨۢۧ۬۠۫۠ۥۙۖۛۙۨۘۤۗۧۙۥۖ۟ۧ۬ۛۥۧۜۜۗۢۧۧۙۜۘۖۛۤۙۦۡۘۙۗۜۘۢۡ۟ۖۖۤ";
                                            break;
                                        case 1587808796:
                                            String str4 = "ۖ۠ۥۘۙ۟ۘۨۤۙۡۛ۫ۚۦۛۗۧۢ۠۫ۤۧۡۨۘۦۗۨ۬۬ۛۖۤ۠۟ۤۨۘ۫ۙۘۘۖ۬۟ۤۥ۫۫ۧۚۦۙ۟۬ۡۨ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1413559728) {
                                                    case -2121178619:
                                                        str3 = "ۙ۟ۘۢۛۤۖ۟ۡۘۤۧۘۤۘۢ۠ۧۥ۬۬ۘۘۚ۬ۜۙۖۦۘۤۡۦۘ۫ۖ۬ۗۗۘۘ۫ۚۨ۬ۦۘۘۦۤ۠ۙ۫ۖۛۜۧۦ۫ۘۦۙۗۥۨۤۘۙۚۢۥۧۘۜۧۤۧ۬ۘۘ";
                                                        break;
                                                    case -1612417266:
                                                        str4 = "ۥ۫ۗۦۜۥ۟ۧۦۦۥۜۘۚۢۤۖۨۤۖۜۥۘ۠ۤۙۙۘۦۘۧ۬ۖۘ۫ۖۗۖۜۦۢۛۖۗۗۙۗۤ۟۠ۢۖۘۗ۬ۥۘۗۚ۬ۜۘۧ۟ۨ۬ۧۚۥۘۚۖۡۘۡۘۨۘۚۢۚ۟ۨۛۧۙۖۘ۟ۘۘ";
                                                        break;
                                                    case -320437254:
                                                        str4 = it.hasNext() ? "ۙۢۡۘۚۚۦۘۗۧۥۘۢۢۥۨۥۤ۬ۚۨ۫ۧۜۘۦ۟ۘۘ۟ۢۜۖۜۘۘۙۨۜۨۙۡۡۖۘۥ۫ۦۢۤ۫" : "۟۫ۚۛۢ۠ۖۗۙۙۡۤۥۛۡۥ۠ۙ۠ۤۤۨۡ۫۫ۢۙۦ۬ۨۗۗۨۙۖۙۙۖۗۡۚۥۘ۠۟ۢ۫ۙۦۦۙۤ۟۠۠۬۠ۘۜۘ۟ۥۤ";
                                                        break;
                                                    case 1180280815:
                                                        str3 = "ۢۜۜۘۙۛۨۖۢۨۙۗۢۖ۟ۨۘۙۚۨۘ۬ۡۥۚۧۡۘۡۛ۫ۛۜۘۘۖۜۗۦۧ۫ۚۡۥۡۚۙۤۙۡۘۥۙۛۡۛ۫ۜۥۛ۠ۚۡۘ۫ۙۥۙۨۧۜۚۜ۟ۤۧۧ۬ۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 414026150:
                                str2 = "ۨۜۚ۫۫ۗۜۘۘۢۧۥۤۚ۬ۥۗۚۘۖ۫ۜۨۥۡۜۘۙۛۡ۠ۢۨ۠ۖۡۧۢۜ۟ۙۨۘۜۘۗۧ۫ۚۡۢۙ۬ۘۗ";
                                break;
                            case 896673227:
                                str = "۠ۜۖۘۚۘۘۘۥۡۤۚۘۜۘۖۜۨۘۤۘۧۨۨۨۘۙۛۥۘ۬۬ۡۡ۬۟ۙۦۖۥۧۗ۫ۢۖۙۛۡۦۦۢۥۗ۠ۗۤ۬ۗۘ";
                                continue;
                            case 1482892198:
                                str = "۫ۤۡۘ۫ۤۤ۟ۜۖۢۥۧۘۢ۬۫ۛ۬ۘۘۥۗۨۘۚۥۚۙۘ۫۠۠ۨۘ۠ۗۡۘۜۛۦۘۖۚۤ۠ۛۦۡۧۚ۟ۚۧۧۥۘ۠۬ۖۧ۫ۤۘۘۘۖ۟۠۟۬ۙ۟ۗ۫ۡۦ";
                                continue;
                        }
                    }
                    break;
                case -11081503:
                    str = "ۧۦۧۛ۟ۖۘۛۨ۬ۜۢۛۘۢۡۘۛۦۘۘۖۜۘۚۗۥۜۧۘۘۜۢۖۘۚۤۨ۫ۜ۠ۛۜۦۘۜ۟ۙۤۛۨۘۛ۬ۧۨۙۧ۠ۥۨۘ۬ۚ۟ۦۚۚۡۜۧۘ";
                    break;
                case 21277919:
                    str = "ۡۤۨۖۚۡ۫ۙۘۘ۫ۢۨۘۢ۠ۚ۬ۤۢۙ۟ۖۘۢۧۘۗۦۙ۟ۡۛۨۧۤۜۚۛۤۙۢۜۚۨۘ";
                    break;
                case 566034384:
                    it = mo1().iterator();
                    str = "ۧۦۧۛ۟ۖۘۛۨ۬ۜۢۛۘۢۡۘۛۦۘۘۖۜۘۚۗۥۜۧۘۘۜۢۖۘۚۤۨ۫ۜ۠ۛۜۦۘۜ۟ۙۤۛۨۘۛ۬ۧۨۙۧ۠ۥۨۘ۬ۚ۟ۦۚۚۡۜۧۘ";
                    break;
            }
        }
    }

    public final void initZygote(IXposedHookZygoteInit.StartupParam startupParam) {
        String str = "ۦ۫ۦۡۚۧۘۡۦۘۥۤۢۧۦۢۦۦۖۘۡۙۖ۟ۖۡۘۨۦۘۛۙۦۘ۟ۧۘۡ۬ۚۚۦۜۡۧۘۙۙۥۖۗۖۙۜۙۙۖ۠ۡۤۡۘۚ۟ۦۖۨ۟ۚۛۜۘۖ۟ۜۘۜۡۜۘ";
        String str2 = null;
        String str3 = null;
        String str4 = null;
        String str5 = null;
        while (true) {
            switch ((((((((str.hashCode() ^ 999) ^ 371) ^ 506) ^ 557) ^ 375) ^ 800) ^ 98) ^ (-1064607050)) {
                case -1994734459:
                    String str6 = "ۖۧۘ۬۠ۗۚ۠ۖ۫ۛ۟۟۫۟ۖۘۘۚۗ۬ۢۜۥۧۨۜۘۚۧۤ۠ۚۙۧ۠ۘۜۚۦۚ۬ۛۡۖ۬";
                    while (true) {
                        switch (str6.hashCode() ^ (-840861806)) {
                            case -2069314176:
                                str = "ۖۦ۫ۘۦۘۘۛ۬۠ۡ۠ۦ۬ۚۢۛ۠ۗۘۘۢۨۘۨۘۡۚۜۘ۫ۡۗۜ۫ۡۧ۬ۜۥۙۨۘۨ۠ۘۘۛۛۘ";
                                continue;
                            case -1819245536:
                                str6 = "ۤ۠ۜۘۛۤۘۧۡۗۤۙۡۡۘۡۘۢۡ۠۫ۤۜۗۜ۬۠۬۬ۜ۠ۥۘۚ۟ۖۧۘۨۘۛۜۖۘۦۧۚۨۖۘ۬ۛۥۜۙۘۥۥ۟ۜۚ۫۟ۤۗ۬ۛۖۨۢۙ۠ۧۖۗۥۘ";
                                break;
                            case -1101806492:
                                String str7 = "ۘۘۦۜۡۖۘۛۧۖۧ۟ۖ۫ۘۦۘۘۧۤۛۨ۟۫ۡۘۘۨۧۦۘۤۢ۠۠ۢۢۡۧۚۗۚۗۤۧۦۜۛ";
                                while (true) {
                                    switch (str7.hashCode() ^ (-1362188081)) {
                                        case -1525487167:
                                            str7 = "ۥ۫ۖۡ۬ۨۘۙۤۦۗۜۦۘۡۤۥۘۗۚۦۡ۫ۚ۟۬۫ۗۗۚۨۙۢۛۖۜۘۢۧۨۘۚ۠ۡ۠۫ۦۘۗۡۡۛ۬ۗۘۦۦۙۨۤۦۖۧۘۡ۠ۜۘۤۗ۬ۧۨۤ۠ۧۜۘۡۦۗۗۢۨ۟ۡۡ";
                                            break;
                                        case -1490197969:
                                            String str8 = "ۦۥۦۚ۠ۛۥۥۨۘۘۚۤۡ۟ۦۘۙۥۡۘۧ۬ۡۘۦۙۜۨ۬ۙۦۦۢۧۗۘۨۗۖۗۨۜۘۘۤۙۖۚۤۢۤۛۡ۬ۢ۠ۡۖۛۖ۬ۖۖۖۤۜۥۘۢ۬ۨۘۤۙ۫ۙ۟ۙ";
                                            while (true) {
                                                switch (str8.hashCode() ^ (-1151886507)) {
                                                    case -1084317770:
                                                        str7 = "ۥۜۛۜۨۗۢۦۘۗۤۗۗۘۧۘۘ۫ۧۘۨۚۦ۬ۛ۠۠ۖۡۘ۫ۡ۟۬ۘۧ۫ۘۜۘۥۡۘۗۘۨۘۨ۠ۤۗ۠ۘۜ۠ۚۥۜۧۜۙ۠ۥۢ";
                                                        break;
                                                    case -1013315799:
                                                        str8 = startupParam != null ? "ۜۡۥۛۧۙۛۦۘۖ۟ۥۘ۬ۨۜۤۦۘۗۜۤۖ۠۫ۤۛۜۘۧۡۡۖۚۘۜۛۡۘۙۨۥۘۚۡۤۗۥۙ" : "۬ۖۨۗۥۚۛۨ۬ۥۨۖۘۘۥۛۘۜ۫ۧۢۖۘۖۖۨۘ۟ۘۗ۬ۦۢۖۥۤۤۦۗۜۗۙۥ۟ۛۖۜۘ";
                                                        break;
                                                    case -852253329:
                                                        str8 = "ۙۤۙ۠ۨۖۡۖۜۘۢۥۘۥ۠ۨۘۛۙۨۘۦۢۖ۫ۨۨۘۢۨۘۢۡۜۘۡۥۡۘ۟ۦۜۘۙۖۨۙۢۘۥ۬۠۬ۘۜ۫۟ۧۚ";
                                                        break;
                                                    case 2091666332:
                                                        str7 = "ۦۚۥۘۛ۫ۡۘۤۚۗۥۜۨۘۨ۫ۦۘ۠ۤۡۘ۟ۢ۬ۗۥۦۘ۬ۚۖۘۜ۫ۚۨۥۖۘۧۢۡۢۦۘۡۜۘۡۥۘۧ۬ۤۧۧۡۖ۫۟ۜۘۜ۫ۖۜۧۦۖ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1273507089:
                                            str6 = "ۘۤۚۖۢۧۨۦ۟۫ۗۙ۠ۦۗ۬ۡۧۤۜۦۘۨۘۦۘ۠ۦۚۨۧ۬ۦۥۨۘ۫ۤۘ۟ۤۖۦۚۜۘۧ۟ۘۛۙ۫۫ۡۘۘۛۛ۠ۦ۟ۦۢ۟ۧۘۙ۫ۖ۟ۙۖۡۥ";
                                            break;
                                        case 1996127473:
                                            str6 = "ۤ۫ۛ۟ۦۤۚۢۧۥ۬ۖۨۗۧۧۦ۫ۙۘ۬ۨۗۙۥۚۡۘ۠ۘۙۦۘۦۥۧۘۚۙ۟ۙۖ۫ۖۥۘۘۥۜ۬ۛۦۚۛۗۦۘ";
                                            break;
                                    }
                                }
                                break;
                            case -251895816:
                                str = "۬ۥۥۤۖۤۢ۬ۤۙۜۦۘۨ۫ۤ۟ۢۦۘ۫ۧۡۤ۬ۘ۫ۡ۬ۤۢۘ۫ۚۦۘۛۦ۠۫ۧۗۧۛۚ۫ۦۡۡۘۛۗ۬ۡۦۧۡۙۖۡۛۘ۟ۗۥ";
                                continue;
                        }
                    }
                    break;
                case -1954836786:
                    str5 = startupParam.modulePath;
                    str = "ۤۥۨ۬ۧۨۛۖۚۢ۫ۦۘۥۜۘۜۖۚۤۨۨۢۛۧۧۧۢ۟ۨۘۚ۫ۥۨ۠ۜۘۛۦۘۡۡۘۙۖۧ۟ۤۘ۠ۖۨۘۚ۠ۧۦۨۦۧۤۧۖۧۘ";
                    break;
                case -1812073808:
                    str = "۟ۙ۠ۦۨۦۘۙۧ۫ۥۚۦۘۦۗۦ۬ۗ۠ۛۧۥۖۦۘۛۛ۠۠ۧۙ۫ۚ۫ۚۖ۬۠ۡۜۜۢۡۘ۟ۨۦۘ";
                    str3 = str4;
                    break;
                case -1603574952:
                    str = "ۜ۫ۘۛۥ۫ۨۧۦۘ۠۟۠ۛۢۦۖۜ۫ۜۖۢۤۢۜۥۤۛۥۡۘۥۦۘۜۖۖۖۢۦۘۘۗۜ۬۟ۥۢۜۘۘۢۡۥۙۙۢۗۦۦۢۢۜۖۤۜۢۗۜۧۘ۟ۙۨ";
                    str4 = str5;
                    break;
                case -1303915836:
                    str2 = "";
                    str = "۠ۜۥۘۢ۫ۥۘۡۘۘۘۥ۟ۥۜۧۖۙۦۜۦۚۛ۟ۧۥۗ۠ۨۘۡۥۙۥۡ۟ۨۦ۬۠ۗۙۧ۬ۚۚۡۨۘۛۦۘۘۘۨۥۘ۫ۡۖ";
                    break;
                case -999631304:
                    str = "ۧۧۤۦۦۥۥۘ۟۠ۘۨۛۜۙۘۖۗۨۨۧۘۤۡۥۚۜۘ۟ۜ۟ۜ۟ۖۘۘ۟ۥۘۤ۠ۥ۫۫ۗۙۙۚ";
                    str4 = null;
                    break;
                case -522060456:
                    f959 = str3;
                    str = "۬ۛۗۖۢۧۗۢۦۙۗ۟ۘۡۜۥۛۘۘۚۖۧۚۙۡۘۙۚۚ۫ۤۡۘۖۢۡۘۢۦۜ۟ۖۖۤۙۡۙۥۡۘۖۧۖۘۥ۬۬ۤۡۧۘۤ۫ۗ۬ۢۦۘ۟ۙ۬ۗ۟ۘۘۢۤ۫ۖ۫ۙ۫ۦ۫ۜۧۥۢۧ";
                    break;
                case -381810591:
                    str = "ۧۙۥۛۢۗ۠ۖۢۦۜۘۜۥۖۙۤۥۡۜۦۡۡۖۘۥۗۧۚۧۚۤۖۨۘۗ۬۟ۚۗ۫ۗۘۧۙۦۘۖۧۘۘۛۘۘۥۤۙۧۙۜۘۤۨۖۘ۠۫ۗ";
                    break;
                case -357512769:
                    return;
                case 135569789:
                    str = "ۧۧۤۦۦۥۥۘ۟۠ۘۨۛۜۙۘۖۗۨۨۧۘۤۡۥۚۜۘ۟ۜ۟ۜ۟ۖۘۘ۟ۥۘۤ۠ۥ۫۫ۗۙۙۚ";
                    break;
                case 237081263:
                    str = "ۜۛۧۜۖۡۛۘ۬۬ۢۦۢۢۥۘ۠ۧۜۘ۠ۚۜۡ۬۠۫ۡۘۨۜۨ۠ۧۤۖ۠ۦۢۤۥۘۤۜۧ۟ۥۦ۫ۗۚۗ۫ۡۘۢۙۨۤۜۖۤۢۘۧ۫ۜ۠ۡۥۖۧۡۘۤۦۨۦ۠ۘۘ۫ۙۥۦۘۨۘ";
                    break;
                case 754554948:
                    str = "۟ۤۖۘۚۖۦۘۚۚۖۘ۫ۜ۟ۘ۠ۜۘۥۜۧۘۜ۫۫ۗۧۖۘۥۜۙۘۚ۫ۦ۠ۘ۫ۜۗۗۜۥۤۦۘ۟۟ۨ";
                    str3 = str2;
                    break;
                case 784180321:
                    str = "ۢ۟ۖۙ۟ۥۜۧ۬ۥۢۧۤۨۨۨۘۦۜۦۧ۟۠ۥۨ۬ۡ۠ۜ۬۟ۤۖۨۤۜۙ۬ۖۘۦۙۙۥ۠۟۫ۜۧۘۘۘۢ۠ۛۧۙۧۢۨۖۘۦۜۢ۠ۚۥۘۖ۫ۜۘۧۢۡۘ۟ۢۧۙۖۘۘ۫۬";
                    break;
                case 1289713684:
                    String str9 = "ۚ۬۫ۨۙ۬ۧۨۜۘۗۥۜۘۦۢ۟ۘۦۘۘۡ۬ۨۗ۬ۥۘۨۢۖۜۡۙ۬ۤۜۘۤۦۖۘۛۧۡۘۤۛۦ۬ۚۗۦۚۚ۠ۘۖۧۜ۬";
                    while (true) {
                        switch (str9.hashCode() ^ 201956550) {
                            case -1794032919:
                                str = "۟ۤۖۘۚۖۦۘۚۚۖۘ۫ۜ۟ۘ۠ۜۘۥۜۧۘۜ۫۫ۗۧۖۘۥۜۙۘۚ۫ۦ۠ۘ۫ۜۗۗۜۥۤۦۘ۟۟ۨ";
                                continue;
                            case -798432269:
                                String str10 = "ۖۥۧۚۙۙۖۥۧۘۜۙۦۥ۬۟ۨۥۨۘۘۛۛۙۗۦۛۗۚۖۚ۫۠ۧ۠ۖۘۤ۬ۨۘۘ۫ۘ۟ۡ۫ۧۨۡۢ۟ۜ۟ۖ۟۠۬ۖۘۙۚۜۦۜۨۘۧۤۙۖۢۡۘۛۧۙ۫ۡۚۙۜ۠ۜۙۘۘ";
                                while (true) {
                                    switch (str10.hashCode() ^ 1598652333) {
                                        case -1508582589:
                                            String str11 = "ۖ۬ۖۘۧۡۨ۫۟ۨۧۥۜ۟ۡۜۘۥۘۧۖۛۨ۬۬ۥۘۚۡۗ۬ۨۨۘۢۥۥۘۖۢۙ۫۫ۤۘۙۖ۠۫ۖ۫ۙۚۜۗ۫۬ۡ۬ۙۤۙۚۢۤۛ۟۬ۚۜۧ۫ۚۗۤۤۘ";
                                            while (true) {
                                                switch (str11.hashCode() ^ (-1913066647)) {
                                                    case -1812266363:
                                                        str10 = "ۥ۠ۛۜۨۤۚۖۧۘۡۗۧ۟۠ۢۤۖۘ۬ۤۗۛۜۜۥۛۖۥۤۨۜ۟ۘۛۧۤۢۡ۠ۘۥۖۡۛ";
                                                        break;
                                                    case 719720806:
                                                        str11 = str4 == null ? "۬۬ۖۥۖۛۙ۠ۥۘۗۢۘۘۧ۬ۜۙۥۖۘۡۜ۫ۛۢۖۘۧ۟ۨۙۥۧۛ۟ۖۜۚۚۧۜ۫۟ۤۨۤۦۘۡۦۖۧۦۥۘۙۦۧۤۦۙۖۘۢۦۡ" : "ۚۗۗۡۦۚۘۚۦۘۜۢۨۘۚۨۘۧۘۦ۠ۗۡۘۜۡۢۤ۠۫ۜۙ۬ۨۘۛۧۛۘۘ۫ۜۦۨۘۚ۬ۤۡۗۗۡۘۥۙۥۘۦۥۨۡۦۘۘۤۥۦۛ۟۫ۡۖۨۘ۟۫ۥۘۛ۬۟";
                                                        break;
                                                    case 964615964:
                                                        str10 = "ۖۚۨۘۨۤۤۛ۠ۨۥۘۜۜۤ۠ۤۜ۟ۡۢۢۧۨۘۚۖ۫ۧۖ۬۠ۦۧۘۨۚۦۙۥۢۥۡۙۢۛۦۥ۠ۜۘ۬ۛ۬ۨۥۦۘۢۗۘۤۗۢ۠۫ۗۤۜۖۢۢۖۘۗۖ";
                                                        break;
                                                    case 1566802635:
                                                        str11 = "ۘۨ۫ۡۗۡۘۜ۟ۘۛ۟ۡۢۦۘۖۥۖۜۛۖۘۤۙۦۘ۠ۤۘۘۜۖۘۘۛۛۙ۠ۛ۬ۥۨۧ۬ۘۤۘۦۗۤۖۦۗۨۘۛۘۙ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -688390861:
                                            str10 = "ۗ۠۫ۧ۫ۨۘۗ۟ۥۧۗ۫ۛۥ۠۟ۡ۠۬ۧۡۧۡۗ۟ۙۧ۫ۧ۫ۖۜۢ۬ۥ۬ۤ۬ۖۨۨۘۤۢۛۥۥۧۘ۠ۨۜۡۖۥۗۢۖۘۨۧۢ۠۠ۙۦۛ۠۠ۤۥۘۡۘۧۘ";
                                            break;
                                        case 1070376246:
                                            str9 = "ۜۢۤ۠ۘۧۥۦۥۘ۫ۗۢ۫ۘۘۘۗۥۦۘۦۥۘۦ۟ۤۚۙۡۥۧۜۘۢ۠ۗۜۢ۟۟۫۟ۢ۬ۛۦۦ۟ۦ۫ۢۨۙۘۤۜۨۦۙۢۘ۫ۘۙۚۖۘ۠ۡۘۢۖ۫۟ۨۤۧ۫ۚ۬ۗۢۘۦۥۘ";
                                            break;
                                        case 1709702878:
                                            str9 = "ۢ۟ۡۘۥۡۡۘۨۧۘۘۨۧۘۘۛۤ۟ۥۦۖۘ۫ۘۥۢۤۜۢۙ۟ۙ۠ۙۘۧۙۧ۠ۗۖۤۗۢۖۧۙ۫ۗۥۖۙۙۤ۫۟ۗۦۘۜۤ۬ۥۨۡۘۧۦۘۛۨۥ۫۫ۦ۬ۤ";
                                            break;
                                    }
                                }
                                break;
                            case -184044084:
                                str9 = "ۢۗۡۘ۫ۥۘ۫ۚ۟۬ۨۡۘۙۡۧۦ۠ۤۘۘۨۨۦۙ۫ۖۜ۟ۜۦۤۖۘۥ۟ۡۘۜۚۥ۫ۙۗۙۨۘ";
                                break;
                            case 189513201:
                                str = "ۧ۟ۜۘ۠ۤۡۜۜۥۘۚ۬۟ۦۡۥۘۨۛۧۘۤۨۗۙۖۘۧ۫ۙۦۙ۟ۧۛۖۘۢ۬ۧ۟ۘۨۘۦۢۜۘۖ۬ۢ۫ۥۧۤۛۥۘۥۖۖۘ";
                                continue;
                        }
                    }
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ */
    public abstract ArrayList mo1();
}
