package p001;

import android.R;
import android.app.Activity;
import android.graphics.Typeface;
import android.graphics.drawable.ColorDrawable;
import android.graphics.drawable.StateListDrawable;
import android.view.View;
import android.view.ViewGroup;
import android.widget.LinearLayout;
import android.widget.TextView;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;
import com.tendcloud.tenddata.C0133zz;
import java.util.List;
import p001.AlertDialogC0374r4;

/* JADX INFO: renamed from: ۟.r4 */
/* JADX INFO: loaded from: classes.dex */
public final class AlertDialogC0374r4 extends AbstractAlertDialogC0230gb {

    /* JADX INFO: renamed from: ۥۣۡ, reason: contains not printable characters */
    public static final int f1762 = 0;

    /* JADX INFO: renamed from: ۥۡ۠, reason: contains not printable characters */
    public final int f1763;

    /* JADX INFO: renamed from: ۥۡۡ, reason: contains not printable characters */
    public final int f1764;

    /* JADX INFO: renamed from: ۥۡۢ, reason: contains not printable characters */
    public final RecyclerView f1765;

    /* JADX INFO: renamed from: ۟.r4$a */
    public final class a extends RecyclerView.Adapter<b> {

        /* JADX INFO: renamed from: ۥ */
        public final List<C0368qb> f1057;

        /* JADX INFO: renamed from: ۥ۟ */
        public final InterfaceC0222g3<String, C0433vb> f1058;

        /* JADX INFO: renamed from: ۥ۟۟, reason: contains not printable characters */
        public final AlertDialogC0374r4 f1766;

        /* JADX DEBUG: Multi-variable search result rejected for r5v0, resolved type: ۟.g3<? super java.lang.String, ۟.vb> */
        /* JADX WARN: Multi-variable type inference failed */
        public a(AlertDialogC0374r4 alertDialogC0374r4, List<C0368qb> list, InterfaceC0222g3<? super String, C0433vb> interfaceC0222g3) {
            C0341oa.m915(new byte[]{38, -51, -27, -81, 61, 6, 62, -59}, new byte[]{74, -92, -106, -37, 121, 103});
            this.f1766 = alertDialogC0374r4;
            this.f1057 = list;
            this.f1058 = interfaceC0222g3;
        }

        public final int getItemCount() {
            String str = "ۚۚۥۖۚ۠۟۬ۥۘۦۨ۫ۤۡۨۢۙۨ۟ۧۨۜ۬۟ۤۦۘۘ۬ۛۦۡ۬۟۠ۚۜۖۢ۠ۜۗۚۧ۫ۘۘۘۥ۬ۥ۠ۨ۠ۢۡۘۥۥۘۘ۬ۥۗ۫ۤۨ۬ۖ۫ۢۖۜۘۤۛۜ";
            while (true) {
                switch ((((((((str.hashCode() ^ 281) ^ 636) ^ 517) ^ 40) ^ 42) ^ 496) ^ 732) ^ 572496170) {
                    case -1389616909:
                        str = "ۤ۫ۜۘۢ۟۟ۦ۠ۘۘۚۡۧۘۡۤۡۚۨ۫۠ۢۥۗۚۥۘ۠ۤۨۗۧۜۘ۠ۜ۫ۤۖۧ۫ۡۗ۬ۧۛۗۦۥ۟ۜۜۖۛۨۘۦۤۡۦ۫۟ۙ۠ۚ۟ۦۥۘ";
                        break;
                    case -153596728:
                        return this.f1057.size();
                }
            }
        }

        public final void onBindViewHolder(RecyclerView.ViewHolder viewHolder, final int i) {
            String str = "ۦۘۙۛۚۚۤۤۖۘۙۛ۟ۜۥۧۜۛۥۘۡ۟ۡۙۡۦ۬ۘۦ۫ۢۚۦۢ۫ۙۛۚ۬ۛۡۥۘۙۛۨ";
            boolean z = false;
            boolean z2 = false;
            final AlertDialogC0374r4 alertDialogC0374r4 = null;
            final C0368qb c0368qb = null;
            final b bVar = null;
            while (true) {
                switch ((((((((str.hashCode() ^ 458) ^ 3) ^ 627) ^ 9) ^ 218) ^ 985) ^ 430) ^ 285313341) {
                    case -1992679553:
                        alertDialogC0374r4.getClass();
                        str = "۠۟ۖۘ۟ۧ۠ۙۦۖۘۖۤۜۘۖۖۤۖۦۨۗۤۖۘۜۡۨۖۡۘۨۧۨۘۛۡۜۘۗۧ۠ۖۥۧۚۗۢۢ۫ۛۤۜ۠ۥۘۘۘۦۥۜ۫ۧۡۢۜۧۚۤ";
                        break;
                    case -1932651549:
                        str = "۠ۢۜ۟ۦۗ۠۠ۙۦۢۡۘۥۡ۬ۦۤ۬ۚۚۡۘۦ۬ۜۘ۬ۥ۟ۛۧۨۘ۠ۦ۫ۧ۠ۘۗۡۚۗۘۤۤۖۦۘۜۦۘۘ۬۫ۚ۬ۚۡۖۥۡ۫ۥ۫ۛۚۜۘ";
                        break;
                    case -1859601167:
                        str = "ۦۘۖۘۢۦۘ۟ۧۤ۟ۘۥۘۡۚۖۚۘۡ۫ۗۥۘ۠ۧۨۨ۟ۘ۟ۥۙۨۦۤۜ۬ۦۢ۬۫ۖۧۘۡ۬ۚۘۦۖۘۘ۠ۧۧۗۦۘۜۧۡۡۛۡۛۜۘ";
                        bVar = (b) viewHolder;
                        break;
                    case -1536301955:
                        str = "۠ۢۜ۟ۦۗ۠۠ۙۦۢۡۘۥۡ۬ۦۤ۬ۚۚۡۘۦ۬ۜۘ۬ۥ۟ۛۧۨۘ۠ۦ۫ۧ۠ۘۗۡۚۗۘۤۤۖۦۘۜۦۘۘ۬۫ۚ۬ۚۡۖۥۡ۫ۥ۫ۛۚۜۘ";
                        z = false;
                        break;
                    case -1053133904:
                        z2 = true;
                        str = "۟۠۬۠۬ۧ۠ۙۤۡ۟ۢ۬ۥۘۦۖۜۘۤ۟۬ۨ۠ۗۨۨۤۜۗۦۘۛۚۖۛۖۧۘۙ۫ۦۘۡۧ۬ۨۘ۟ۘۡۤۗۖۖۘۦ۫ۨۘۥۚۨ۫ۥۖۘ۟ۖۚ۠ۦۡۘ۠۫ۧۖۡۧ";
                        break;
                    case -914737100:
                        ((RecyclerView.ViewHolder) bVar).itemView.setOnClickListener(new View.OnClickListener(alertDialogC0374r4, i, c0368qb, this, bVar) { // from class: ۟.q4

                            /* JADX INFO: renamed from: ۥ */
                            public final AlertDialogC0374r4 f1041;

                            /* JADX INFO: renamed from: ۥ۟ */
                            public final C0368qb f1042;

                            /* JADX INFO: renamed from: ۥ۟۟, reason: contains not printable characters */
                            public final AlertDialogC0374r4.a f1757;

                            /* JADX INFO: renamed from: ۥ۟۠, reason: contains not printable characters */
                            public final AlertDialogC0374r4.b f1758;

                            {
                                this.f1041 = alertDialogC0374r4;
                                this.f1042 = c0368qb;
                                this.f1757 = this;
                                this.f1758 = bVar;
                            }

                            @Override // android.view.View.OnClickListener
                            public final void onClick(View view) {
                                AlertDialogC0374r4 alertDialogC0374r42 = null;
                                C0368qb c0368qb2 = null;
                                AlertDialogC0374r4.a aVar = null;
                                AlertDialogC0374r4.b bVar2 = null;
                                InterfaceC0222g3<String, C0433vb> interfaceC0222g3 = null;
                                InterfaceC0222g3<C0368qb, Boolean> interfaceC0222g32 = null;
                                boolean z3 = false;
                                boolean z4 = false;
                                boolean z5 = false;
                                String str2 = "ۢۘۗۤۗۦۥۘۘۘۨۨۢۛۥۗۦۜۦۘۧ۟ۨۘۨۤ۠ۡۦۦۘۙۙ۟۫۠ۦۨۘۘۘۦۖۤۢۜۥۘۖۛۜۘۖۛ۫۠ۨۘ۠ۜۤ";
                                while (true) {
                                    switch ((((((((str2.hashCode() ^ 263) ^ 985) ^ 492) ^ 399) ^ 165) ^ 785) ^ 859) ^ (-1612544489)) {
                                        case -1782076546:
                                            C0237h4.m1090(C0341oa.m915(new byte[]{-98, -15, -47, 102, -107, -30}, new byte[]{-22, -103, -72, 21, -79, -45}), aVar);
                                            str2 = "ۗۢۡۗۙۨۧ۠ۛۜۥ۫ۧۥۥۘ۠ۤ۬ۗ۫ۤ۟ۡۢۘ۟ۤۡ۬ۘۜۚۘۧ۟ۨۘ۬۬ۦۘ۟ۛ۬";
                                            continue;
                                        case -1735417604:
                                            str2 = "ۢ۬۠ۤۚۦۘۤۦۘۗۙۖۘۧ۫۫ۛۜۤۗ۟ۥۘۛۥۖۡۘۨۗۛۖۖۛۘۨۙ۟ۧ۟ۡۘۧۘۘ۫ۖۡۖۡ۠ۚۤۡۡۦۦۘۢۖۘۨۢۙۖۦۢۨۘۘۤۙۙ۟ۨۧ۬ۖۨۛ۫ۤۛۤ";
                                            continue;
                                        case -1679755732:
                                            interfaceC0222g32 = c0368qb2.f1759;
                                            str2 = "ۗۢ۫ۡۙۜۘۗۧۡۘۛۙ۟۬ۛۥۧۢۧۧۧۖۛۖۘۜۡ۠ۘۖۡۘۙۧۖۤۡۥۘۖۥۧۘۨۥۛ۬ۡۧۘۢ۟ۚۡۦۚۢۢۥ";
                                            continue;
                                        case -1671673577:
                                            str2 = "ۛۛۦ۬ۖۘۥۧۙۘۥۧۜۜۗۜۧ۠ۚۢۨۘ۟ۜۗۡۗۡۖ۫ۗ۫ۚۙۡۖۤ۠ۘۗ۟ۘۘ۟ۥ۫۫ۘۘۢۙۛۜۚ۫";
                                            z5 = z4;
                                            continue;
                                        case -848608090:
                                            z4 = false;
                                            str2 = "ۥۙ۠۬ۥۘۘ۟ۗۡۚۡۜۘۦۚ۫ۙ۟ۨۘۘ۟ۧۖۘۜۘ۬ۢ۫ۘۘۘ۬ۦۜ۠ۘۘۖ۠ۖۘۛۤۜۘۧۡۜ۟۠ۨۚۚۧ۟ۤۚ۠ۡۜۘۙۚۡ۠۬";
                                            continue;
                                        case -797965684:
                                            c0368qb2 = this.f1042;
                                            str2 = "۫۫ۚۗۗۤۘ۟ۗۜۘ۠۟ۡۙۜۨۘۤ۠۟ۜۡۡۘۥۙۖۤ۠ۡۖ۬ۖ۠ۗ۫ۖۥۘۘۨ۟ۦۘۖۨۡ۫ۙۨ۬ۛۦۘۦۘۧۘۚۧۦۦۜۥ۬۠ۗۚۡ۫ۗۘۜ۠ۘۘۦۢۜۘۡۦۗۧۢۖۘ";
                                            continue;
                                        case -509902294:
                                            alertDialogC0374r42 = this.f1041;
                                            str2 = "ۢۢۡۘۖۢۗۨۚۡۘ۬۟ۨۡۥۛۨۜۘۤ۠ۖۧۢۚ۟۠ۥۙۧۦۚۦۙۜۙۘۦۡ۬ۗۘ۬ۗۨۙ۠ۛۤ۟ۛ۟۫ۖۦۘۗۢۢۦۦۥۘ۬ۦۨۧۚۥۘۙۛۖۡۤۘۘ۠ۛ۫۟۬ۛۜۧۦ";
                                            continue;
                                        case -498900804:
                                            str2 = "ۚۥ۫ۥۤۗۙۛۦۧۧۥۖ۠ۜۘ۠ۘۜۧۢۢۧ۫ۥۖۨۧۦۘۜۘ۟ۨۧۘۤ۬ۥۘۦ۟۬۟ۚۛۦۗۡۡۡۖۘ۠ۨ۟ۚۦۥۜ۠ۗۢ۟ۥۘۥۖۡ۫۬ۦۘ۬ۜۨۗۡۦ۠ۧۡۗۘ۠ۛ۬ۨ";
                                            z5 = z3;
                                            continue;
                                        case -467955892:
                                            String str3 = "ۨۛ۠۫ۦ۠۫ۙۗۢۛۤۧ۠ۨ۬ۤۢ۠ۛۢۜۨۤۗۘۢۗۤ۟ۘۖۘۜۡۨۧۘ۟۫ۚۗۨۧ۠ۡۖۖۘۛۙۥۜۙۘۘ۫ۥۦۘۦ۫ۦۘ۠۫ۜۥۢ۫ۖۜۥۧۗۡۘۧۥۢۨۗۘۤ۫ۧ";
                                            while (true) {
                                                switch (str3.hashCode() ^ 270394759) {
                                                    case -1703567300:
                                                        String str4 = "ۙۜۚۖۚۨۢۙۡۡۙ۬ۚۚۥۘۢۤۤۢۧۨۘۙۧۡۢۛۧ۬۫ۢۡۧۥۘۙۨۛۛ۟۬۠ۦۜۛۛ۬۟ۚۨ۟ۡۗۗۨۘ۟ۗۘۦۢۛۨۦۖ";
                                                        while (true) {
                                                            switch (str4.hashCode() ^ (-754834018)) {
                                                                case -1042127980:
                                                                    str4 = "ۢۤۢۡ۬ۨۖ۬ۤۙۖۡۨۤۨۘۙۦۛ۫۫ۨۘۛۢۨۢ۠ۛۧۛ۬۬ۨۚۢۡۡۗۗۦۘۗۦۜ۟ۜۢ۫۠ۦۥۙۚۗۜۦ";
                                                                    break;
                                                                case -73588339:
                                                                    str3 = "ۥۤۨۘ۫ۖۤۗۘۜۘ۫ۜۤ۬۫۫ۜ۬۬ۚ۠ۚ۟۟ۢۦۡۖۙۗۙۗۘۤ۬۫ۘۛۚۛۨۥۚۗۢۥۘ";
                                                                    break;
                                                                case 336674879:
                                                                    str3 = "۠ۡۦۛۛۛ۬ۜۘۘۛ۬ۢۧۦۦۘۛۤۘۜۥۖۥۙۢۘۧۦۖۘۢ۫ۥۤۥۘۡۘۘۥۦۥ۠ۧ۬ۡۢۖۢۢ۫ۚۦۗۜۘۙۚ۠ۚ۠ۥۜۤ";
                                                                    break;
                                                                case 982758622:
                                                                    String str5 = "ۛۛۦۘۦۚۖۥ۠ۥۘۙۜۗۢۢۘۘۦۗۘۖ۫ۧۗۙۨۘ۬۠ۖۦۨۤ۟۟ۖ۬ۦۦۘۡۡۖۘۜۡۛۡۧۢۘۥۥۘۘۦ۟ۦۗۥۘ۫ۤۥۘۧۧۚۢۢۘ";
                                                                    while (true) {
                                                                        switch (str5.hashCode() ^ (-805146802)) {
                                                                            case -1196036921:
                                                                                str4 = "ۦۨۡ۬ۦۚۡۛۧۘۗ۠۫۟ۦۦۢۗۥۜۚۘۨۘۚۡۖۘۙۜۥۘۡۜۘۜۤۡ۟ۘۛۤ۟ۘۙۦۡۘۜۧۥۜۚ۫ۙۜۘۘ";
                                                                                break;
                                                                            case -336597381:
                                                                                str4 = "ۖۛۖۙۤۚ۠ۦۡ۬ۨۚۚۡۜۘۘ۟ۢ۫ۨۡۛۧۖۘۛۢۡۖۜۘ۠ۖۗۜۥۧۘۨۧۦۙۨۤ۟ۥۦ";
                                                                                break;
                                                                            case 199718590:
                                                                                str5 = "ۙۚۛۚۧۘۘۤۚۢۢۢۜۘۡۨۥۚۨۙۥۖۘۗۨۦۘۗ۟ۡۗۖۗۧۦۤۘۡۘۡۚۡۘ۟ۨۥۘ۟۠ۧ";
                                                                                break;
                                                                            case 572599078:
                                                                                str5 = interfaceC0222g32 != null ? "ۡ۫ۡۤ۠ۖۘۗۛۚ۫ۘۡۡۦۜۦ۫۟ۤۧ۬۟ۚۥ۫ۖۖۡۤۖۘۤۥۗۛۤۖۤۚۡۘۧۚۚۚ۠" : "ۛۤۡ۬ۛۥۘۧۤۖۛ۠ۢ۬ۛۢ۟ۜۚۖ۫ۤۤ۬ۖۙۡۥۘۙۜۡۧۦۧۧۡۛۥۦۥۜۡۘۦۤۧۨۛۡۘۨ۫ۘۦۡ۫ۤۗۖۘۡۜۥۘ۬۟۟ۙۚۦۘۚ۠ۢۡۦۘ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case -1556607390:
                                                        str2 = "ۡۛۤۚۘۗۜۚۜۙۢۥۗۙۢۚ۬ۜۘۤۖۜۘۚۥۚۦ۠ۢ۟ۛۜۘۖ۟ۥۖ۠ۜۘۥۘۖۧۖۦۘۥ۠ۜۚۤۨۤۙۦۘۧۥ۠";
                                                        break;
                                                    case 431771632:
                                                        str3 = "ۢ۠ۗۢۙۤۡۦۘ۬ۨۢۘۖۧۥۡۨۘۜ۠۬ۖۘۦۘۤۦ۫ۘۢ۬ۜۡۥۖۧۥۡۛ۟ۥۦۢۗۙ۫ۢۢۗۖۡۢ۬ۖۘۘ۠ۙۗ۫ۜۘ";
                                                        break;
                                                    case 1629227736:
                                                        break;
                                                }
                                            }
                                            break;
                                        case -318136536:
                                            bVar2 = this.f1758;
                                            str2 = "ۢۧۜۘۗ۬ۡۘۘۖۨۡۖۘۖۨ۟ۥ۬۠ۨۗۡۧۘۥۡۖۘۤۘۘ۫ۛۦۡۖۘۘ۠ۗۧۤۥۢۚۤۥۗۦۘۤۜۨۤ۠ۘۘ۠ۥ۠ۛۖۖۘۡۗۡۘ";
                                            continue;
                                        case -222744379:
                                            str2 = "ۛۛۦ۬ۖۘۥۧۙۘۥۧۜۜۗۜۧ۠ۚۢۨۘ۟ۜۗۡۗۡۖ۫ۗ۫ۚۙۡۖۤ۠ۘۗ۟ۘۘ۟ۥ۫۫ۘۘۢۙۛۜۚ۫";
                                            continue;
                                        case -14271821:
                                            str2 = "ۥۖ۟ۨۥۙۢۜۜۘۡۡۘۘۧۗۦۨۦۦۛۛ۫۬ۛۗۗۡۨۘۚۤ۬۫ۡ۟ۤ۟ۧۧ۫ۨۘۢ۫ۢۦۧ۫ۧۛ۠ۛۤ۠ۜ۫ۦ";
                                            continue;
                                        case 98967266:
                                            interfaceC0222g3.mo984(bVar2.f1060.getText().toString());
                                            str2 = "۫۟ۦۡۖۖ۟ۢۜ۬ۡۚۗۘ۫۬ۤۢۚ۟۬ۘۚۙۧۡۜۘ۫ۡ۬ۖۦۦۘۡۦ۬۠۟ۜۚۚۖۢۧ۫ۡۢۙۤۘۥۗۡۚۖ۟ۗ۠ۨۘۘۚۧۘۘ";
                                            continue;
                                        case 111300801:
                                            interfaceC0222g3 = aVar.f1058;
                                            str2 = "۬ۗۛۚۤۙ۫ۥۡۘۛ۠ۨۧ۠ۖۗۧۙۘۙۖۘ۬ۖۙۧۚۨۘ۬ۨۤۨۧۡۥۢۖۡۛۜۘۛۙۘۡۘۨ";
                                            continue;
                                        case 113902521:
                                            String str6 = "ۘۚۢۗ۟ۦۘۛۦۦۘۘ۠۟ۗۡۗۗۡ۠ۙۚۡۘۧۖ۠ۗۖ۫۫۫ۜۜۛۤۥۘۘۗۤۜۘۤۤۡۙۜۘۘۦۨۖۘ۠ۧۘۤۖۢۗ۠ۛۦۜۘۡۨ۬ۖۗ۫ۗۤ۟۟ۙۜۘۘۦ۫ۘۘ۠ۨۢ";
                                            while (true) {
                                                switch (str6.hashCode() ^ (-1420042341)) {
                                                    case -2097561421:
                                                        str6 = "۠ۜۡ۟۬ۜۙۜۨۢۥۗۖۡۘۘۙۥۥۘ۟ۙۥۘۙۖۨۘۖۖۦ۠ۥۡۙۛۖۘۖ۬ۚ۠ۛۗ۟ۗۦۘۤ۟ۘۙۙۨۘۖۢۘۘ۠ۙۖ۠ۧۘۘۨۘۨ۬ۤۦ";
                                                        break;
                                                    case -1465443568:
                                                        str2 = "۫۟ۦۡۖۖ۟ۢۜ۬ۡۚۗۘ۫۬ۤۢۚ۟۬ۘۚۙۧۡۜۘ۫ۡ۬ۖۦۦۘۡۦ۬۠۟ۜۚۚۖۢۧ۫ۡۢۙۤۘۥۗۡۚۖ۟ۗ۠ۨۘۘۚۧۘۘ";
                                                        continue;
                                                    case -1348224799:
                                                        str2 = "ۜۧ۬ۥۦۜۧ۬ۨۖ۟۬ۘۜۘۙ۫ۨۘۖۗ۬۟ۥۜۘۙۙۥۘۗ۬ۛۦۨۥۡۘۥۘۥۢۥ۟۠ۦۘۜ۫ۙۙ۠ۙۚ۫ۖۘ۟ۦۜۦۚۖۘۧۥۧۘۘۜۨۘ۫۠ۡۗ۠ۤ۠ۨۙۗۜۡۛۙۨۨۢۘۘ";
                                                        continue;
                                                        continue;
                                                    case 1718340617:
                                                        String str7 = "ۙۦۨۘ۟ۥ۠ۢۢۨۘ۬۟۬۟۠ۚۢۨۡۘۥۢ۫ۨ۠ۜۗۨۖۘۥ۬ۙۖۤۜۥ۬ۤۥ۟۫۫۬۠۫ۗۘۥۘۦ۫ۥۖۘ۠ۙۘۘۨ۠ۦۦۡۥۦۢۙ۟ۖۧۘۤۢۨۘۢ۬۬";
                                                        while (true) {
                                                            switch (str7.hashCode() ^ 431255305) {
                                                                case -1756237999:
                                                                    str7 = "ۛۢۗۢۛۨۘۛ۬۫۫ۥۧۚۘۜۘۢۤۗۗۥۥۘ۟ۚۖ۬ۦۘ۬ۧۡۘۢۧۗ۬ۘۧۥۡۥۛۖۦۛ۬۬ۛۜ۬ۖۨۚ۫ۛ۟ۚۨۜۘ۠ۖۧۘۨۜۤۖۧۨۘۖۘۡ۬ۖۘۘ";
                                                                    break;
                                                                case -1703219399:
                                                                    str6 = "ۦۧۦۘۧۤۘۘۤ۫ۨۘۦۜۡۡۡ۟۟ۖ۟ۧۧۡۥۧۛۥۗ۠۬ۖۗۛۧۡۥۥۘۜۦۡ۟ۡۗۖۨۘ۟ۤۛۦۜۘۘۗۘۘۜۨۦۘۚۥۚۘۦۘ۠۟ۨۘۛۜۘۤ۠ۧ";
                                                                    break;
                                                                case 196599690:
                                                                    String str8 = "ۘ۬ۨۘۚۤۛۚۜۙۡ۠ۨۘۢ۫ۨۙۜۗۥۦۘۤ۫ۥۡۙۤۚ۠ۨۘۧ۠ۦۘۜۡۘۥۨۖۦۡۧۦۚۜۖۦۜۘۗۦۙۡۧۘۘۙۖۗۚ۟۫۠ۨۙ۠ۜۚۘۡۙۙ";
                                                                    while (true) {
                                                                        switch (str8.hashCode() ^ 1630741182) {
                                                                            case 510621413:
                                                                                str8 = "۠ۜۜۗۛۢۨۖۛۧۤۧۚۤۨۘۙۙ۬ۖۥۨ۫۠ۧۗۖۜۘۚۛۡۘ۬ۦۡ۫ۤۖۦۨۦ۫ۤۡۘ۫ۤۤۡۘۧۘۘۡۤۗۤۘۘۙ۠ۜۘۧۥۧۘ۟ۦ۠";
                                                                                break;
                                                                            case 905319481:
                                                                                str7 = "ۨۙۜۘۖۙ۟ۘ۬ۙۥۖۨ۠ۡۘۘ۬ۡ۫ۥۘۜۤۚۧۡۚۦۘ۫ۨۚۜۙۢۥ۟۫ۦۢۦۘۗۢ۫۬ۜۧۖ۟ۜۛۡۖۘ۟۬۫۟ۥۘۙۘۘۚۙۡۘۨۡۜۘۚۙۨ۟۟ۢۦۡۖۘ۟۠ۜۙۘۢ";
                                                                                break;
                                                                            case 1218852268:
                                                                                str8 = interfaceC0222g3 != null ? "ۘۢۨۗۙ۠ۨۗۖۘ۫۟ۘ۠۬ۘۧۛۥۘۚۦۚۨۗۚۜۜۨۘۨۜۘۜۛۥ۬ۨۜۘ۫ۤ۫ۢۘۖۤۡۘۗۜۜۘ۫ۥۜۘۛۤۤۘۥۦۡۥ۠ۜۢۙۚۚۢ۟ۧۛۦۡۙ" : "ۦۡۘۘۛۤۘۘۚۛۦۘ۬۬ۧۨۘ۠ۙۢۡ۫ۙۢۡۢۥۨۦۘۜۚۘۘۨ۫ۛۜۗ۫ۨۖۖۘۥۖۥۘۢۖ۠ۘ۫ۨۗۤۚۥۥۘۘۗۨۜۦۡۤۛۧۖۤۘۘ۬ۖۥ۫ۗ";
                                                                                break;
                                                                            case 1612248713:
                                                                                str7 = "ۧۤۦۢۤۨۛۙۖ۟ۖۘۖ۟ۛۖۢۡۘ۟۫ۚۛۦۧۖۦ۟ۥۚۥۘۦۢۨ۫ۡۜۘ۠۠ۖۘۡ۫ۙۡۗۧ۫ۤۧۥۘۢۥۧۙۡۘۨۘۢۜۜۡۦۥۙۧ۟ۛ۬ۦۢۧۡۖۨۢۘۧۢۤۡۥۘ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 1447236595:
                                                                    str6 = "ۤ۬ۢۤۤۡۡۢۙۖۙۜۡۖۘۧۡۖۜ۟ۥۘۚۚۗ۫ۛۤ۠ۗۘۖۜۙۚۥۘۘۙۛۡۚۛۤ۫۠ۜۗۡۦۘۖ۠ۜۘۚۡۚۨۘۘۛۙۛۜ۬ۜۚ۠ۙۘۢۚۖۚۧ۠ۘۚۗۧۨۜۤۗ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                        case 214241809:
                                            z3 = true;
                                            str2 = "ۚۧۘۘۥ۫ۙۢۚۢۖۧۤۦۘۥۖ۟۠۟ۢ۠ۤۤۖ۫ۢۤۙۥۙ۬ۨۘۗۢۖ۠۠ۡ۬ۡۨۤۥۚۙۜۛۦۦ۟ۘۥۘۘۥۚ۠ۖۙۨۡۥۙ۫ۥۥۖۢۜۘۙۘۦۘ";
                                            continue;
                                        case 307532033:
                                            String str9 = "ۚۦۦۘۙۡۗۢ۫۠۠ۥۡۚۖۜۘۡۦۘۨۘۘۗۧۘ۬ۥۧۘۛۛۥۤۨۦ۟ۧۖۘۧۙۦۡ۫۟۠ۚۨۘۛۨ۬۬ۜۜۖۤۚۦۜ۟ۥ۬ۤۘۢۡۢ۬ۦۧ۠۟ۖۡۧۘ۬ۢۥۘۧۙۨۘۥۜ";
                                            while (true) {
                                                switch (str9.hashCode() ^ (-1851297242)) {
                                                    case -1387736629:
                                                        String str10 = "ۨۧۘۘۥ۫ۖۜۖ۬ۧۘۡۘۦۖۦۜ۟ۢۘۛ۠۠ۡۘۢۚۘۘۖۥۧ۟ۙۘۥۦۙۘ۠ۚ۬ۖۛۡۖۖۘۢۗۦۦۗۥۘۜۖۘۦۥۘۛ۟ۜۛ۠ۤ";
                                                        while (true) {
                                                            switch (str10.hashCode() ^ (-1243070700)) {
                                                                case -1711063417:
                                                                    String str11 = "۫۬ۙۘۤۖۘۨۢۢۡۦ۫ۜۤۛۚ۠۫۫ۦۘۦ۫ۤۨۤۖۘۦۨ۬ۢ۫۬ۘۨۦۘ۫ۢ۟۟۠ۧۦۙۜۘ";
                                                                    while (true) {
                                                                        switch (str11.hashCode() ^ (-1347833256)) {
                                                                            case -1171372474:
                                                                                str11 = z5 ? "۫ۨۤۘۥۢۜۚۗ۬ۦۨۦ۠ۜۘ۟۠۬ۡۘۙۙۡۘ۟۫ۛۛۨۡۡۥۡۘ۬ۥۡۖۡۢۥۛۗۚۘۥۥۗۘۘۙ۬۬ۚ۬ۖۘۧۛۘۘ۫۫ۦۢۥ۫" : "ۢۢۨۘ۫ۖۗ۠۠ۤۧۘۘۨۚۙۛۤۦۘۦۦۧۘۙۛۘ۠ۦۧۘ۫ۧۥۘۨۖۚۖۖۘۦۧۛۖۗۘۥۤ";
                                                                                break;
                                                                            case -375991996:
                                                                                str11 = "۠ۤۤۙۚۘۘۢ۠ۨۘۨۛۙۘۡۤۡۚۤۢۛۖۘۧۧۤۦۖۖۦۜ۫ۚۘۢ۟۟ۗۥۘۧۘۗۨۥۦۙۜۥۡۜۘ۟ۗۥۢۖ۬۠ۦۚ۬۠ۧۨۘۜۢۢ۬ۦۚ۬۟ۨۘ";
                                                                                break;
                                                                            case 481096264:
                                                                                str10 = "ۜ۫ۨۦ۟ۘۘۜۡۗۢ۫ۧۙ۬ۦۘۖۤ۟ۢۘۦۢۢۥۡۛۡۚ۬ۢۚۜۛۜ۫ۘ۬ۦۘ۠ۦۦۘۥۤۚۖۛۜۘۦۙۖۘ";
                                                                                break;
                                                                            case 1731813070:
                                                                                str10 = "ۡۙۤۤ۠۬ۨ۬ۜۘۘ۫ۖۜ۬۫ۖۨۙۦۘۤۘۘۛۤۦ۠ۧۢۧۙۥۜۘۜ۬ۜۘۤۛ۫ۙۢۢۛۤۚۧۛۛ۠ۥۗۨۤۙ۠۫ۤۜۨ۠ۚ۫ۢۘ۠۫ۘ۟ۡۘۤۘ۟";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case -1185888829:
                                                                    str9 = "ۜۙ۬۬۬ۘۘۘۢۡۘ۠ۧۚۦۦۚۚۦۖۘ۬ۧۦۘۤ۟ۛ۬۟ۦ۟ۛۛ۟ۚۚۙ۠ۜ۫ۥ۟۟ۨۘۚۖۨۘ";
                                                                    break;
                                                                case -956596496:
                                                                    str10 = "ۛۧۨۘۚۛ۟ۛ۬۟ۥۨۧۘۥۨۘۜ۟ۗ۠ۜ۟ۚۘۧۘۘۛۡۜۚۜ۬ۗۖۘ۫۬ۙۢ۟ۢ۠ۦۦۘۗۨۖۢۦ۟۬ۙۙۖۙۦۦۙۡۘۧۘۗ۫۟ۤۜۧۜۖۚ۠۠ۢۗ۬ۧۜۖ۬ۥۘۤۨ";
                                                                    break;
                                                                case -441698082:
                                                                    str9 = "ۡۖۘۡ۫ۘۡۘۧۙۡۗۖۨۛۥۡۘۚۘۨۨۜۖۘۚۙۢۙۜۡۘۤ۬ۚ۫۟ۖۘۚۧۤۛۨۗۨۚ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 977753696:
                                                        str2 = "ۜۗۤۧۛۢۦ۫ۦۘۥ۫۬ۗۢۡۘ۫ۚۚۦ۬ۚۙۙۥۡۗ۫ۜۛۡۘۡۙۖ۬ۘۖۘۤ۟ۖ۬ۛۡۡ۟۠ۡۡۘۧ۬ۙۦۚۨۘۥۡ۠۬ۧۡۙۥۢۨۥۚۜۨ۠ۘۤ";
                                                        continue;
                                                        continue;
                                                    case 1201100885:
                                                        str9 = "ۨ۟ۨۘۥۙۤۚۤ۬ۙ۟ۜۘۤۢۡۘۤۡۥۘۦۚۥۘۘۘۡۘۖۡۢۤۙۨۜۘۨۘۛۤۚ۬۠ۘۘۨۜۡۘ۬ۤۡۤ۬ۚۗ۟ۡۤۢۨۥۘۘۧۡۜۘۚۤ۟ۚۡۦۙ۟ۗۧۙۢ";
                                                        break;
                                                    case 1205127622:
                                                        str2 = "ۘۜۘۘۧۗۘ۫ۛۜۗۥ۬۠ۧۡۖۘۘ۫ۜۤۡۤۧۡۛ۟ۗۙۛۡۡۦۘۤۛۧۙۨۗۖۨۥۥۖۤۨ۫ۙۦۜۜۘ۬ۧۗۨۜۖۘۢۨۧ۬۠۬";
                                                        continue;
                                                }
                                            }
                                            break;
                                        case 623157304:
                                            return;
                                        case 658460358:
                                            int i2 = AlertDialogC0374r4.f1762;
                                            str2 = "ۖۨ۟ۘۙۖۘۦ۠ۚۨۧۘ۬ۨۜۘۛۥۧۖۘۨۘۨۚۧۥۛۜۘۚ۬ۤۧۗۢ۬ۤۖ۬ۡۧۥۘ۬ۚۚۖۘ۫ۘ۟۟ۢۖۤۙۨ";
                                            continue;
                                        case 867840902:
                                            C0237h4.m1090(C0341oa.m915(new byte[]{-27, -118, -28, 46, -4, 96, -96, -114, -4, 43, -10}, new byte[]{-63, -2, -116, 71, -113, 63}), bVar2);
                                            str2 = "۬۟ۦۢۢۨۚۨۛۢۥۘۨۡۡۘۖۢۗۙ۟ۥۘۨۦۨۘۧ۠ۦۘ۫ۘۜۘۘۢ۠۫ۖۖۘ۬ۨۧۦۛ۠ۗۥ۠ۦۙۨۤۙۨۨۘ۬ۛۨۘۧۖۙۗ۫ۚ۟ۘۜۘۥ۫ۥۤۡۘۘۚۢۘۘۚۥۨۘ۠ۨۤ";
                                            continue;
                                        case 1258860244:
                                            aVar = this.f1757;
                                            str2 = "ۜۨۘۤۚۘۦۤۨۘۜۜۜۙۨ۫ۧۛۙۢۢۜ۬۬ۥۘۙۖۚۙۗۜۘۜۦۚ۫ۘۚۘۚۖۜ۟ۧۥۥۦۖ۟ۖۘۦۧۥۘۧۨۜ۫ۛۦۘۛۜۘۛ۠ۘۘۨ۟۫ۖۢ۟";
                                            continue;
                                        case 1352686809:
                                            String str12 = "ۜۗۦ۬ۙۖۘۥۙ۠۟ۢ۫ۗ۬ۖۘۧۢۛ۠ۚۗ۫ۧ۬ۧۘ۬ۘۢۚۥۦۨۘۜۗۜۜ۟ۤۚۦۘۘۚۨۖۘۢۘۡۖۦۨۘۤۚۜۘ";
                                            while (true) {
                                                switch (str12.hashCode() ^ (-1151333663)) {
                                                    case -1741900779:
                                                        str2 = "ۖۨۘ۠ۗۛ۫۫۠ۦ۟ۨۖۢ۬ۥۜۘۨۖۢۛ۬۬ۥۤ۠ۛۖۖۜۖۙ۟ۢۢۚۨۤۡ۠ۡۘ۟۫ۚۘۦۢۧۚۦۚۨۘۥۗۦۘۙۨۦۙۘ۬ۧۙۡۘۛ۫ۨۘۜ۬ۜۤ۠ۡۘۛ۠ۘۖۢۖ";
                                                        break;
                                                    case -1537400971:
                                                        str12 = "ۤ۠۠۟۫ۖۧۧۘۚۨۥۘ۬ۜ۠ۡۚ۟ۧۙ۫ۛ۠ۥۘ۬۠۬ۙۥۨۚۖۜ۫ۜۧۘۖۖۘۙۜۖۘۘ۬ۜۘۨۢ۫۬ۨۧۘۦۖۨ۟ۨۦ۬ۢۡۘۙ۠ۧۨۘۥۘ۫ۢۨۙۜۜۗۚۘۘۡۗۢۜۘۧ";
                                                        break;
                                                    case -1219898252:
                                                        String str13 = "۫۟ۨۙۗۧۨۨۙۡ۠ۦۘۤۡۧۘ۫ۗۥۦۦۨۘۜ۫۟ۧ۟ۚۛۤۙۜۨۖ۫ۘۜۚۘۘۜۜۖۘۢۧۚ۫۫ۘۛۥۖۘۗۛ۟ۢ۫ۙ۫۠ۘۘۜۛۤ۟ۡۘۦ۟ۜۥۙۗ۬ۦۨۘۨۢ۬ۜۢۧ";
                                                        while (true) {
                                                            switch (str13.hashCode() ^ 1252786673) {
                                                                case -525910957:
                                                                    String str14 = "ۚ۠ۘۘۙۡۢۛۘ۟ۜۗ۠ۨۚۘۘۤۦۡۢۜۢۘۤۦ۟ۗۨۘۖ۬ۦۘۨۗۘۘ۠۫ۦۘۤۙۦۘ۟ۛۧۜۚۧۙۙۙۥۦۜۧۗ۟";
                                                                    while (true) {
                                                                        switch (str14.hashCode() ^ (-845421403)) {
                                                                            case -177594698:
                                                                                str13 = "ۧ۟ۖۜۦۘۥۙۨۘۨ۠ۨۤۗۗۗۧۦۘ۫ۦۚ۟ۘۡۖۤۡۤ۫ۖۥۤۖۙۦۗۜۚۡۜ۠ۙۨۘ۬ۖ۟۟ۛۖۤۥۛۛۖۦۤۘۡۥۧۚ";
                                                                                break;
                                                                            case 919625323:
                                                                                str13 = "۟ۛۦۚۢۦۘۡۗۖ۬۬ۗۖ۬ۦۘۜۘۡ۫ۛۜۜ۟ۘۘۘۛۘ۫ۦۘ۬۬۬۬ۛۨۛۙۖۘۢۡۤۥ۠ۨۘۘ۫ۖۘۤ۟ۢ۬ۧۨ";
                                                                                break;
                                                                            case 1443891853:
                                                                                str14 = "۠۫ۥۦۥۗۨ۟۫ۦۤ۟ۡۘۖۘۖۡۛۙۢۡۘۖۛۛۡۤۨۜۨۢ۠۫۟ۗۜ۟ۚۦۘۦۖ۟ۤۦ۟ۘۡۡۘ۟ۤۢۜ۬ۘۖۤ۫ۗۛۧ۟ۨۦ";
                                                                                break;
                                                                            case 2040413185:
                                                                                str14 = interfaceC0222g32.mo984(c0368qb2).booleanValue() ? "ۘ۟ۨ۫۬ۜۦۖۛۚۗۨ۬ۖ۠ۚ۫ۖۤۗ۠ۤۘۨۧۢۧۥۘ۫ۤۙۢۚۗۥۘۚۘۘۚ۫ۡۘ۟ۦ۟ۨ۟ۧۖۗۙۤۜ۟" : "۟ۜۛۛ۬ۡۢۗۖۘۡۜۙۖۜۥۘ۫ۥۘۢۤ۬۬ۤۧۥۨۦۘ۠ۦۧۘۛۜۙۤۧ۟ۙ۫ۙۙ۟ۙ۫ۨ۬۫۫ۡ۫۫ۥۘۖ۬ۚ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 100678904:
                                                                    str12 = "ۛۨۧۘۘۡۛ۠ۜ۫۟ۛۢۖۘ۠ۦۡۡۚۥۜۤۜۖۘۘۚ۠ۘۢۚۤۚۦۛۨۨۢۚۡۖۚ۬۟۟ۖۨۦۘۖ۫ۦۘۛۥ۬ۥۦۥۘ۫ۢۧۧۙۛۥۡۘۤ۫۠ۙۚۨۘ";
                                                                    break;
                                                                case 1800233499:
                                                                    str12 = "۟ۗۙۘۖۜۘۗۙۥۘۦۢۦۢ۫ۖۡ۠ۥۘۗۛۦۗۗۖۘۡۙۦۢۦ۫ۜۘۡۘۜۢۨۘۨۜۤۨۙۜ۠ۨۨۘ";
                                                                    break;
                                                                case 1920198836:
                                                                    str13 = "۬ۗۖۘۡۛۥۢۘۢ۠ۢۗ۟۠۠ۙۥۜۘۦۡۖ۟ۦۘۚۦۜ۠ۨ۬ۥۨۗۗۜۤۧۥ۫ۚ۬";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case -502784257:
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1643386987:
                                            C0237h4.m1090(C0341oa.m915(new byte[]{105, 7, -37, 97, 27, -107}, new byte[]{29, 111, -78, 18, 63, -91}), alertDialogC0374r42);
                                            str2 = "ۛ۟ۢۢۥۧۖۜۡۡۨۖ۫ۙۦۘۥۙۧۡ۬ۨۘۨ۫ۖۢ۟ۚ۠ۘۦۘ۬ۖ۟ۧۚۦۧۛۨۘۛۖۜۘۡۚۙ۫ۨۙ۬۟ۨۧۘ";
                                            continue;
                                        case 1660823431:
                                            alertDialogC0374r42.dismiss();
                                            str2 = "ۜۗۤۧۛۢۦ۫ۦۘۥ۫۬ۗۢۡۘ۫ۚۚۦ۬ۚۙۙۥۡۗ۫ۜۛۡۘۡۙۖ۬ۘۖۘۤ۟ۖ۬ۛۡۡ۟۠ۡۡۘۧ۬ۙۦۚۨۘۥۡ۠۬ۧۡۙۥۢۨۥۚۜۨ۠ۘۤ";
                                            continue;
                                        case 2122846764:
                                            C0237h4.m1090(C0341oa.m915(new byte[]{78, 109, 93, -127, -55, 104, 35, 110, 84, -118}, new byte[]{106, 0, 50, -27, -84, 4}), c0368qb2);
                                            str2 = "ۙۨۢۚۜۖۘ۫ۧۨۨۚۦۘۧۚۜۘۗۙۜۘۛۗ۠ۨۜۘۥۖ۬۠ۨۦۗۥۗ۟ۚۘۘۗۚۖۘۘ۫ۢۛۧ۬ۤ۠ۨۘ۠ۧۜۤۘۨۘۙۙۦۘۤ۟ۡۨۛۨۘ";
                                            continue;
                                    }
                                    str2 = "ۚۨۘۘۜۥۖۘۡۧ۟ۤ۠ۢۢۨ۠ۤۛ۠۫ۗۜۡ۟ۜۡۦۥۘ۠ۜۤۜۦۧ۫ۗۜۘ۟۬۠ۢۥۘۚ۬ۥۨ۟ۚۤۘۨۢۖۘ۫ۡۢ۫ۖۡۘۘۜۛ";
                                }
                            }
                        });
                        str = "ۥۢۛۖ۟ۘۜۖۧ۬ۚ۠۫ۢ۠ۘ۟ۨ۫ۚۥۘۢۡۦۚ۬ۨۜۛ۟ۛۙۗۗ۟ۗۥۨۧۘۜ۟ۖۘ۫۠ۡۚۖۘۨۥۚۗۤۥۙۖۦۡ۠ۤۛۥ۟ۡۘۘ۟ۖۢۜۢۥ";
                        break;
                    case -775202956:
                        return;
                    case -687255760:
                        str = "ۨۦۖۘۥۙۜۛۘۦۘ۫ۤۨۘ۠ۦۡ۟ۚ۟ۖۗۙۡۗ۫ۛۥۜ۬ۗۛۚ۟ۜۘ۟ۘ۬ۢۘۦۘۘ۟ۧ۬ۘۡۘۚۖۘۘۚۛۤۡۧ";
                        z = z2;
                        break;
                    case -551659514:
                        str = "۟ۙۥۘ۟ۦ۠ۜۡۡۛ۟ۦۙۗۦۘۚۜۥۘۜۙۛۥۛۖۖۡۘۘۜ۟ۘۡۖ۬ۖۜۚۧ۠ۥۘۚ۫ۘۥۙۜۘۘۤۖۘ۫۠ۘ۠ۙۤ۫ۚۤۥ۟ۗۨۖۨۗۘۦۘۧۜۧۢۖۦ";
                        break;
                    case -517247381:
                        C0237h4.m1090(C0341oa.m915(new byte[]{-91, -61, -97, 14, -28, 121}, new byte[]{-51, -84, -13, 106, -127, 11}), bVar);
                        str = "۬ۗۖۜۜۖۘۗۜۥ۟ۗ۟ۚۚۘۘ۟۬۬ۥ۠ۨۡۖۛ۟ۙۥۗۜۦۘۙۨ۟ۢۢۡۥۖۨ۫ۦۡۧ۬ۥۘۥۢۤ۠ۜۘ۫ۡۖۘ۬۫ۜ۟ۖۧۘۜۖۙۚۗ۫ۤۗۦۚۘۘ";
                        break;
                    case -497925555:
                        bVar.f1059.setTypeface(Typeface.DEFAULT);
                        str = "ۚ۟ۧۜۙ۬ۖۡۦۗۜۗ۫ۗۦۤۖۦۖۖۨۨۥۗۛ۬ۨۘ۟ۚۡۥۚ۬ۖۚۦۗۡۡ۟ۡ۬ۢۡ۟ۘۥۦۘۢۧۨۘۡۚۖ";
                        break;
                    case -495379216:
                        str = "۬ۗۖۥۚۙۥ۟ۘۘۦۡۥۧۡۥۘۥۧۖۘۥۡۦۖ۠ۦۛۤ۟ۘۤۦۦ۬۟۫ۙ۠ۗ۠ۡۘۤۤۛۥۥ۠ۡ۠ۚۛۧۘۜ۬ۛ";
                        break;
                    case -492320191:
                        String str2 = "ۥ۠ۨۘ۠۬۫ۦۧۨۘۖۘۤۨۧۜۙۜۦۘۦ۬ۖۘۘۚۗ۬ۖۘۘۦۜۖۘۦ۠ۧۨۤۜۗ۫۠ۤۨ۬ۦ";
                        while (true) {
                            switch (str2.hashCode() ^ 999949937) {
                                case -1826647758:
                                    str = "ۚۗۖۘۛۛۖۛۥۘ۠ۘۖۥۨ۠ۛۦۧۗۡۡۘۤۨۡۘۖۙۧۥۙ۟ۢۘۘ۬۟ۡۘ۠ۜ۫ۦۧ۠۬ۗۥۛۙۦ۬ۚۤۛۜۘۙ۠ۗۗ۫ۗۧ۬ۢۧۖۘۦۗۨۘۤۤ";
                                    continue;
                                case -1277418795:
                                    str = "ۜۥۦ۠۟ۡۘۧ۬۫ۚۜۜۘ۠ۤۜۘ۬ۙۛۚۡۘ۬ۧۧۧ۬ۡۘۨ۬ۡۚۢۧۛۦۡۥۘۥۢۤ۟ۥۙۦ۬ۘۘۚۨۘ۟۬ۥۗۤ۠ۡۙۨۘۧ۠ۜۘ";
                                    continue;
                                case 668047994:
                                    str2 = "ۗ۟ۡۘ۟ۗۦ۫ۦ۠ۡۢۘۖۡ۫ۨۚۥ۬۫ۖۗۛۘۘۚ۟ۙۤۗۦۘۘۘ۟ۤۜۜۧۨۘۘۡۤ۬ۗۧ۬۫ۘۘۖۤۡۘۘۧ۫ۙۥۛ۫ۡۨۘۘۜۜۘ۫ۡۥۘ۟ۨۙۘ۫۠";
                                    break;
                                case 1234659788:
                                    String str3 = "ۢۚۡۜۗۖۥۚۘۥ۫ۡ۟ۗۛۜۘۖ۬ۗۛ۟۫۠۬ۨۘ۠ۤۡۘۨ۠ۘۘۙۥۨۘۗ۠ۦ۟ۢۜۘۢۤۘۢ۬ۦۘۜۘۥۘ۠ۗۨ۫ۘۖۦۘۛۛۢۨ۠ۗۢۢۘۘۚۤ۟ۨۨۨۚ۬ۢۧۘ۬";
                                    while (true) {
                                        switch (str3.hashCode() ^ 1203470415) {
                                            case -1930629114:
                                                str3 = "ۖۥۧۥۜۘۜ۠ۘۚۡۗۢۦۗۧۡۡۘۥۚۨۘۖۖۤ۠ۧۦ۟ۥ۟ۛۛ۫ۙۨۘۨ۬ۥۘۛۤۦ۟ۖۘۧۢۡ۫ۥ۫۬ۚۥۙۨ۬ۨۚۦۘۧۜۘۨ۬ۤۙۢۢ۫۫ۧۜۨۗۨۖ۟ۜۦ";
                                                break;
                                            case 1015107148:
                                                str2 = "ۧۦ۠ۥۢۦۘ۬ۙۙ۫ۚۥۘۤۘۢۢۢۡۘ۬ۦ۬۫۫ۥۢۚۧۥۤۢۖ۫ۖۘۨۧۜۜۧۘ۠ۥۜۢ۫";
                                                break;
                                            case 1411186303:
                                                String str4 = "۠۬ۛۗ۬ۤۨۢۛۡۡۧۘ۠۠ۙۡۥۥۦۤۦۘ۫۬۬ۖ۟ۖۘ۫۫ۢۘ۟ۥۘۨۛۦۦۙۖۘ۬ۘۙ۬ۧۙۘۧۜۧۛ۬ۥ۟ۡۘۘۦۘۜۦ۠ۤۥۘۘۨۛۙۦۥۘۜ۬ۨ";
                                                while (true) {
                                                    switch (str4.hashCode() ^ (-76113217)) {
                                                        case -191195156:
                                                            str3 = "ۨۢ۠ۦۤ۬۟ۛۡۘۡۖۥۡۥۗۦۖۖۘۢ۟ۖۤۡۥۘۨۚۘۘ۠ۢۗ۬ۢۗ۟ۘۘۧۤۚ۬ۧ۫ۛ۟ۨۘ۫ۚۨۤۦۖۢ۠ۖۘ۬۠ۘۘۙۦۙۥ۬۠ۥۥ۫ۤۥۜ۟ۘۧۘۥۥۗۢۗۦۘۚۖۙ";
                                                            break;
                                                        case -119956510:
                                                            str3 = "۠ۦۘ۬ۜۥۖۖۘۜۨۘۘۜۚۘۘ۠ۚۡۘۢۤ۠ۙۘۘ۠۠ۥۛۥۨۘۨۢۘ۫ۖ۠ۤۡۗۥۖۖۖۨۖۘۢۚۛۧ۟ۥۙ۫ۡۙۚۥۚ۫ۢۙۢۢۥۢۗۜۢۨۛۛ۬ۖۗۥۘۛۦۡۘ";
                                                            break;
                                                        case 384514102:
                                                            str4 = "ۖۚۥۘۢ۬ۜۘ۬۬ۡۖ۬ۘۘۥۘۢۨۡۚ۬ۛۜ۠ۚۛۜۖۧۘ۬ۡۘۗۗ۫ۡۨ۠ۥۜۨۖۡۚۚۖۚۨۡۗۚۚۨۜۧۦۛۨۢۖۜۛ۠ۙۖۘۙۦۡ۫ۢۨۘۚ۫ۥۘۤۗۢۚۡۢۤۖۦۘ";
                                                            break;
                                                        case 856076204:
                                                            str4 = z ? "ۚۢۥۙۥۜ۬۬ۡ۬۠ۨۘ۟۠ۖۘۗۦۙ۫ۜۡۚۨۥۘۡۥ۬ۢ۬ۦۘ۫ۥۤۡۚۛ۠ۤۜۦۤۦۙۘۘ" : "ۚ۬ۡۘۗۖۜۘۨ۠ۡۡۦۥۨۗۥۘۚۧۥۤ۫ۗۤۘۥۘۡۨۨۘۡ۫ۦۘۤۦ۠ۢۜۢۨۢۖۘۜۥۙۖ۬ۥۘ۬ۛۙۡۚۡ۫ۤ۫۟ۜۨۘۥۥۡۗۦۘۘ";
                                                            break;
                                                    }
                                                }
                                                break;
                                            case 1781235819:
                                                str2 = "۟ۦ۠ۨۗۙۦۡۚۧۨۡۘ۟۟ۦۢۙۨۥ۫ۡۘۢ۬ۖۘ۫ۚ۠۠ۚۘۚۥۘۘ۠۟ۛۚۢۗۙۜۙۨۨۦۗۖ۟ۨۖۜۙۜ۬ۢۦۡ۬۫ۢۡۘ";
                                                break;
                                        }
                                    }
                                    break;
                            }
                        }
                        break;
                    case -350148943:
                        bVar.f1059.setText(c0368qb.f1049);
                        str = "ۥۢۨۘۢۢۦۘ۟ۛۘۛ۫ۚ۫ۚۥۘۚۦۚۡۖۡۘۧۦۛۧۜۡۘۚۦۘۡۚۗۤۨۢ۠ۙ۟ۛ۬ۛۖۙۥۥۥۧ۬ۖۘۧ۟ۘۧ۬۫ۡ۫۬۫ۧۤ۟ۚۧۗۖۖۚۚ۬۟ۜ۫۬ۢۘۛ۫ۧ";
                        break;
                    case -91429037:
                        str = "ۤۦۘۙۗۡۥۛۜۘ۟۟ۢ۟ۦۖ۬ۤۡۘۜۦۨۘ۠ۨۘۘۦۚۜۘۧۘۢۢۛ۠ۖ۟ۚۧۧۘۘۚ۬۫۬ۖۧۨۚۜۘۙ۬ۤ۫ۜۘۘۢۗۧۥۗۢۙۧ";
                        break;
                    case 311792521:
                        bVar.f1060.setText(c0368qb.f1050);
                        str = "ۙۦۤۘۚ۬ۙۧ۬ۙۖۜۘۛۗۘۢ۠ۖۚۤۘۘۛۜۗۤۛ۟ۨۦۢۘۨۗ۠ۨۜۢۙۧ۠ۧۤۨۧۘۙۤ۟ۙۨۨۢ۬۬ۢۨۥۙۜۧۘۡۚۦۘۥۛ۫ۘ۟ۨۜۦۖۘ";
                        break;
                    case 574548795:
                        str = "ۛۘۘۜۧۥۘ۫ۘۥۘۦۛۦۘ۫ۧۘۜۥۨۦۜۧۛۡۘۡۧۚۧۤۧۢۤۦۘۢۜۖۤ۫ۚۤ۫۠ۘ۠۟ۘۨۘۦۢۛ۫ۡۨۛۨۖ۠ۨۘۧۘۗۚۗۘۗۨۧۘۙۨ۟ۡ۠ۢۥ۬ۜۘۧۥۘ";
                        c0368qb = this.f1057.get(i);
                        break;
                    case 684247518:
                        bVar.f1060.setVisibility(0);
                        str = "ۧ۟ۛۧۥ۟ۤۡ۠ۙۧۨۘۙ۟ۚۖۢۥۥ۫ۤۛۦۜۙۦۧۘۢ۠۫۬ۜۘۨۡۢ۠ۤ۟ۢ۠۟ۗۨ۠ۡۗۚ۠ۥۧۦۖ۬۫ۡۚۛۤۜ۟ۦ۟ۖۘ۟ۗۤ۠ۜۗۚۦۡۨۘۥۨۧۥ۠";
                        break;
                    case 909781159:
                        String str5 = "۠ۡۥۙۘۙۤۦۗۤۜۛۨ۠ۥۥ۠ۙۛۚۧۦۘۧۘۤۥۙۤۦۘۡۖۧۘۥۢۖۘۙۙۜۛ۠ۥۤۛۢ";
                        while (true) {
                            switch (str5.hashCode() ^ 1733463231) {
                                case -2060032005:
                                    str = "۫ۤۧ۟۠ۛۜۙۤۗۡ۟ۧۖۧۡۜ۠۟ۦۡۖۗۢ۠ۖۘۤۧۥۘ۫ۜۤۜ۟۠ۤ۟ۦۘۡۛۖۙۥۤۚۛۡۙ۫ۘۘۘۦۖ";
                                    continue;
                                case -1407642959:
                                    str5 = "۠۬ۖۙ۬ۖۧ۠ۘۙۘۨۘۤۚۛۤۙۛۤۙۥۨۢۗۡۤۡۘ۟ۥۦۛۖۘۘ۫ۤۦۘۖۡۡۘۘۗۥ۟ۢۢۢۘۘۘ۫ۢۘۘۤۤۨۘۚۘۦۘۗۜۡۧۤ۟ۥۧۨ۫ۢۧ۫۠ۦۘ";
                                    break;
                                case 132928439:
                                    str = "ۡ۬ۖۘۥۘۛۦ۫ۜۚۙۥۧۖۛ۟ۘ۫ۦ۫ۤۢۜۘۖۗۧۥۦ۠ۖۖۙ۫ۚۤۖۖ۬ۤۡۚ۬ۦۧۜۚۙۧۗۡۡۖ۬ۢ۫ۚۚۥ۬ۢ۠ۚۖۚۖۘۡۗۥۦۡۦۘ";
                                    continue;
                                case 1170425361:
                                    String str6 = "ۚۢ۬ۛۦۧۘۛۨۖ۠ۨۚۛۤۛۤ۟ۛۧۡۡۘ۬ۘۨۘۦۨ۟ۖ۬ۜ۫ۛ۬ۧۚۥ۟ۦۢۗۘۚۗۚ";
                                    while (true) {
                                        switch (str6.hashCode() ^ (-706698831)) {
                                            case -2068116377:
                                                str5 = "ۨۧ۫ۛۡۖۘۜۖۧۘ۠ۨۥۘۢ۟ۢۖۗۦۘۘ۠ۡۛۘۥۛۥۧ۫ۛۜۘۛ۬ۨ۠ۦۢۘۦۜۢ۠ۥۘۘ۫ۗۘۙ۫ۙ۫ۡۘۛۡۡۘ۫۫ۨ۠ۤۙۤۥ۫۟۟ۘۘۡۚۖۨۦۛۥۢۖۡۦۘۡ۫ۡۘ";
                                                break;
                                            case -627557951:
                                                str5 = "ۘ۫ۤۤ۠ۜۙۗۜۗۡۧۜۢۙۗ۫۟ۡۡ۠ۘۘۛۜ۟۫ۥۜۘۧ۬۟ۘۥۗۖۖۧۘۢۥۘ۬ۦ۟ۨۖۜۘۧۗۖۘۙۤۖ";
                                                break;
                                            case -66743388:
                                                str6 = "ۛۚۚۨۘ۫ۨۥۥۜۘۗۙ۫۬ۤۛ۟ۘۢۦۘۛۜۖۘ۫ۦۗ۠ۘۧۘۚۧ۠۟ۢۦۘ۟ۗۘۖۜۛۛ۠ۦۘۦۥۘۘۥۙۘۜۢۥۘۦ۬۟۫ۥۢۤۘ۬۬ۧۖۘۦۖ۬ۛ";
                                                break;
                                            case 501216213:
                                                String str7 = "۟ۘۙۡ۫ۨ۫ۧۗ۠ۦۤ۟ۡۨۘۙۖۨۘۛۡۖۘۥۡۜۛۗۖۗۜ۫۫ۢۛۧۤ۟ۙۖ۠ۙۢ۟۫ۙ";
                                                while (true) {
                                                    switch (str7.hashCode() ^ (-1496660585)) {
                                                        case -1598596061:
                                                            str7 = "۠ۨۤ۟۠ۡۦۨۗۙۤ۟۫ۡۤۡۜۤ۟ۨۖۢۜۧۘۛ۟ۤۥۤۘۘۤۛۦۘۛ۠ۡ۟ۘۛۢۡۘۘ۬ۘۘۘۜۥۤۡۦۡۘۗۥ۫ۚۥ۬ۦ۬ۘۘۘۡ۫";
                                                            break;
                                                        case -908765516:
                                                            str7 = c0368qb.f1050.length() > 0 ? "ۙ۬ۜۙ۟ۜۢۖۘۨۡۖ۬۠ۦۘۜۧۦۗۖۨۘۨۚۢ۟ۘۡۦۙۨ۫ۢۡۘۢۜۖۧ۠ۛۤ۫۟ۢۧۤۚۛۥۤۥۥ۫ۜۘۗ۠ۧ۫ۙۖۘ۠ۢۘ۟ۚۘ۠ۗۢۙ۟۫ۨۢۗۛۛ۬ۧۘۦۘ" : "ۗۗۚۙۜۥۤ۬ۖۘۦۛۨ۬ۚۢۡۧۡۘۘ۟ۨۙۢۜۤ۫۠۬۬ۚۜۥۦۘۖۨۥۥۗۧ۠۫ۨ۠ۜۨۘۖۜۥۖۚۖۗۤۛ";
                                                            break;
                                                        case 449193861:
                                                            str6 = "ۛۢۡ۠ۛۘۜ۫ۙۦۜۜۚۥۨۢۤۚۤۙۦۗۛۥۢۛۥۦۗۛۜۘ۬ۙۖۘۧۤۢۦۖۜۢۘ";
                                                            break;
                                                        case 1179793079:
                                                            str6 = "ۜۗۦۥۘۦۤۖ۟۫ۢۘۘۘۥۖ۟ۥۘۘۦۖۜۘۚۢۤۘۨۘ۟ۚۢۘ۫ۖۜۚۛۜۗۨۥۤۤۘۚۦۘ۟ۨۘۗ۟ۛ۫ۗۖۘۚۧۛۥۨۤۥ۠ۗ";
                                                            break;
                                                    }
                                                }
                                                break;
                                        }
                                    }
                                    break;
                            }
                        }
                        break;
                    case 1196680257:
                        bVar.f1060.setVisibility(8);
                        str = "ۤۦۘۙۗۡۥۛۜۘ۟۟ۢ۟ۦۖ۬ۤۡۘۜۦۨۘ۠ۨۘۘۦۚۜۘۧۘۢۢۛ۠ۖ۟ۚۧۧۘۘۚ۬۫۬ۖۧۨۚۜۘۙ۬ۤ۫ۜۘۘۢۗۧۥۗۢۙۧ";
                        break;
                    case 1482930407:
                        str = "۠ۢۘۜۗۥۘۤۚ۫ۦۢۦۘۢ۬ۖۘۚۦۘۘۘۚۡۙۤۢۛ۫ۙۗۚۡۡ۬ۚۛۛۥۘۡۖۤۘۖۖۘۘۨۗۦۜ۫۟ۥۘۚۤۛۨۙۧۥۛۛ۟ۜۚۤۚۦۘۦ۠ۥۘۤۧۚۨۚۧۥۥۥۘۗۜ۠";
                        break;
                    case 1488322004:
                        str = "ۤۛۨۘۙۙۜۚۡۤۢۤۤۖۘۚۗۥۘۡ۫ۜۘۙۛ۟ۙۥۡۘۙۢۡۧۚۡۗۖۨۚۖۧ۟۟ۜۥۢۗ۠ۤۖۦۛۧ۬ۡۤۤۨۛۥۘۖۜۥۘۖۜۖۜۤ۬ۚ۟ۦۘ۬ۜۘۢ۠ۦۡ۫ۡۘ";
                        break;
                    case 1568999757:
                        alertDialogC0374r4 = this.f1766;
                        str = "۬۠۫ۦ۟۬ۧۜۛۨۙۗۚۜۡۘۥۖۦۘۙۛۧۨۖۗۘ۠ۥۘۤۧۥۦۦۜۨۙۦۘۧۥۘۖۥۜۘۙ۟ۥۗۦ۬ۚۢۦۥۚۗۡ۠ۥۘۗ۬ۙۚۗۤ۫ۢۖۚۚۡ۫ۖۛۦۚ۟ۥۖۨۗ۠ۡۘ";
                        break;
                }
            }
        }

        public final RecyclerView.ViewHolder onCreateViewHolder(ViewGroup viewGroup, int i) {
            LinearLayout linearLayout = null;
            StateListDrawable stateListDrawable = null;
            ColorDrawable colorDrawable = null;
            ColorDrawable colorDrawable2 = null;
            int i2 = 0;
            TextView textView = null;
            TextView textView2 = null;
            String str = "۫ۢۡۙۥۧ۟۟ۜۘ۟ۚۛۤ۫ۨ۠ۧۖۙ۠۬ۧۘۥ۫ۤۧۜ۠ۡۘ۬ۨۨۗۚۢۚۚۡۚۦۧ۟ۜۜۢۤۖۜ۫ۦۤ۫ۤ";
            while (true) {
                switch ((((((((str.hashCode() ^ 634) ^ 586) ^ 142) ^ 767) ^ 559) ^ 773) ^ 738) ^ (-1334857549)) {
                    case -1902463894:
                        return new b(this.f1766, linearLayout);
                    case -1478242995:
                        textView.setTextSize(16.0f);
                        str = "ۡۘۖۧۧۥۘۙ۟ۤۡۤۡ۠۫ۤۨۢۖۘۥۚۥۚۤۚۘۦۥ۫ۜۖۛۘۤۖۡۙۖۚۦ۫ۨۘ۫ۘۤۚۥۘۜ۟ۦۖۤۘۘۙۤۦۘۙۤۛۗۙۢۘۛۙۨۖۗۖۦ";
                        break;
                    case -1414294842:
                        linearLayout.addView(textView);
                        str = "ۗ۫۫ۧۧۦۡ۬ۙۨ۫ۨۖۥۥۘۧۢۘۘۜ۟۬ۨۖۘ۠۬ۥۘ۟ۥ۫ۨ۟ۥۘۤ۬ۖ۫ۧۨ۠ۦۨۢۙ";
                        break;
                    case -1214868168:
                        textView2.setLayoutParams(new LinearLayout.LayoutParams(-1, -2));
                        str = "ۤۘۨۜ۟ۖۘۘۧۗۛۦۢۚ۬ۜ۫ۡ۫۫ۗۙۦۙۖۘ۠ۘۘۗ۬ۙۤۥۢۙۖۘۨۘۤۡۥۡۙۧۘۘۥۗۚ۫۫ۖۘۥۧۤۖۥ۟ۘۗۖۘۜ۬ۢۙۨۛ۟۬ۦۘۛۗۙ۠ۢ۟ۨ۫ۤۤۘۡ";
                        break;
                    case -1189037793:
                        textView2.setGravity(0);
                        str = "ۥ۟ۢۥۧۥۘۙۢۢۗ۬ۘۨ۫ۚۧ۠۠۟ۡۡۧۛۚۜۚۗۛۗۙ۫ۡۗۡۘۙۜۧۘ۠ۤۥۘۤۦۨۘ۟ۛۥۘۙ۟ۦۘۢۖۘۘ۟ۧۡۘۜۥۥۘ۬ۧۚ۟ۙۗۢۘۨۘۘۚ۫";
                        break;
                    case -1033855203:
                        stateListDrawable.addState(new int[]{R.attr.state_pressed}, colorDrawable2);
                        str = "ۤۖۡۘۢۖ۟ۙۛۜۘۛۥۥۗۡۤ۟ۤۧۧۧۤ۠ۧۖۧۨۡۘۚۧۙۘ۟ۜ۟ۘۜۘۙۢۗۧ۫ۛۥۨۨۜۢۡۖۗۘۛۘۘۡ۫ۧۢۛۙۥۤۙ۫ۘۛۥۛۛۢۚۨۘۨۗ۟ۢۧۘۡۜۧ";
                        break;
                    case -947097933:
                        linearLayout.setOrientation(1);
                        str = "ۘ۬ۥۘۧ۟ۗۤۙۙۥۧۨۘۨۤۛۗۥۡۙۥۥۘۗۛۗۛ۫ۖۘۜۧۜۘ۬ۨۚۖۡۘۦۚۙۤۥۚۗ۠ۙۚۘۢۨۤۗۡۘ";
                        break;
                    case -942391749:
                        str = "ۡۤۤۢۥۘۘۛۗ۬ۗ۫ۥۘۧ۫ۡۗۜ۬۬ۦۗۡۚۥۗۢۘۘۡۗۧۧ۟ۥۨۘۘۥ۠۠۫۫ۖۛۚ۬";
                        break;
                    case -925280804:
                        textView.setLayoutParams(new LinearLayout.LayoutParams(-1, -2));
                        str = "ۤۢۚۘۜۨ۬۬ۜۘۗۚۚۖۦ۬ۜ۠ۡۘ۫ۖۗ۬ۚ۬ۧ۬ۧۥۜۥۡ۫ۨۡۙۘۘۚ۫ۚ۟۫۬ۜۖۤۥۥۡۨۜۜۧۖۘۤۖۜۨۧۦۢۜۖ";
                        break;
                    case -892260613:
                        linearLayout.setPadding(i2, i2, 0, i2);
                        str = "۫ۚۜۘۜ۬ۘۘۦۦۥۘۤۖۚۖۧۚۨ۫ۧ۟ۚۚ۟ۨۙ۠ۥۨۥ۠ۖ۟ۤۜۚ۠ۚۘۛۥۘۤ۫ۨۘ۟ۗۨۤۨۡۘۦ۬ۛۦ۬ۘ۬ۗۦۘۜۛۘ۟۬ۜ";
                        break;
                    case -562180977:
                        str = "ۤ۬ۚۧۛۜۚۦۢ۫ۜۛ۬ۨۜۘۦ۬ۜۧۖ۟ۤ۠ۨۖۙۛۨۘۦۜۨ۟۠ۧۗۦ۟ۜۦۙۗۢۨۨۨۖۖ۟ۘۘۖۢۖۘۚۥۘۗۖۨۖۚۤ";
                        break;
                    case -470462944:
                        stateListDrawable.addState(new int[]{-16842919}, colorDrawable);
                        str = "ۗ۟ۘۘ۠ۢۡ۟ۦۧۢۤۥۜۨۗۥۘۖ۬ۗ۠ۗ۠۫ۦۧۜۘۗۙ۟ۦۧۜ۫ۘۗۨۤۤۘ۬ۨۜۦۨۖۛۙ۠ۡۘۙۨۖۘ";
                        break;
                    case -453709037:
                        C0237h4.m1090(C0341oa.m915(new byte[]{-62, 34, 30, -61, 106, 101}, new byte[]{-78, 67, 108, -90, 4, 17}), viewGroup);
                        str = "ۨۨۨۘ۬۠ۘۘ۬ۘۜۜ۠ۤۦۢۦ۟ۜۧۤۖۨۡۤ۠ۜۢۡۘ۟ۦۜۘۢ۫ۧۥۛ۠ۚۘۡۖۘۘۡۨۤۢۜۨۘ۟ۥۤۨۜۜۘۥۙۚۘۛۧۙۖۘۧۜۡۨ۠ۥۘۙۛۢۘۨۡۧۖۢۢۖۖ";
                        break;
                    case -381642807:
                        textView = new TextView(viewGroup.getContext());
                        str = "ۤ۬ۘۘ۬ۙ۬ۡۥۨۙۜ۫۫ۥۤۦۧۤۨۛۥۘۤۚۦۘ۬ۛۘۚۗ۫ۥۦۥۤۨۥۘۥۢۗۘۢۘۘۙ۟";
                        break;
                    case -369773621:
                        stateListDrawable = new StateListDrawable();
                        str = "۟ۧۚۖ۟ۨۙۖۨۘۧۘۙ۬ۘۡۛۗۦ۫ۨ۟ۤۥۨۘ۬۠ۤۤۡۘۜۛ۠ۨۜۥۘۢ۟ۨۘۨ۫ۘۘ۟ۙۢ۟ۘۤۙۥ۬ۗ";
                        break;
                    case -134710644:
                        linearLayout.setBackground(stateListDrawable);
                        str = "ۥۖۗۡۙۚۗۛ۟ۖۜۖۡ۠ۖۘۤۨۛ۟۟ۦۘ۟۠ۧۥۘۤۘۥۘ۫ۖۥۘۚۡۨۘۚۗ۠ۧ۫ۨۘۚ۫ۘۘۡۤ۫۫ۗۢۨۙ";
                        break;
                    case -47908499:
                        colorDrawable = new ColorDrawable(-1);
                        str = "ۦۛۥۜۖۥۘۗۨۘۥۚۚۗ۠ۤۘۨۡۖۘۡۘۗۤۜۘۜ۬ۢۗ۠ۘۘ۫ۥ۟ۜۚۙ۟۟ۗۨۛۛۤۥ۟۬ۢ۫ۜۛ۟۬۬۫";
                        break;
                    case 96740565:
                        linearLayout.setLayoutParams(new LinearLayout.LayoutParams(-1, -2));
                        str = "۠۬ۦۘۖۜۖۘۦۘۖۘۨۖۛۤ۬ۨ۟ۚۜۘ۫ۛۢ۟۫ۥۘۢۛۡۨۖۢۥۚۛۧۨۨۜ۫ۜۦۥۖۚۜ۬ۦۡۖ۟ۤۗۘۦۜۗۖۢۨۢۖۗۜۡ۫ۗ۫ۗۥۨۘ۬ۗۧ";
                        break;
                    case 163959116:
                        textView.setId(this.f1766.f1763);
                        str = "ۡۢۜۘۨ۬ۗۛ۫ۡۘۘۘ۬ۢ۟ۥۥۜۧۨ۟ۦۘۢ۬ۚ۫ۦۜۘ۟ۢ۟۬۟ۛ۟ۨۘۨ۬ۛۛۘۖۜۥۛۙۨۘۨۗۤۢۨۘۛۛۜۘۖۖۧۘۙۥۨۘۨۦۖۘۖۤۢ۠ۨۘ";
                        break;
                    case 353629077:
                        textView2 = new TextView(viewGroup.getContext());
                        str = "ۙۢ۫ۚۙ۟ۤۨۘۥۜۜۦۡ۫ۢۘۨۘۥ۟۫ۥۡۧۜۜۘ۫ۗۛ۬ۢۦ۟ۦۥۗۚۜۘۦۘ۫ۢ۟ۚۚۖۛۚ۠ۗۙۦ";
                        break;
                    case 374293522:
                        textView2.setId(this.f1766.f1764);
                        str = "ۧۧ۬ۜۥۖۗۢۙ۟ۖۛ۠ۜۧۘۘۢۦۛۢۡۘۥ۬ۘۗۘۧۘۜ۟ۨۘۖ۫ۨۘۖ۟ۜۘۧۡۗۖۖ۫ۚۘ۟ۜۢۥۘ۟ۧۗۥ۬ۢۗۥۖۘۖ۠۫ۢ۫۬۫ۖۡۜۘۢۛۙۘ";
                        break;
                    case 692869505:
                        linearLayout = new LinearLayout(viewGroup.getContext());
                        str = "ۡۨۡۙۤ۠ۢۦۘۡۤۗۗۗۗ۠۟۟ۜ۟ۥۘۤۥۨۘ۫ۚۦۗۜۡۜۥۙۥۦۘ۬ۛ۫۫ۜۘۦۖۛۜۥۡۗۘۦۦۘۘ۫ۖۥۙۧۡ۠ۖۡۖۗۖۜۖۡۘۦۢۢ۟ۘۡۘۤۤۢۨ۠ۗ";
                        break;
                    case 781805213:
                        str = "ۢۧۜ۟ۗۡۛۖۙۨۙ۫۠ۤۛۥۧۧۡۗۚۘ۟ۖۨۘ۬ۛۘۢۜۧۦۘۥۘۦۗۡۡ۠ۧ۬۬ۨ۠ۛۜۙۜۙۗۙۘۨۗۘۡۦۚۡۖۧ";
                        break;
                    case 989695920:
                        textView2.setTextSize(12.0f);
                        str = "ۘۡۦۘۙۜۛ۟ۡۢۧ۬ۥۘۤۨ۫ۨۘۘۥۥۨۘۛۜۨۘۙۙۖۜۜۦۗۥۥۘ۟ۜ۠ۗ۬ۚۥۨ۫ۢۜۜۘۙ۟ۜۜۙۚ۬ۙۧ";
                        break;
                    case 1099240582:
                        textView.setTextColor(-12303292);
                        str = "ۥۖۗ۠ۡۛ۫ۚۖۘۥ۬۫ۜۢۥۘ۟ۧۗۢ۟ۦۧ۟ۛۥۧۘۡۖۧۘۗۘۗۨۡ۬ۦۥۥۤۖۛۗۨۥۘ۫ۨ۫ۢۦ۫ۡ۟";
                        break;
                    case 1166358144:
                        textView.setGravity(0);
                        str = "ۖ۟ۛۚۢۨۘ۠ۡۥۤۥ۬ۘۧ۫ۛۚۜۡ۟ۘۢ۫ۡ۠ۢۨۘ۫ۢۖ۬ۘۜۘۘۗۧۧۚۨۤۗۖۘۢۗۥۥ۟۠ۙ۟ۖۘۚۘ۟";
                        break;
                    case 1199843787:
                        colorDrawable2 = new ColorDrawable(C0407tb.m943(-1));
                        str = "ۥۤۦۘۤ۫ۘۘۢۦۨۘۛ۠۟ۦۘۥۘ۫ۜ۫ۨۥ۬ۜۜۖۥۖۘۘۦ۠ۙۢۧۦۘۢۜۦۘ۟ۦۧۘۘۧ۫ۡ۟ۦ";
                        break;
                    case 1626865664:
                        linearLayout.addView(textView2);
                        str = "ۥۨۥۛۥ۟ۡۙۢ۟۬۫۫ۡۚۤۗۨۘۢۥۧ۠ۡ۫ۙۜۨۘۘۙۥۘ۫ۛۢۗ۠ۢۗۛۦۜ۬ۡ۫۬ۘۧۤۢۗۙۨ۬ۥۖۥۘۨۙۜۧۚۥۘ۫ۦۢۢۖۙۜۘ";
                        break;
                    case 1659870310:
                        textView2.setTextColor(-7829368);
                        str = "ۦ۫ۜۘۢ۬ۙۨ۫ۛۙ۬ۖۘ۫ۥۡۘۖۗۘۗۖۥۘۗۦۥۧۜۛ۠ۤۦۘۧۤۥۘ۠ۜ۬ۜۚۧ۟ۘۡۡۡۜۘۧۦۛ۠۟ۡۤۡۖۘۡۨۖۘ۟ۥۨۘۚۦۥۖۧۛ۬ۡۗۧ۬ۘ";
                        break;
                    case 1749091930:
                        i2 = AbstractAlertDialogC0471ya.f1878;
                        str = "۫ۚۘۘۢۘۘۘۦۤۛۙ۬ۗ۟ۙۤۜۥۡۢۜۜۡۦۤۨۡۡۚۥ۠ۙۢۦۘۘۗ۟ۨۤۡۘۘۡۛ۠ۡ۠";
                        break;
                }
            }
        }
    }

    /* JADX INFO: renamed from: ۟.r4$b */
    public final class b extends RecyclerView.ViewHolder {

        /* JADX INFO: renamed from: ۥ */
        public final TextView f1059;

        /* JADX INFO: renamed from: ۥ۟ */
        public final TextView f1060;

        /* JADX WARN: 'super' call moved to the top of the method (can break code semantics) */
        public b(AlertDialogC0374r4 alertDialogC0374r4, LinearLayout linearLayout) {
            super(linearLayout);
            C0341oa.m915(new byte[]{-92, 109, 96, 1, 114, 44, -126, 101, 119, 19}, new byte[]{-44, 12, 18, 100, 28, 88});
            View viewFindViewById = linearLayout.findViewById(alertDialogC0374r4.m1217());
            C0237h4.m1089(C0341oa.m915(new byte[]{118, 28, 10, -46, 65, 85, 117, 2, 38, -49, 94, 88, 56, 91, 74, -104, 62}, new byte[]{16, 117, 100, -74, 23, 60}), viewFindViewById);
            this.f1059 = (TextView) viewFindViewById;
            View viewFindViewById2 = linearLayout.findViewById(alertDialogC0374r4.m1216());
            C0237h4.m1089(C0341oa.m915(new byte[]{-91, -30, -68, 63, 68, -17, -90, -4, -112, 34, 91, -30, -21, -91, -4, 117, 59}, new byte[]{-61, -117, -46, 91, 18, -122}), viewFindViewById2);
            this.f1060 = (TextView) viewFindViewById2;
        }
    }

    /* JADX WARN: 'super' call moved to the top of the method (can break code semantics) */
    public AlertDialogC0374r4(Activity activity, String str, List list) {
        super(activity, str);
        C0237h4.m1090(C0341oa.m915(new byte[]{-46, 47, -47}, new byte[]{-79, 87, -91, 117, 26, 43}), activity);
        C0341oa.m915(new byte[]{-73, -70, -72, -86, 22}, new byte[]{-61, -45, -52, -58, 115, -98});
        C0341oa.m915(new byte[]{-54, -88, -127, -18, -20, -128, -46, -96}, new byte[]{-90, -63, -14, -102, -88, -31});
        this.f1763 = 6;
        this.f1764 = C0133zz.f658f;
        RecyclerView recyclerView = new RecyclerView(activity);
        recyclerView.setLayoutManager(new LinearLayoutManager(activity));
        LinearLayout.LayoutParams layoutParams = new LinearLayout.LayoutParams(-1, 0);
        layoutParams.weight = 1.0f;
        recyclerView.setLayoutParams(layoutParams);
        recyclerView.addItemDecoration(new C0269j8());
        recyclerView.setAdapter(new a(this, list, null));
        this.f1765 = recyclerView;
    }

    @Override // p001.AbstractAlertDialogC0230gb
    /* JADX INFO: renamed from: ۥ۟ۥ */
    public final List<View> mo1078() {
        String str = "ۜۘۗۚۢۤۥۡۘۤۘۘۚۗۤۥ۟ۙ۟ۢۖۘۧۗۧ۫۠۟ۥۤ۫ۗۦۗۤۗۜۘ۠ۤ۠ۘ۟۫ۜۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 663) ^ 333) ^ 934) ^ 175) ^ 914) ^ 413) ^ 861) ^ 1811824640) {
                case 135390311:
                    return C0272jb.m1105(m970());
                case 1322974825:
                    str = "ۚ۟۟۫ۜ۬ۥۡۡۡۨۤۧ۬۟ۢۖۖۛۢۡۘۥ۟ۘۖۜۡۘۛۢۢۥۢۨۤ۟ۛۘۦۜۥۡۗۥۙۨۘۧ۬ۜۘۛۗۦۦۛۨۨۗۗ۬ۢۙۘ۫ۧۚۘۘۙۗۢۤۤۗ۫ۨ۟ۧۨۥۘۙۧۧ";
                    break;
            }
        }
    }

    @Override // p001.AbstractAlertDialogC0230gb
    /* JADX INFO: renamed from: ۥ۟ۦ */
    public final List<View> mo1003() {
        String str = "ۛۗۡۜۨۧۘۚۡۖۘۦۘۨۢۧ۬۫ۚ۫۠ۖۖ۫ۛۨۘۦۜۗۢۡۦۘ۟ۥۚۖ۫ۗۤۖۥ۬ۗۛۧۦۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 543) ^ 131) ^ 291) ^ 110) ^ 292) ^ 663) ^ 892) ^ 1357565159) {
                case -1231997560:
                    return C0272jb.m1105(this.f1765);
                case 628536613:
                    str = "ۧ۟ۢۚۖۘۘ۫۠ۙۛۤۘۚۡۧۦ۬ۛۥۤۚۨۖۖۢۥۢۚۧۧ۟۬۬۠ۤ۬ۨ۬ۙ۫۟ۗۨۨۦۙۤ۫ۤ۫ۜۗۨۘ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥۣ۠, reason: contains not printable characters */
    public final int m1216() {
        String str = "ۚۥۦۘ۟۟ۘۗۦۥۡۡۘۨۦۜۥۙۡۘ۬ۦۧۦۨۤۨۡۚۙۧۜۜۢۡۡۚۜ۠ۚۡۘۚۜۧۘۘۚۚۤۦۘۥۨۚۢ۫ۧ۠۫ۥۘ۟ۚۦۘۜۛۛ۫ۙۨۘ۫ۢۚۥۙۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 887) ^ 424) ^ 936) ^ 867) ^ 352) ^ 826) ^ 164) ^ (-1925001815)) {
                case -857100284:
                    return this.f1764;
                case -379012686:
                    str = "ۦ۠ۡۘۢۤۚۗۧۡۤۢۧۙ۠ۙۡۙۨۢۧ۫ۨ۫ۘۦۧۖ۠ۖۘۤۤۦۛۖۜۘۦۙۙ۫ۖۨۗۜۧۚۦۧۘۛۜۧۨ۟۫ۥ۠ۗۚۧۚۗۨ۟ۡۨۖۘۚۖۖۦۧۘۘ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۠ۤ, reason: contains not printable characters */
    public final int m1217() {
        String str = "ۙۢۤ۠۟ۜۘۗ۟ۡۚۙۜ۟۬ۗ۟ۦۧ۫ۘۦۙۥۡۘۨۥۤ۟ۜۘۤۗ۬ۨۧ۟ۡۘ۟ۨۘۤۖۡۘۡۗۚۥۧ۠ۛ۫ۛ";
        while (true) {
            switch ((((((((str.hashCode() ^ 866) ^ 491) ^ 514) ^ 243) ^ 444) ^ 488) ^ 693) ^ 992588515) {
                case -1538697939:
                    str = "۟ۧ۬ۜۘۥۡۡۘ۠۫ۢ۫۠ۘۘۜۙۚۦ۠ۜۘۖۦۥ۟ۙۖۘۢ۟۬۟ۙۦۘ۠۫۟ۚ۬ۥۘۖۘۡۘۘۨ۟ۘۤۜۘۨۙۘۚۧ";
                    break;
                case 710613969:
                    return this.f1763;
            }
        }
    }
}
