package p001;

import android.os.Handler;
import com.skyhand.redbookhelper.MainActivity;
import p001.C0235h2;

/* JADX INFO: renamed from: ۟.k5 */
/* JADX INFO: loaded from: classes.dex */
public final class C0280k5 extends AbstractC0335o4 implements InterfaceC0222g3, InterfaceC0208f3 {

    /* JADX INFO: renamed from: ۥ */
    public final MainActivity f910;

    /* JADX DEBUG: Marked for inline */
    /* JADX DEBUG: Method not inlined, still used in: [com.skyhand.hookhand.dialog.view.SwitchButton.ۥ():void, ۟.i5.run():void, ۟.k5.ۥ۟۟(java.lang.Object):java.lang.Object] */
    public /* synthetic */ C0280k5(MainActivity mainActivity) {
        this.f910 = mainActivity;
    }

    @Override // p001.InterfaceC0208f3
    /* JADX INFO: renamed from: ۥ */
    public Object mo7() {
        MainActivity mainActivity = null;
        String str = "ۘۢۢۧۤۦۥ۬ۛۛۨۘۡۧۨۤۨ۬ۥۙ۫ۚۖۢ۫۫ۡۢۖ۫ۘۖ۠۬ۘۗ۠ۜۥۛۛۙۛۜۤۖۘۡۛ۠ۨۜۤۤ۫ۢ۟۫۬ۦ۬ۦۘۘ۠ۢۨۡۘۙۙۦۘۡ۫۟ۖ۠ۜۛۘ۟";
        while (true) {
            switch ((((((((str.hashCode() ^ 33) ^ 481) ^ 800) ^ 439) ^ 201) ^ 779) ^ 135) ^ (-457364419)) {
                case -1268075078:
                    mainActivity.m5(true);
                    str = "ۦۤۜۘۡۡۜ۠ۧۚۧۛۦۧ۫ۖۖ۬ۧۥۥۘ۬۠ۗۚۧۙۡۘۤۧۡۙ۫ۦۡۜ۬ۗ۠ۨ۫ۢ";
                    break;
                case -555142711:
                    mainActivity = this.f910;
                    str = "ۨ۬۠ۡۡ۟ۦۘۥۙۘۥۦ۫ۧۧۚۦۘ۫ۥۛۧۙ۬۟ۤۜۙۗۤ۬ۡۚۙۜۘۛۘۖۘۙۜۛۗۤ۫";
                    break;
                case 348702593:
                    str = "ۤۖۜۘۘۙۜ۠۟ۥۨ۬ۘ۬ۛۗۛۖۖۜۗ۫ۤۤ۬ۥ۟ۗۘۘۖۘ۠۟ۡۙۛ۫ۡۘ۬۫۬ۥ۫ۦ";
                    break;
                case 618965249:
                    C0286kb c0286kb = MainActivity.f1289;
                    str = "۠ۥۖۘۜۚۡۗۙ۠۬ۗۖۘۡۛ۫ۚۢ۠ۦۡ۫ۨ۟ۖۗۦۜۧۗۜۢۡۡۧۚۛ۫ۜۤۢۡۡ۫ۛ۬ۢ۫ۗۙۘ۬۫ۧۘۛۧۡۘۧۚۨ۟ۘۥۨ۠ۢۙۨ۟ۧ۟ۧ";
                    break;
                case 1881967452:
                    return Boolean.TRUE;
            }
        }
    }

    @Override // p001.InterfaceC0222g3
    /* JADX INFO: renamed from: ۥ۟۟ */
    public Object mo984(Object obj) throws InterruptedException {
        String str = "ۜۨ۬ۡۖۘۘۧۢۡۘ۬۟ۜۘۚۦۡۘۡ۬۠۬ۤۨۘۢۤۡ۬ۡ۟ۚۧۧۛۧۜۘۖ۬ۜۘۥۨۙ۬۠ۚۤۙۗۧۤۢ۟ۦۢۘۧ۫ۜۥۥۧۧۜۘ۟ۨۖۘۘۧۧۥۛۘۖ۬ۘۘۘۢۖۘۜۙۡۘۥ۬ۘ";
        C0280k5 c0280k5 = null;
        C0235h2.a aVar = null;
        int i = 0;
        MainActivity mainActivity = null;
        C0336o5 c0336o5 = null;
        while (true) {
            switch ((((((((str.hashCode() ^ 212) ^ 457) ^ 540) ^ 591) ^ 83) ^ 26) ^ 653) ^ 82285164) {
                case -2069026950:
                case -1610970232:
                    str = "ۥۥۨۘۜۤۧ۫ۚۖ۬ۖۥۘۤۢۚۚۧۤ۫۟۫ۤۥۘۗۘۨۘۤۛ۫ۜۨ۠ۙۛۗۜۤۘۘ۫ۦۥۘۥۡۤ۠ۜۦ۟ۜ۬۠ۤۜۥۡۧۘۢۡۥۘ۟ۥ۬۟۬ۘۘۤۢۜۜۢۛ";
                    break;
                case -1804425223:
                    mainActivity.f1292 = 0;
                    str = "ۢۡۛۨۧۛۗ۬ۚۜ۟ۖ۟ۦۥۘۨ۫ۘۘۖۗۨۘۦۖۘۜۡۘۡۘۗۜۙ۬۬ۨۧۘ۟ۥۧ۫ۛۢ۫۬ۨۥۜ۫۠ۗ۫ۜ۠۬ۗۢۨۘۛ۠ۖۚ۠۠ۤۦۨۘۗۙۨۨۛۘۘ";
                    break;
                case -1717621888:
                    aVar.getClass();
                    str = "ۥۘ۬۬ۤ۫ۛۤۗ۫ۥۡۗۖ۫ۢۜۗۤۘۡۘۦۥۥ۫۟ۦۘۙۛۘۢۦۤۜ۠ۦۦۧۦۘ۫ۜۖۧۜۦۢۨۗۡۢۚۛ۠ۢ۟ۧۗ۟ۥۚ۫ۛۥۡۛۖۦۧۘۤ۟ۘ";
                    break;
                case -1594664575:
                    str = "ۨۦۘۚۡۛ۫ۦ۠ۤۦۨۘۗۡۥۘۨۛۛ۟ۙۜۘ۟۟ۤۖ۬ۥۖۚۙۧۘ۠۠ۦۦۢۗ۬ۘۦۦۡۚ۟ۦ۫۟ۗۥۘۘۗۚۡ";
                    i = mainActivity.f1292 + 1;
                    break;
                case -1522621661:
                    ((Handler) MainActivity.f1289.m886()).post(new RunnableC0258ib(this.f910, c0336o5, 2));
                    str = "ۥۥۨۘۜۤۧ۫ۚۖ۬ۖۥۘۤۢۚۚۧۤ۫۟۫ۤۥۘۗۘۨۘۤۛ۫ۜۨ۠ۙۛۗۜۤۘۘ۫ۦۥۘۥۡۤ۠ۜۦ۟ۜ۬۠ۤۜۥۡۧۘۢۡۥۘ۟ۥ۬۟۬ۘۘۤۢۜۜۢۛ";
                    break;
                case -1490297327:
                    c0280k5 = new C0280k5(mainActivity);
                    str = "ۚۜ۫ۘۢ۟ۖۤۖۘۨۖۜۖۚۦ۫۫ۜۘ۟ۦۘ۠ۦۘۨۦۧۧۨۧۘۡۧۛۤۡۖۧ۠۠ۖۙۗۦ۟ۘۘۨۧۚۗۢۢۦۤۛ۟ۨۙۧۨۡۘۖۘ۬ۥۜۜ۬ۢ۬ۡ۫";
                    break;
                case -1338717932:
                    str = "ۦۦۘۧۗۗۛۥۥۘ۫ۢۦۙ۠ۖۦۜۡۦۘۤۛۘ۬۟ۗۖۘۤۖۖۤ۫ۘۘۜۘ۠۟ۚۡۛۗۜۙۖۧۘ۫ۛۧۖۨ۟ۦۦ۠";
                    break;
                case -745698869:
                    String str2 = "ۖۜۖ۠۟۬ۢۗۜۡۢۗۨۡۛۡۚۢۡۡۘۜۧۤۘۤ۟ۜۢۡۥۛ۬ۛۡۡۙۛۨۘۢۢۢۘۚۡۘۢۨ۟ۘ۬ۦۛۙۥۘۨۨۖ۟۬ۦۖۡۜ";
                    while (true) {
                        switch (str2.hashCode() ^ 143321218) {
                            case -1035067207:
                                str2 = "ۢۨۖۙ۬ۖۧۙ۫ۗۖۘۚۢۘۘۦۢۚۡۛۚۘۡۛۖۘۢۡۧ۫ۛۜۗۚۗۜۖ۫۟ۛ۟ۛ۠";
                                break;
                            case -354079771:
                                str = "۟ۤۥۘۗۛۙۨۛۥۘ۟ۨۥۘ۬ۦۧۘۦۧۤۨۢ۠۬ۚ۫ۜۢ۠ۘۦۢ۫ۧۦ۠ۧۚۧۡۡۘ۫۠ۜۘۚ";
                                continue;
                            case -110394274:
                                String str3 = "ۡ۬ۖ۟۠۟ۡۡۨ۟ۢۚۛ۠ۖۘۙۜۚۧۜۡۗۤۨۘۛۨۧۛۧۢۗۨۧۦۗۙ۫۬ۦۖ۟ۦۘۦۦۚ۫ۨۨۘ۟ۙۥۘۘۙۢۡۘۨۘۤۢ۟ۛۢ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1981270519)) {
                                        case -1294645098:
                                            str3 = "۬ۗ۠ۨ۠ۥۛۦۜۡۜۦۜۗۥۘۖۘۥۡۧ۫۫ۦۧۙۤۖ۫ۖۛ۠ۚۥۘۛۥۢ۠۟۠ۦۨ۟ۥۧۡۢۦۗۨۡۦۘۖ۬ۗ۫ۖۘۘۛۡ۫ۗۖۙ";
                                            break;
                                        case -959450380:
                                            String str4 = "ۢۘۙ۬۠ۧ۫ۙۖۚۡۘۗۖۡۤۨۦ۫ۗۥۘۢ۠۠ۡۦۥۗ۬ۧۡ۟ۦۘۧۘۚۨۖۧۘۙۧۦۚ۫ۥۜ۬ۖ۫ۥۧۙ۠ۜۧۤۤۤۗۜۙۘۖۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1589503666)) {
                                                    case -1924614896:
                                                        str3 = "۬۬۫ۛۢ۠ۦۢۜۘۜ۠ۘۨۘۡۘۜۖۘۘۖۚ۫۫ۜۦۛ۠ۛۧ۫ۤ۫ۡ۫ۘۘۥۙۖۘۛۗۨۢۖ۫ۗۙۘۘۗۥۗۡۡ۫ۡۢ۫ۨۘۥۗۨۨۘ";
                                                        break;
                                                    case -1506756478:
                                                        str3 = "۟ۢۥۡۖۢۢۖۙۗۜۗۧۡۛ۫۟ۜۘۥ۬ۦۘۛۨۢۢۡ۠ۦۢۧۖ۠ۜ۬ۨۘ۟ۦۦۘۦۦ۟ۡۦۜۘۥۜۖۘۦۚ۟ۦۘۥۙۖۙۥۗۧۡۤۨۘۚۖۘۘۖ۬ۨۘ۟ۨۥۘ";
                                                        break;
                                                    case 89419515:
                                                        str4 = "ۘۦۖۜۡۜۥ۬ۨۘۧۥۡۘ۫ۥۡۘ۫ۘ۫۫۟ۥۘۜۘۖۜ۫ۙ۟ۚ۬ۡۘۘۙۨۘۙۚ۟۠۫ۗ";
                                                        break;
                                                    case 1549082391:
                                                        str4 = c0336o5 == null ? "ۖۚۛۖۛۥۘۛۗۥ۠ۧۚ۬ۨۥۘ۠۠ۘۨۧۘ۬ۤ۟ۧۖۥۘۧۙۡۤۥۛۙۙۧۜۤۧ۬ۜۘۨۛۥۘۘۜۥۘۛۧۙۜۧۢۥ۬ۙۦۥۥۡۜۦۘۧۘۗۛۨۘۘۘ۠ۤۥۚۥۘۢۢۧ۬ۘ" : "۟ۧ۟ۘ۠ۢ۠ۢۚۤۥۦۡۜۛۡۖۚۡ۬ۖۘۧۜۦ۫ۛۡۘۤۛۜۙۡۦۘۢ۠ۖۘ۬ۢۘۙۥۙۜ۠ۢۨ۫۠ۨ۠ۡۘۨۢ۬ۖۤۙۚۘۜۛۧۛ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -417688509:
                                            str2 = "ۥۧۛۖۢۗۜۢۖۘۡۚۧۛۤۖۧ۠ۘۘۗۙۜۘ۟ۢ۠ۙۥۨ۟ۡۚۚ۠ۖۘۧ۟ۤۤ۬ۖۖۜ۫۬ۥۚۡ۬ۨۜ۬۠ۦۥۘ۟ۡۘۦۡۖۗۨۨ";
                                            break;
                                        case 1845585682:
                                            str2 = "۬ۖۡۗۘۨۨ۠ۘۘۙۛۦۘۚ۫ۢۛ۟ۧ۫ۤۧ۫ۡۦۡۘۖ۠۫ۥۜۛ۫ۙۘ۟۟ۘۙۜۚۚۥۜ۟ۤۦۘۥۥۘۘۘۚۖۥۚۘۥۜۘۨۖ۠ۙۛۢ۟۫ۖۧۥۘ";
                                            break;
                                    }
                                }
                                break;
                            case 1058098034:
                                str = "ۦ۫ۜۘۨۜۨۘۚ۟ۡۘۤۚۚۥۗ۫ۗۗۡۘ۟ۤۗۢۘۘۢۖۜۧۧۦۧۜۨۘ۫ۨۤۥۘۡۘۜۨۜۨۘ";
                                continue;
                        }
                    }
                    break;
                case -594881527:
                    Thread.sleep(1000L);
                    str = "ۢ۫ۛۨۛ۫ۢ۠۬ۡۛۡۢ۟۬ۛ۠ۢ۬ۛۘۢۗ۟ۖ۠ۜ۠ۤۘ۠ۗۚۗۡۢۦۘۖ۫ۡۡۗۢۥۜۗۖۦ۫۟ۚۚۜۙۡۖۜۜۘۘۗۡۘ۫ۨۦ۬ۥ۬ۖۛۨ۬۫ۖۘۧ۫۠ۖۦۗ";
                    break;
                case 732292769:
                    str = "ۧۙۘۘ۟ۗۨۡ۠ۥۘۨ۫ۖۤۘۖۘ۠ۖۚۙ۫ۘۘۙۦ۠ۖۚۥۘ۬ۧۡ۠ۚ۠ۗ۟ۡ۠ۨۘۚۧۙۘۖۡۘۢۚ۟ۦ۫۠ۙۥۛ۟۠۟ۖۡۘۡۨۧۧۡۥۘۗۗۦۘ";
                    break;
                case 743668016:
                    return C0433vb.f1163;
                case 755523019:
                    C0235h2.a.m861(c0280k5);
                    str = "ۛ۠ۖۘۙۤۨۘۨ۫ۛۥۡ۟ۗۦۧۥۛ۠ۗ۠۟ۦۦۛۨۚۘۚۘۙۗۛۤۛ۫ۥ۫ۢۦ۠۬ۡۘۦۢۜۘ";
                    break;
                case 1025254786:
                    mainActivity.f1292 = i;
                    str = "ۥۥۘۦۙ۠ۦۚۘ۟ۖۨۖۡۘۘۘۧۦۗۧۧۤۨۙ۫ۙۡۘ۫۫۫ۙۥ۫ۙۨۖۤۤۘۘۙۤۦۘۧۥۥۘۤ۫۫۫ۘۦۘ۫ۘۡ";
                    break;
                case 1390173333:
                    str = "ۛۖۡۘۜۙۘۘ۬ۚۘ۟ۜۦۦۡۜۥۘۗ۫۟ۙۨۜۡۡۨۤۢۘۢۥۨۖۘۙۜۙۤۗۨۘۛۛۡۘۧۚۡۘ۟ۗۦۦۘ۬ۘۘۦ";
                    c0336o5 = (C0336o5) obj;
                    break;
                case 1542121220:
                    str = "ۛ۟ۡۘۡۚۚۦ۫۫ۢۜۡۘۘۘۤۡ۠ۘۘۚۙ۫۠ۥ۬ۧۦۗ۠ۤۡۘ۠ۙۥۡۤۨۡۥۘ۟ۖۦۘۨۚۧ";
                    aVar = C0235h2.f823;
                    break;
                case 1633085616:
                    str = "ۥۜۜۜۛۨۘۧۖۡۘ۬ۙ۫ۡۙۥۛۛۥ۟ۨۧۘۗۡ۠ۛۗۥۤۤ۠ۛۨ۟ۚۖۨۘۢۤۖۚۚۥۙ۟۬ۦۤۡۘ۠ۘۨ۟ۦۥۦ۠ۨۡۛۦۘۥۡ۬";
                    mainActivity = this.f910;
                    break;
                case 1987871171:
                    String str5 = "ۦۖۡۙۥۚ۠ۘ۠ۢ۫۫۟ۦۘۘۘۥۛۚۦۧۘ۬ۜۛۤۥۜۥۡۘۚۧۥۘۛۢۨۘ۫ۥۗۜ۫ۘۗ۬ۗ۟۬۫ۜ۟۬ۚ۫ۚ۫ۢۧۨۖۦۨۛۛۘۘ۬ۘ۟ۢۖ۟ۙۡۥۢۜۦۘۨۖۘ";
                    while (true) {
                        switch (str5.hashCode() ^ (-1068555719)) {
                            case -1463208854:
                                str = "ۥۚۦۘۚۗۦۘ۠۫ۘ۟ۤۖۡ۟ۖۦۥ۬ۘۧۤۤۘۘۤۤۘۨۙۘۘ۫۬ۘۘۦۗۡۜۢۦۘۧۢۤ۬ۘۜۤۥۜۘۘۗۦۖۡۙۢ۬ۜۘۘۤۖۘۛۨۙۦۘۚ۟ۦۚ۟۬ۥۨ۠ۙ۬ۚۤ۬ۚ";
                                continue;
                            case 760868991:
                                str5 = "ۜۡۦ۬ۡۗۛۘۢۨۘۛۘۛ۫ۥۨۤۧۡۛ۬ۧۨۨ۫ۡ۟ۗۖۘ۬۟ۡۘ۟ۛ۠ۡۖۦۥۦۘۨۥۥۚۜ۟ۤۤۧۖۤ۟";
                                break;
                            case 1430732130:
                                String str6 = "ۖۙۥۤۜ۫ۢۘۦۜۘۨۖۥۛۦۥۘۛۨ۫ۗۛ۟ۡۙۡۘۛۡۦ۟ۛۘۢۧ۟ۘۚۨ۬ۙ۟ۢۙۡۘۡۥۖۘۧ۬ۥۘۚۜۡۘ";
                                while (true) {
                                    switch (str6.hashCode() ^ 1510706515) {
                                        case -2105191916:
                                            str5 = "ۤۗۨۘۚ۠ۗۗۖۦۘۡۢۦۘۥۛ۬۟ۨۗۖۗۛۡۘ۠۬ۧ۟ۚۡۘۤۢۘ۟۫ۗ۬۫ۦ۬ۙۚ۠ۖۛۡۗۦۘۧۦۜ۫ۛ۠ۥ۠ۥ۫۫ۖۜۦۧۘۙۢ۠۠۟ۚ۬۫ۧ";
                                            break;
                                        case 1942034874:
                                            String str7 = "ۗ۫ۤۗ۫ۛ۬ۗ۠۫۟ۥۘۜۖۖۛۢۢۡۨۜ۟ۧۘ۟ۡۡۙۘۢۤۜۡۖۙۘۘۧۢۛ۫ۧ۟ۢۗۨ";
                                            while (true) {
                                                switch (str7.hashCode() ^ 814822656) {
                                                    case -1785372569:
                                                        str6 = "ۥۥ۟ۚۨۡۗۗۜۘۛۛۖۘۦۘۚۗۚ۫ۨ۠ۡۘۢ۟۬ۥ۠ۤۡۧ۫ۖۥۨۡۙۥۘ۫۟ۗۥۥۦۛۘۘ";
                                                        break;
                                                    case -879529653:
                                                        str6 = "ۗۜۦ۬ۦۢ۟ۢۚۙۚۨۦۚۨۘۢۨۤۦۤۘۗۥۥۘۨۡۘۦ۫ۖۘۖۜۗۖۜۧۦۖۙۢۜۙۗۨۖۘ";
                                                        break;
                                                    case -604424377:
                                                        str7 = i > 3 ? "ۡ۫ۥۚۡۢۡۦۘۘۜ۠ۥۘۜ۬ۡۘۦ۫ۜۚۦۡۛۢۖۤۛۚۢۘۜۡۘ۬ۦۖۢۦۘۖۚۡۤۢۧ۫ۡۜۖۡۗۨۨۚۘ۟ۡۨۨۨۘۚۗۢۡۦ۟ۢۚۤۙۚ۠" : "۠۟ۚۛۛۜۘۡۤ۫ۥ۟ۚۢۘۖۥ۬ۡۘۥ۫ۡۘۢۨۨۗۜۖۖۡۛ۫۫ۗۧۥۖۘۨۚ۟ۜۦۜۘ۬ۥۘۨۧ۫۟ۦۧۘۖ۫ۡۜۧۦۘۧۤۢۡۜۘ";
                                                        break;
                                                    case 1676363402:
                                                        str7 = "ۜۢۙۜۢۨ۫ۦۗۛ۟ۙۜۤۨۘ۬ۘۘ۫ۤۧ۠ۥۢۙۙۙۛ۬۫ۖۥۙۘۗ۫۠ۧۜۘ۟۬۠ۙۖۤۢۦ۫ۙۡۘۙۜۨ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 2024316045:
                                            str6 = "ۢۙ۟ۗۚۖۘۢۜۜ۬ۜۤۖ۠۟ۜ۠ۘ۫۬ۙۥۤۦۘۨ۠۟ۖۥۨۢۖۡۢۤۦۘ۫ۜۘۨ۫ۦۙۥۧۧۘۛ۫ۜۧۨ۠ۛۨۡۘۤۜۤۡۚۖ";
                                            break;
                                        case 2084930471:
                                            str5 = "۫ۦۛۡ۬ۢۛۛۢۙ۟ۨۘۙۨۧۚ۠ۨۛۥ۟۬ۧۥۛ۫ۘۘۘ۟ۖ۫ۢۦ۠ۡۖۖۧۚ۫۬ۜۘۥۘۥۨۡۨۘۜۗ۬ۤۗۜۘ۬ۥۘۜۜۖۘۢۛۘۘۚۛۚۤۥۚ۫ۤۨۜۙۜۧۗۦۨۜ";
                                            break;
                                    }
                                }
                                break;
                            case 1541757571:
                                str = "ۥۖۖۘۨۜۦۜۤۡۘ۠ۨ۠ۜۡۘۢۛۤۜۖۘۘ۬۠ۙ۬ۤۗۢۢۘۙ۠ۚۧۘۛ۬ۡۘ۫ۢۜۘ۠ۥۨۘ";
                                continue;
                        }
                    }
                    break;
            }
        }
    }
}
