package p001;

import android.R;
import android.app.Activity;
import android.os.Parcelable;
import android.widget.FrameLayout;
import de.robv.android.xposed.XC_MethodHook;

/* JADX INFO: renamed from: ۟.l7 */
/* JADX INFO: loaded from: classes.dex */
public final class C0296l7 extends AbstractC0335o4 implements InterfaceC0222g3<XC_MethodHook.MethodHookParam, C0433vb> {

    /* JADX INFO: renamed from: ۥ */
    public final C0310m7 f943;

    public C0296l7(C0310m7 c0310m7) {
        this.f943 = c0310m7;
    }

    /* JADX DEBUG: Method arguments types fixed to match base method, original types: [java.lang.Object] */
    /* JADX DEBUG: Return type fixed from 'java.lang.Object' to match base method */
    @Override // p001.InterfaceC0222g3
    /* JADX INFO: renamed from: ۥ۟۟ */
    public final C0433vb mo984(XC_MethodHook.MethodHookParam methodHookParam) {
        XC_MethodHook.MethodHookParam methodHookParam2 = null;
        Object obj = null;
        Parcelable parcelableExtra = null;
        String strM915 = null;
        boolean z = false;
        String str = null;
        String str2 = null;
        String str3 = null;
        boolean z2 = false;
        boolean z3 = false;
        Object obj2 = null;
        FrameLayout frameLayout = null;
        String str4 = "۫ۖۖۘۖۧۘۨۨۘۘۘۛۙۛ۫ۨۘۛ۟ۘۘۙۙۥۘۚ۠ۨۘ۠ۚۢ۬ۨ۬ۗۦ۫ۤۗ۠ۖ۟ۜۘۜۙ۠ۢ۠ۘۘۜ۠ۥۘۢۧ۟ۨ۬ۢۤۥۨۘۖ۠ۙۗ۠۬۫ۜۖۘۗۨۜۖ۠ۡ";
        while (true) {
            switch ((((((((str4.hashCode() ^ 294) ^ 147) ^ 413) ^ 464) ^ 841) ^ 212) ^ 956) ^ (-1946630553)) {
                case -2078183585:
                    str4 = "ۙ۬ۨۘۧۦۨۢۚۨۘۜۘۨ۫ۡۥۘۤۧۖۦۘ۠ۢۖۜۗۡ۫ۚۛۤۥ۟ۚۨۦۘۛۛۘۘۗۜۦۖۚۡۘۢ۫ۤۜۖۚۜۦۤ";
                    str = (String) C0373r3.m1204(parcelableExtra, strM915);
                    break;
                case -1842891108:
                    obj = methodHookParam2.thisObject;
                    str4 = "ۖۚۦۜۚۜۘۡۨ۟ۢۨۨ۟ۜۘۖۖۗۤۙۦۗ۟ۜۘۢۜۧۨۗۚۛ۬ۙۧۗ۟ۚۜۘۥۖۡۘۥۡ۬ۦ۫ۥۘۦۙۜۗ۫ۦۨۜۤۥۙ۟ۨۧۨۘ";
                    break;
                case -1832149617:
                    str4 = "ۡۜۖۘۢۦۧ۟ۥۘ۠ۤۨۘ۫ۚ۟۫ۙۧۜۥۘۚۥۡ۬ۘۘۘۤ۟ۗۥۘۘۤ۟ۗۧۦۧۧۤ۟ۜۦۨۘۚ۫ۥۚ۫ۥۥۤۡۘ۫۫ۧۘۙۖۙۖۤ";
                    break;
                case -1732797365:
                    C0237h4.m1088(C0341oa.m915(new byte[]{88, 118, -84, 55, 24, -113, 87, 109, -82, 52, 76, -52, 84, 102, -32, 56, 89, -97, 66, 35, -76, 52, 24, -126, 89, 109, -19, 53, 77, -128, 90, 35, -76, 34, 72, -119, 22, 98, -82, 63, 74, -125, 95, 103, -18, 58, 72, -100, 24, 66, -93, 47, 81, -102, 95, 119, -71}, new byte[]{54, 3, -64, 91, 56, -20}), obj);
                    str4 = "ۡۘۡۥۙۚۙۙۜۘۖۨۖ۟ۨۧۘۚۡ۬ۘ۠۟۫ۤۜۘۨۙۚ۫ۘۡۦۡۜۖ۬ۖۘۛۤۦۨۢۥۗۗۗ";
                    break;
                case -1590260644:
                    String str5 = "ۨۛۜۘۢۛۨۤ۫ۘۦۙۤۡ۟ۡۘۖۙۘۤۤۛۛۚۖۙۜۧۨۗۘۘۖۜۜ۠ۧۦ۫۫۫ۜ۫ۧۤۥ۠ۤ۟ۢۛۡۥۘۥۖ۠";
                    while (true) {
                        switch (str5.hashCode() ^ 2016402295) {
                            case 500092982:
                                String str6 = "ۘۚ۠ۗۙۨۘ۫ۦۥۘۥۘۖۘۤۢۜۡ۠ۡۘ۠ۡۢۙۙ۟۫ۡۚ۠ۢۖۜۙۡۦ۠ۗۘۖۙۘۜۘۦۧۘۘ۬ۤۜۘۡۨ۬ۤۙۥۘ";
                                while (true) {
                                    switch (str6.hashCode() ^ (-876699531)) {
                                        case -919463667:
                                            str6 = "ۥۤ۠ۨ۬ۙ۠ۛۧ۬ۖۤۛۥ۟ۙۘۘۦۧۨۗۨۙۜۥ۬ۢۧۙۖۘۤۡۚۤۢۛۨۦۘۧۡۖۥۗۦۖۢۡۨۘۧۤۘۘۘ۫ۜۛۖۘۘۗۜۘ۫ۨ۠ۙۜۧۘۘۤ۠";
                                            break;
                                        case -746384910:
                                            str5 = "ۦۖ۠ۨۘۘۛ۬ۨۘۦۦۥ۫۫۫ۦۧۘۚ۬ۖۦۦۙۧۖۛۢۥۧۘۡۡۚۘۤۤۥۛۘۘۧۤۦۨۖ۟ۤۦۥۘۗ۠ۦ";
                                            break;
                                        case -218864862:
                                            String str7 = "ۚۖۦۛۨۛۤۚۖۘۥۚۗۨۧۦۢۜۨۘ۬۬ۤۧ۟ۙۧ۠ۧۗۥۘۘ۟ۗۦۜ۠ۘۘۦ۠ۙۤۦۧۚ۫ۗ";
                                            while (true) {
                                                switch (str7.hashCode() ^ (-2020290858)) {
                                                    case -171972716:
                                                        str7 = str == null ? "ۙۤۢۡ۟ۧۧۥۨ۫ۙۗۘ۬ۖۘۛۦۢۦۛۖۘۢۙۛۨۚۖۘ۟ۛۘۧۘۗۗۨۧۘۦۤۙۛۤۖۘ" : "ۥۥ۬ۥۚۡۘۛۥۦۘ۠ۥۛۜ۠ۜۘۙۦۧ۠۫ۙۜۘۤ۟ۤۘۧۛۦۘۘۧۖۧۗۨۖۗ۟ۦۘ۬ۚۜۘۡۛۨۘۧۢۜۘۧۘۧۦۙۨ۟۠ۘۘۧۤۘ";
                                                        break;
                                                    case 447747758:
                                                        str6 = "ۜۤۖۨۗ۟ۛ۟ۖۛۥ۬ۖۚۘۘۢ۟۫ۥۗۤ۫ۦۦۘۜۧۥۢۧۙ۬ۧۖۘۙۙۤۤ۫ۜۛۚۜۘۡ۠ۘ۬ۗۤۥۙۗۚۨ";
                                                        break;
                                                    case 1445460031:
                                                        str7 = "ۚۧۦۘۘۥۨۘۚۨۛ۟ۜۥ۬ۡۛۜۚۨۘۛۦ۠ۡۡۥ۟ۢۘۜ۬ۤۘۜۡۘۢۙۚ۟ۘ۟۟ۖۡ۫ۢۦۘۥ۫۫ۡ۠ۘۘۙ۬ۧ";
                                                        break;
                                                    case 1758488687:
                                                        str6 = "ۧۥۛ۟ۦۙۡۡۧۙ۟۬ۗۚ۠ۨ۟ۦۦۜۘۙۨ۫۬ۦۤ۬۬ۛ۠ۙۜۘ۫۬۬ۨۡ۠ۨۖۦۘۖۘ۟ۡۛۥۘۥۚ۠ۚۡ۠۠ۖۥۘۥۚۜۘۚ۫ۦۘۗ۬ۥۘۤۥۨۘ۬۠ۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1024922019:
                                            str5 = "۫ۨۧۘ۬۟ۨ۬ۨۧ۫ۢۘۨۤۦۗ۬ۦۘۦۥۥۙۚ۬ۖۢ۠ۘۙۧ۟ۡۘۧۖ۬ۙۦۖۤۤۤۧ۠ۦۘۧۤۤۢ۠ۛۦۘۛۜۙۘ۟ۦ";
                                            break;
                                    }
                                }
                                break;
                            case 604584859:
                                str4 = "ۘۨ۬ۧۗۨۘ۟۟ۦۘۘۖۜۘۖۨۘۘۜۢۜۢۛۢۘۦۢۛۜۘۜۨۢ۬۬ۦۘ۟ۨۨۘۨۨۦۥۢۛۜۙۡۘ۫ۘۛۨۢۡۘۡۘۛۨۥۖۘۖۚۧۙۤۢ";
                                continue;
                            case 875223598:
                                str4 = "ۘۦۜۘ۬ۛۙۤ۟ۜۘۧۨۢۥۡ۠۠ۜۜۗ۠ۙۛۚۡۧ۬ۥۘۛ۬۫۟ۙ۠ۛۜۧۖۗۖۘ۫ۡۗۖ۠ۘ۠ۡۘۜ۠ۜۘۜۘۘۘ۟ۙۜۜ۟ۗۗۜ۬ۧۛۡۘۜۗۗ۫ۛۘۘۨۤۙۛۚۨۘ۠ۛ";
                                continue;
                            case 1022466608:
                                str5 = "ۚ۠۬ۨ۫ۡ۫ۘۢ۫ۚۙۛ۠ۜۧۡۘۘۚۧۘۘۖۛ۟ۦ۠ۦۛۢ۫ۘ۬ۙۦ۫ۘۘۙ۬ۛۜۥ۟۠ۗۘۘۢۖ۬ۥۨۡۙ۬ۘۙۦۨۘۡ۬ۤۥۥ۠ۙۖۘۘۥ۬ۙۜۛ۫";
                                break;
                        }
                    }
                    break;
                case -681909466:
                    str4 = "۠۫ۡۘۙۦۦ۫ۘۛۢۖۢۤۜۜۦ۫ۥۛ۠ۚۦۡۙۡۙۙ۟ۧۡۚۖۙۧ۫ۖۥ۠۫ۤ۬ۧ۟ۚ";
                    methodHookParam2 = methodHookParam;
                    break;
                case -279845216:
                    String str8 = "ۥ۬۬ۡ۫۠ۤۦۦۜ۫ۙۙۗۜۘ۠ۜۖۘ۫ۤۜۖ۬ۥۘۢۖ۬۫ۜۥۘۥۦۗۡ۟ۥۗۘۜ۟ۖۘ۬ۥ۟ۖۜۘۘ۬ۦۦۘۡ۟ۤ۬ۡۜۘ۟ۦ۫ۥۙۨ";
                    while (true) {
                        switch (str8.hashCode() ^ 175558771) {
                            case -1298783850:
                                String str9 = "۟ۡۨۧۚۖۢۤۢ۠ۦۙۤ۫۫۬ۖۘۤۢۥۘۛۦۜۤ۟ۙۨۖۘۘۛۘۦۥۖۚۖۦۖۦۨ۬۬ۧۜۘۥ۠ۦۡ۫ۛ۠ۖۡ";
                                while (true) {
                                    switch (str9.hashCode() ^ (-1833337599)) {
                                        case -2017442895:
                                            str8 = "ۜۤۦۘۙۖۘۘ۫ۛۖۘۤۡۜۘۡۛۖۘۙۡۘۡۜۘۘۦۖ۟ۙۖۢ۫ۙۛۗۤۙۡۜۗۢۖ۠ۤۧۨۘ";
                                            break;
                                        case -546130541:
                                            str9 = "۫ۖۙۚۘۗۚۚۙۚ۟۫۫ۖ۫ۦۛۤۙۥ۫ۨۘۦۦۜۜۡۛۦۨۧۘۚۜۡۘۜۦ۬ۨ۠ۚۤۖۨۘ";
                                            break;
                                        case 1320148067:
                                            str8 = "ۚۘۛۢۜۡۘۥۛۛۦۥۜۗۨ۬ۗۗۜۘۦۡۛۥۗۗۤۛۥۘۦۤۘۦۥ۬ۘۥ۠ۧ۟ۙۦۨۘۦ۫۠ۖۛۖۖۧۛۨۖۜۜۙ۫۠ۘ۫ۜ۠ۦۜۖۘ۟ۤ۟ۤۥۦۘ";
                                            break;
                                        case 1852831461:
                                            String str10 = "۬۫ۙۖۙۘۘۡۧ۟ۢ۫۠ۙۤۜۘ۟ۙۚۨۢۨ۫ۤۘۛ۠ۨۘۖۛۜۘۗۢۘۥ۬۠۫ۤ۟۬ۘۗ۟ۡۘ۟ۘۗ۟ۦ۫ۢۤ۟ۥ۬ۛ۠ۡۖۖ۟۬";
                                            while (true) {
                                                switch (str10.hashCode() ^ 1019246323) {
                                                    case -2101915546:
                                                        str10 = "ۢۘۢۙۦۜۘۛۖۜۘۧۨ۫ۡ۬ۘ۬ۦۜۤۥۜۘۙۘۛۡۡۤۚۥۜۙۖۚۙۧۖۘ۠ۤۘۛۖۢۦۧۘۨۥۥۘۧۜۘۘۛ۠ۨۘۚ۠۫ۚۚۢۤۚ۬";
                                                        break;
                                                    case -1965637000:
                                                        str10 = z3 ? "ۦ۟ۧۘۘۘۙۡ۫ۗۗۗۤ۠۬۫ۤۚۧۧ۫ۢۜۘۨۥۡۘۢۦۘۘۢۨۡۘ۟ۗۦۘۛۥۨۢ۟ۘۘ۟ۜۨۘۚۘۡ۟۫ۘۘۚ۫ۥۗۨۨۢ۫ۜۘ۬۫ۨۘۜ۟۟ۙ۟ۨۜۡۘۚۚۥۖۥ۬ۤۡۘ" : "ۨ۬ۖۘۜۚ۟ۗ۫۟ۥۚۤۧۙۗ۬ۛۜۘۦۧۦۤۖ۠ۨۢۨ۫ۧۤ۬۬ۗ۠ۖۚۛۖۧۘ۟ۤۦۘۥۦۥۘۥۚۘ۫ۨۜۡۢ۠ۤۜۚۧ۠۬ۢۘۤۛ۟۫ۦۘۢ۠ۙۜ۬ۙۜۘ۫ۙۨۨ۠ۦ";
                                                        break;
                                                    case -1955159146:
                                                        str9 = "ۗ۬ۖۘۥۜۢۦۘ۫ۤۦۘۘۢ۬۫ۗۙۗۘۡۧۛۛۗۤۢۡۘۚۜۘۖۧۖۦۗ۟۠ۨۦۤۜۘۛۗۖ";
                                                        break;
                                                    case -195282244:
                                                        str9 = "ۘۦ۠ۗۚۨۘۛۘۥۘۦۨۡ۫ۗۘ۟ۙۢۡ۫ۘۤۚۛ۠ۙۚۥۘ۬ۡۨۤۙۘۨ۠۫ۥۦ۟ۥۘۘۢ۬ۢۖ۠۟ۛۖۘۡۦۘۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case -401046477:
                                str4 = "ۧۘ۟ۡ۬ۡۘۢۨۡۨ۠۫۠ۤۘ۬ۛۡۖۤ۬ۗۡۥۡۡۥۘۙ۠ۖۘۧۜۘۘۢ۟ۥۙۧۡۘ۟ۧ۠ۥ۟۠";
                                continue;
                            case 1358359118:
                                str4 = "ۜۨۦۗۙ۠۟ۜ۬۠ۛۨۘۖۙ۬۟ۙۛۖۥۘ۬ۦۢۛۨۜۘۧۦۥۚۙۢۡۚۦۡۖۗ۫۠ۜۘۤ۫ۨ۬۠ۥۤۗ۫ۙ۫ۖ";
                                continue;
                            case 1411182262:
                                str8 = "۟ۥ۫ۜۖۧۘۖ۬ۜۜۜۖۘۧۨۖۜ۫۠ۘۥۘۗۜۘۛ۠۟ۗ۠ۦۘ۟ۛۖۡۧۤۖۤۘۚ۟ۢۧۧۨۘۗۙ۫ۢۥۘۘۚۦۘ";
                                break;
                        }
                    }
                    break;
                case -119844702:
                    z2 = true;
                    str4 = "ۛۘۢۙۡۦۧۘۘ۬ۚۨۘۡۖۨۧۙۦ۫ۖ۠ۦۥۢۜۦۜۦۤۤۤۚۗ۫ۘۥ۬ۦۘۧۘۜۘۢۡۧۥۘۦۘ۬ۦۧۤ۫ۧۨۡ۫ۤ۫ۚۜۗ۬";
                    break;
                case 52264811:
                    str2 = "";
                    str4 = "ۛۢۥۘۦۛۖۘۡ۠ۧۡۦۖۘۥۥۚۦۗۜۘ۫ۧۛۦ۠ۡۚۗۨۘۗ۫ۘۘۚۘۗۨۧۧۖۘۧۚۦۖۡۜۘۢ۬ۤۜۡۛۥۤۥۘ۟ۘۦۥۛۚۛ۬ۦۘ۫۠ۖۘۘۖۨۤۜۘۘ";
                    break;
                case 103928386:
                    C0237h4.m1088(C0341oa.m915(new byte[]{-71, 60, -19, -80, -108, -31, -74, 39, -17, -77, -64, -94, -75, 44, -95, -65, -43, -15, -93, 105, -11, -77, -108, -20, -72, 39, -84, -78, -63, -18, -69, 105, -11, -91, -60, -25, -9, 40, -17, -72, -58, -19, -66, 45, -81, -67, -60, -14, -7, 8, -30, -88, -35, -12, -66, 61, -8}, new byte[]{-41, 73, -127, -36, -76, -126}), obj2);
                    str4 = "ۖۚ۫ۙۢۥۘۡۙۦۡۢ۬ۦۦۘۡ۫ۧۛ۠ۘۤ۠ۡۜ۬ۖۘۤۦ۟ۧۧۢ۠ۥۖۘۜۗۘۡۥ۬۟ۖ۠ۥۜۦۘۥۥۥ۟ۨۘۘۡۡۙۤۗۛۡۦۗ";
                    break;
                case 255374669:
                    C0237h4.m1090(C0341oa.m915(new byte[]{-92, -97}, new byte[]{-51, -21, 95, 24, 126, 80}), methodHookParam2);
                    str4 = "ۜۥۙۚۡۢۚۘۛۘۛۧۨۢۤۚۥۜۛۥۧۚۥۘۛۤۥۦۛۥۗۧۘۘ۠۬ۙ۫ۤ۫ۧ۠ۤۨۘۗۥ۠ۤۡۥۘۦۘۦۚۙۥۘۤ۟ۙۢۡۢۚۗۗۤۛۧۢ۬ۨۘ";
                    break;
                case 356485906:
                    str4 = "ۘۦۜۘ۬ۛۙۤ۟ۜۘۧۨۢۥۡ۠۠ۜۜۗ۠ۙۛۚۡۧ۬ۥۘۛ۬۫۟ۙ۠ۛۜۧۖۗۖۘ۫ۡۗۖ۠ۘ۠ۡۘۜ۠ۜۘۜۘۘۘ۟ۙۜۜ۟ۗۗۜ۬ۧۛۡۘۜۗۗ۫ۛۘۘۨۤۙۛۚۨۘ۠ۛ";
                    str3 = str2;
                    break;
                case 470227331:
                    z = false;
                    str4 = "ۨ۠۠ۦ۟۠ۦۚۖۥۥۥۘۧ۠ۚ۬۟۠ۤۦۜۘ۠ۦۘۧۦ۟ۦۗۚۨۛۘۘ۫۫۬ۡۥۧۘ۠۬ۧۥۤۨ";
                    break;
                case 481501248:
                    return C0433vb.f1163;
                case 545272796:
                    str4 = "۬ۤۨۦۙۧۦۙۛۤ۬ۖۛۥۖۘ۠ۗۨۘۧۘ۫ۘۧۖۘۧۢۜۤۧۨۖۦۘۚ۫ۨ۬ۤۡۤۧۦۘۚۗۖ";
                    z3 = z;
                    break;
                case 591669721:
                    str4 = "ۧۨۢۨۤ۬ۡ۬ۙ۟ۙۖۡۛۦۘۚۜۜۙۜۧۘۥ۠ۥۘۡۦ۫ۙ۠۟ۡ۟ۖۥ۬۫ۤ۠۬ۨۘۗۛۗۦۨۤۛۥ۟ۛۛۨۢۧۧۧۨۛ۬ۤۦۘۧۗۨۘۢۤۖۘۥ۟ۧ";
                    frameLayout = (FrameLayout) ((Activity) obj2).findViewById(R.id.content);
                    break;
                case 658066724:
                    String str11 = "ۙۚ۟ۡۗۚۡۙۢۗۜ۠ۨ۬ۚۡۡۗ۠ۥ۟ۛۨۨۘۤۦۚۗۖۨۘ۠ۢۡۘ۫۬ۗ۟ۗۦۗۚ۬۫ۦ";
                    while (true) {
                        switch (str11.hashCode() ^ (-856416269)) {
                            case -157240004:
                                str11 = "ۛ۬ۖ۟۠ۨ۬ۚۨۘ۬ۡۙۥۤۢۗۜۨۘۚۧۥۘۚ۠ۚۧۦۥ۬ۧۙۥۖ۠ۙۢ۬ۚۗ۫ۙ۫۠ۡۚۦۥۤۤ۟ۛۦۘۜ۟ۥ۠ۜ۫ۥۖۨۢۜۘ۟ۡۜۘۜۜۚۡ۠ۥۧ۟ۜۘ۬۫ۘۘ";
                                break;
                            case 298736632:
                                String str12 = "۠۫ۢ۟۬۠ۘۦۢۜۦۘۗۘۘۘۗۢۜۖۥۘ۠ۗۥۘۙۜۘۡ۠ۜۡۤۘۘۘۜۜۛۙۤۛۛۨۘۚۘ";
                                while (true) {
                                    switch (str12.hashCode() ^ 1486021059) {
                                        case -523085321:
                                            str11 = "ۡۜۜ۟۬ۘۘۦۜۜ۠ۤۚۙۧۘۘ۟ۨۖۘۗۦۘ۠ۧ۬۫ۦۜۘۧۖۨۛ۠ۦۘۛۡۡۘۘۥۙ۠ۜۘ۠ۗۙ۬۠ۙ۟ۧۥۜ۟ۥۘ۠ۙۤۤۜۘ۬ۛ۬ۤۜ۠ۗۡۢۧۘۛ۬۟ۥۘۖۤ۫ۘۙۘ";
                                            break;
                                        case 1458063136:
                                            str12 = "۠ۧۜۘۦۚۧ۫ۡۗ۬۬۬ۤۤۧۚۜۖۘ۬ۖۗ۠ۙۡۘۧ۫ۨۖۗۦۙۘ۠ۨ۟ۚۛۜۤ۬ۦۘۨۙۥ۫ۨۖۘۛۥ۠ۙۦۛۤ۬۠ۙ۬ۘۡۜۡۘ۬ۡۚۚۙۡۢۚۨ";
                                            break;
                                        case 1860988771:
                                            String str13 = "۠ۢۥۘ۠ۘۜۨۜۡۘۜۗۥۥۛۚۜ۬ۗۙ۟ۨۘ۬ۙۧۘۧۖۘۛ۬ۥۗ۬ۜۘ۫ۦۢۦۛۚۙۛۚۜۥ۟۠ۧ۠ۥ۟ۤۗۙۡ";
                                            while (true) {
                                                switch (str13.hashCode() ^ (-451970183)) {
                                                    case -1879546154:
                                                        str13 = parcelableExtra == null ? "ۖۖۜۙۙۡۘ۫ۚۡۨۘۛۦ۬ۙ۫ۡ۫ۢ۬ۧۜۘۢۖۦۘۧۢۡۘۜۗۧۦۨۡۢۚۘۚ۫ۨۡۡ۫۫ۢ۫ۨۘۙۙۙ۫ۥۙ۠ۧۡۥۘۛۡۦۘۙۡۜۨۙۘۘۘۡۘ۟۫ۘۖ۫ۥۘ۫۫ۘۘ" : "ۤۛۨۘ۬ۡۘۜۧۥۙۖۜۙۥۘ۬ۨۜۙۛ۬ۛۨۜۘ۠۬ۢۧۜۧۘۘۢۜۥۛۚۡۖۖۘۤۘۧۘۢۘ۬ۗۗۙ۫ۨ۬۟ۥۗۤۤۜۖۚ۟ۘ۫ۥۘۥۘۗ۫ۛۥۘۖۘۘۥۥۡۛۧۢ۠ۗ";
                                                        break;
                                                    case -1837233368:
                                                        str13 = "ۜۜ۫ۨۢ۫ۥۦۘۨۤۖۘۧ۟ۗ۬۠ۦۜۖ۫۬ۖۦۦۘۜۘۥ۟ۜۘۢۚۖۘۜ۠ۚ۫ۢۘۘ۬ۡۦۧۖ۠ۛۙۛۨۛۧۦۧۡۜۦۨۚۙۥۡۥۢۜ۠ۦۛۗۥ۟۫ۢ";
                                                        break;
                                                    case -1454087192:
                                                        str12 = "ۡ۟ۢۤ۠ۥۘۛۙۥۨۤۡۙۗۦۜۨۖۘۨۚۦۘ۟۟ۥۚۛۧۥۤۛۧۥۗۙ۫ۘۤۘ۟ۨۨ۫ۛۦ۫";
                                                        break;
                                                    case 205267737:
                                                        str12 = "ۦۨۦۡۚۧۨۧۘۘۡۙ۠ۤ۬ۨۧۧۖۘۚۧۖۘۤۗۥۖ۠ۖۨۜۦۚۘۜۘۙۖۧۧۗۦۘۥۢۥۖۙۨۘ۟ۡ۟ۦ۬ۘۗۛۧۛۘ۠۬ۘ۫ۦ۬۫ۤ۬ۨۢۙۡۘ۬۬ۘۘۘۦۢ۠ۗ۠ۢۢۜ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 2072170018:
                                            str11 = "ۜۙۙۛۙۨۘۨۡۧۘۙۦۦۘۙۦۖۦۢۦ۠۠ۘۙۘۦۢۥۚۗ۠ۥۘۧ۠ۗۘۢۘۘ۠ۢۖۧۘۗۦۖۡ۠ۘۛۙۖۧۨۚۛ";
                                            break;
                                    }
                                }
                                break;
                            case 1153370992:
                                str4 = "ۖۙۜۢ۟۫ۡۧۜۘۨۡۤ۠ۗۖۨۦۡۙۘۦۡۤۦۘۥۨۡۖۦۧۙۦۜۘۗۖۧۘۤ۟ۜۘۧ۟۟ۡۚۛۡۡۨۘ۠ۧۤۡ۫ۙۘ۬ۧۡۖۘ۟ۚۜۘۧۨۡۢۥۢۦۗۦۘ";
                                continue;
                            case 1781520840:
                                str4 = "ۗ۟ۧۦ۟ۤۜۨۧۘۢۥۦۘۦۢۡۚ۬ۤۖۗ۠۠۬ۗۛۛۖ۟ۤۧۜ۬۠ۡۦۘ۟ۨۦۨۜۘۘ۠ۜۜۤۧۛ۫ۥۗۤۧ۫ۡۚۚۙۥۗ۟ۨۨۢۥۜۘ۟۟ۚۦۨ۟ۚۢۨۘۧۖۗۙۗۨۘ";
                                continue;
                        }
                    }
                    break;
                case 807104523:
                    obj2 = methodHookParam2.thisObject;
                    str4 = "۬۠ۘۖۦۥۨۙۡۘۜۨۦۘۚۨ۠ۛ۟ۨۥۧ۫ۦۧۛۨۡۤۖۚ۬ۦۧۘۥۖۦۘۚۦۡۦۦ۫۠ۘۚۧۡۨۡ۬۬ۧ۠ۧۛ۫ۥۙۙۛۚۦۖۘ۟ۛۨۦۖ۟۠ۚۥۙۛۡۨۧۥۢۡۤ";
                    break;
                case 909558501:
                    str4 = "۫ۢ۫ۖۙۥۘۡۙ۫ۢۖۨۘۦۗ۠ۘۢۚۘۜۗۡۖۦۗۘۖۘۚۖۤۗۛۢۦۜۚۙۚۚۙۤۚ۬۬۫ۗۖۖ۫ۘۥۚۛۖۗۦۖۧۧۜۜ۟ۘ";
                    str3 = str;
                    break;
                case 1007560281:
                case 1557460653:
                    str4 = "۫۠ۤۨۡۦۘۦۤ۬ۡۘۥ۠ۤۥۤۗۡۘ۠ۖۘ۬ۘۢۚۛۨۘ۠ۙۖۧۗۢ۬ۡۜۘۦۜۘۖۜ۬ۘۨۥۘۨۙۨۦۡۡ۫ۜۢ۫ۡۗۙۛ۟۟ۢ";
                    break;
                case 1399245206:
                    parcelableExtra = ((Activity) obj).getIntent().getParcelableExtra(C0341oa.m915(new byte[]{77, -45, -56, -79, 66, 115, 102, -36, -64, -80}, new byte[]{47, -78, -90, -33, 39, 1}));
                    str4 = "۬۬ۘۘۜۡۢۖۤ۫ۧ۬ۢۙۖۘ۟۬ۨۘۛۘۢۥۡ۫۫ۘۘۘۡۢۜۡ۠۠ۥ۫ۥۘۜۛۨۘ۠۫۫ۢۚۖۘ";
                    break;
                case 1648869256:
                    frameLayout.post(new RunnableC0240h7(frameLayout, this.f943, str3, 1));
                    str4 = "۫۠ۤۨۡۦۘۦۤ۬ۡۘۥ۠ۤۥۤۗۡۘ۠ۖۘ۬ۘۢۚۛۨۘ۠ۙۖۧۗۢ۬ۡۜۘۦۜۘۖۜ۬ۘۨۥۘۨۙۨۦۡۡ۫ۜۢ۫ۡۗۙۛ۟۟ۢ";
                    break;
                case 1674939435:
                    str4 = "۟۟ۛۧۚۚ۫ۢۜۘۨۜ۟۫ۙۖۖ۬ۜۘۡ۠ۡۜۙۜۚۤۥۦۤۥۘۧۗۚۤ۠۟ۙۖۖۘۢۗ۟ۙ۫ۡ";
                    z3 = z2;
                    break;
                case 1958358914:
                    String str14 = "ۙۧۘۥۥۘۦ۬ۦۘ۟۫ۡۖۥۙ۬ۙۥۖۘ۟ۗۘۘۜۘۨۙۘۛۥۨۙۨۤۙۖۜۘۡۡۡۘۚۧۗ۟ۤۤ۠ۖۦۘۛۗۥ۠ۗ۟۟ۘ۬ۤۙۧۛۨۛۨۙ۫ۤۢ";
                    while (true) {
                        switch (str14.hashCode() ^ (-474962022)) {
                            case -1241844934:
                                String str15 = "ۘۡۦۢۢۖۥۖۜ۫۟۟۬ۛۖ۫ۗۡۚۜۤۙۥۦۘۦۖۡ۬ۧۖۛۥ۠ۖۚۛۦۚۜۦۦ۠۫ۜ۠ۖۙۙ۟ۧۥ۠ۖۘۘۚۚۨۘۡۜۜۦۚۡۘ";
                                while (true) {
                                    switch (str15.hashCode() ^ (-1770536493)) {
                                        case -1697381190:
                                            str15 = "۬ۦۘۡۙۖۖۥۤ۠ۖۚۖۧۨ۟ۜۖۘۧ۟ۧ۠ۘۧۘ۬۟ۨۢۨۜۘۧۤۥۨ۟ۦۘ۬ۥۡۚۗۨۘۧۡۦۘ";
                                            break;
                                        case 149595205:
                                            str14 = "ۤۜۘ۠ۡۖۚۚۚۜۦۜۡۧۥۘ۟۫۫ۛ۠ۥۘۘۥۗۥ۬ۘۘۛۙۘۘۗ۟۫۟ۡۦۘۥۙۗ۠۫۠ۙۡۥ۟ۘۡۘۜ۠۠ۖۚۘ۟ۗۢۥ۟ۧۡۙۗۢۡۨ۫ۛۖۘۦ۟ۡ";
                                            break;
                                        case 822555673:
                                            str14 = "ۗۘ۠ۘۗۗۖۜۨ۠۬ۚۘۚۜۗ۟ۥۤۗۛۡۥۦۛۚۦۙۜۜ۠ۜۥ۠ۤۖۘۧۡۖۘۗۨۙۘۘۘۙۖۛ۫ۜۨ۠۟۫ۢۧ۠ۖۖۥۦۘۛۦ۟ۗۘۖ۫۫ۦۜۘ۬ۘۦۤۙۦۘۙۨ";
                                            break;
                                        case 2118816927:
                                            String str16 = "ۛۧ۫ۗ۫ۦۘۦ۫ۥۘۘۙۡۘ۟ۤۘۛ۬ۘۘۗۛ۟ۡ۠۟ۛ۫ۛۜۧۦۚۥۨۘۨ۬ۖۖۙۗۡۥۗۥۘۡۙۘۘۘ۬ۨ۠ۨ۫۬۬۫ۘ۠۬ۙۘۘ";
                                            while (true) {
                                                switch (str16.hashCode() ^ 525972655) {
                                                    case -1764745843:
                                                        str15 = "ۚ۬ۖ۟ۤۥۘۨۖۨۚۜۙۚۡۖۘ۠ۛۥۧۚۦۘۙۙۘۤۘۜۘۙ۬ۚۢۧ۟ۖۧۡۘۜ۫۫ۡۜ۟۠ۙۧۨۤۚ۟ۙۛۦۘۚۗۖۘۘ۫ۖ۠۫ۡۖۖۘۗۦۖ۠ۤ";
                                                        break;
                                                    case -1011222950:
                                                        str15 = "ۨۨۡۘۢۚۧ۟ۜۜۜۘۘۡۘۗ۠ۘۨ۠ۗۧۡ۬ۦ۬ۥۤۛۡۗۚۖۧۚۤۛۚۥۘ۬ۨۜۘۜۢۥۙۚۚ۟ۧۥۙۡۥۘۦۛۥۘۖۥۢۦۘ۟ۙ۠ۖۛۜۤ۠ۧۛ";
                                                        break;
                                                    case 2127346858:
                                                        str16 = "ۦۜۜۧ۟ۤۡۖۦۙ۫ۡۥۥۢ۟ۥۙۖۥۘۛۥ۠ۤۢۚۙۥۘۘ۫ۨۦۘ۬۟ۥۘۤۨۖۦۤۦۢۗۜۖۤۧۗۜۤۧ۫ۘۘۨۙۖۘۢۨۖ۟ۤۙ۬ۦۘۜۨۜۘ۠ۛ۟";
                                                        break;
                                                    case 2145042651:
                                                        str16 = str3.length() == 0 ? "ۨۜ۫ۢ۫ۜۖۙۘۖۙۦۨۛۥۜۜۛ۬ۢۡۘۜۥۡۡۛۘۘ۬ۨۡۘۨۡۥۘۘۥۘۙۜۚ۠ۛۜۗۦۘ" : "ۡۥۥۘۛۦۘ۠ۦۨ۟ۥ۬ۘۘۗۖۘۛ۫ۡ۟ۙۗ۬۬ۗ۬۠ۘۗ۬ۗۙۘۢۖۘۗۨ۫ۢ۠ۤۡۢ۬ۢۨۥۘ۠ۡۚۢۚۖ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case -322904011:
                                str14 = "۫ۚۖ۟ۥۥۘۡۛۡۘۤۧۦۘۜۡۨۥۢ۬ۜۥۦۘ۫ۡ۠ۤ۬ۖۘۨۜۖۤۛۢۚ۟۠ۛۗۡۙۢۦۘۖ۫ۜۧۖۜۘۘۡ۠ۥۘۨۗۡۘ۬ۢۨ۬ۨۦۦۨۧۘۗۧ۫ۡۧۤ";
                                break;
                            case -315763205:
                                str4 = "۠ۜۧۘۛۥۨۦۧۨۜۢۥۨ۠ۥۘۜۤۧۜۤۖۘۧۨۦۛۢۜۘ۫ۢۦۘۚۘۡ۬ۗۧۙۜۖۘ۠ۚۧۤۙۢ۬ۡۡۘۘۘۦۥۡ";
                                continue;
                            case 2142101805:
                                str4 = "۟۟ۛۧۚۚ۫ۢۜۘۨۜ۟۫ۙۖۖ۬ۜۘۡ۠ۡۜۙۜۚۤۥۦۤۥۘۧۗۚۤ۠۟ۙۖۖۘۢۗ۟ۙ۫ۡ";
                                continue;
                        }
                    }
                    break;
                case 2069802151:
                    str4 = "۬ۚ۫۬ۙۖۘۜۢۖۜۗۦۘۙۡۡۘ۫ۗۨۘ۬۟ۨۤۚۥۖ۬ۛۡۛۢ۠ۨۤۧۦۘۙۗۥۚۜ۬۠ۚۛۙۡۨۘ۫ۦۘۘ۫۫ۥۗۚۙۘۨۦۘۧۚۥۘۢ۠ۖۘ۟۟۠ۘۢۗ";
                    break;
                case 2106275467:
                    strM915 = C0341oa.m915(new byte[]{-32, 86, 94, -8, -34}, new byte[]{-119, 59, 63, -97, -69, -10});
                    str4 = "۠۬ۗۧ۫ۘۘۚ۟ۧۡۥ۠ۧۛۧۢۖ۟ۥۛ۟ۡۗۜۘۘۧ۟۠ۡۛۢۦۜۘۖ۬ۖۘۤۢۡۘۙۖۗۛ۬ۦ۠ۚۖۙ۟ۦۖۡۘ";
                    break;
            }
        }
    }
}
