package p001;

/* JADX INFO: renamed from: ۟.m4 */
/* JADX INFO: loaded from: classes.dex */
public final class C0307m4 extends C0293l4 {

    /* JADX INFO: renamed from: ۟.m4$a */
    public static final class a {

        /* JADX INFO: renamed from: ۥ */
        public static final Integer f960;

        /* JADX WARN: Removed duplicated region for block: B:117:0x002f A[SYNTHETIC] */
        /* JADX WARN: Removed duplicated region for block: B:118:0x0073 A[SYNTHETIC] */
        /* JADX WARN: Removed duplicated region for block: B:119:0x00a6 A[SYNTHETIC] */
        /* JADX WARN: Removed duplicated region for block: B:120:0x00aa A[SYNTHETIC] */
        /* JADX WARN: Removed duplicated region for block: B:124:0x0026 A[SYNTHETIC] */
        static {
            Integer num;
            boolean z;
            Integer num2 = null;
            try {
                Object obj = Class.forName("android.os.Build$VERSION").getField("SDK_INT").get(null);
                String str = "۫ۧۘۘۜۜ۬ۤۥۧۙۛۙۦۨۨۢۗۘ۟ۧۛ۠ۘۡۧۖۗۘۤۜۘۙۥ۟ۨ۬ۘۘ۠۫ۚۛۖ۠۠ۦۖۘ";
                while (true) {
                    switch (str.hashCode() ^ (-2142663772)) {
                        case -2091139746:
                            num = (Integer) obj;
                            break;
                        case -593219411:
                            break;
                        case 23876093:
                            String str2 = "ۨۙۢۖۖۜۘۤۙۨۙۘۜۡۡۘۛۥۘۨۨۥۖ۟ۡۘ۬ۛۡ۬ۤ۟ۧۗۥۗ۠۠ۤۘۦۘۜۡۛۜ۟ۘۘۦ۬ۨۘۥۖۖۙۖ۬ۙۚۨۥۖۙ۠ۦۖۘۧۥۨۦ۬ۜۘۨۡ۫";
                            while (true) {
                                switch (str2.hashCode() ^ 1631884456) {
                                    case -1593710355:
                                        str2 = "ۙۗۤۤ۟ۦ۠۠ۥۘ۟ۢۘۘۛۖ۫ۤ۠ۢۛۚۧۘۙۧۗ۟ۘۤۘ۬ۧ۠ۚۚۘۘۘ۠ۦۨۙۨۥۘۤ۟ۖۘ۟۫ۨۘۡ۠ۛۤۘۜۢ۠ۜۘۨ۫ۙ۬ۙۖۢ۟ۛۤ۟ۛۢ";
                                        break;
                                    case -216049797:
                                        String str3 = "۟ۤۨۡ۟ۜۘۢۡۛ۫ۙۚۘۧۤۖۧۡۘۥۜۖۘۜۜ۬ۢۛۨۘۘۤۙ۟ۡۦۥۙۦۘۥ۬ۦۗ۟ۧ۟ۨ۠ۢ۫ۚۖۧۗ۠ۖۘۛۧۡۘ۫ۨۘ۟ۡۖۘۗۖۧۖۦۙۗۨۨۖۧۜ۬ۗۡۗۥ";
                                        while (true) {
                                            switch (str3.hashCode() ^ 2033229011) {
                                                case -57320415:
                                                    str3 = obj instanceof Integer ? "ۜۢۜۘۥۙۙۘۜۚۘۛ۫ۖۤۚۡۗۧ۬ۜۖ۬۠ۥۘ۫ۢ۟ۥۦۥۘ۠ۥۧۢۥۧۥۜۚۘۥۦ۫ۜۥۜۢۗ۫ۦۘۙۦۘ" : "ۥۚ۟ۜۦۘۦۦۡۘۜ۟ۘۡۚۚ۫ۢ۫۬ۢۜۘۧۚۡۦۨۥۘۢۛۥۘۜ۫ۗۗ۫۬۫ۦۘۡۤۥۦۖۜ۬ۢۤۡۤۛۢ۟۠۟ۦۧۘ۠ۦۜۘۥۜۤ";
                                                    break;
                                                case -21783891:
                                                    str2 = "ۗۚۘۜ۟ۢۦۨۧۘ۫ۗۖۘۙۛۗ۟ۤۛۘۛۘۘۤۢۢ۟۠۫۟۫ۘ۬ۜۨ۬ۙۛۤ۠ۖۤ۫ۜۘۧۖ۬ۜۙۡۘۘۡۛۙ۫ۨ";
                                                    break;
                                                case 961007167:
                                                    str3 = "ۘ۫ۤۙۢۢۖۢ۬ۙۡ۠۬ۢ۠ۙۖ۟ۤۥۡۘۦۚۜۘۤۙۜۧۘۤ۟ۦۘۙۧ۬ۡۚ۠ۙۥ۠ۤۘۘ";
                                                    break;
                                                case 2146062194:
                                                    str2 = "ۙۤۢۘۤ۠۠۫ۜۥۥۢۚۡۨۘۚۨۡ۟ۖۥۘ۫۫ۦۘۘۦۗۡۗۙۦۥۥۗۜۡ۠۫ۧۦۢۡۥۖ۫ۢۚۢۚۖۛۤۡۦۘۦۢۛۥۡۦۥ۬ۨ";
                                                    break;
                                            }
                                        }
                                        break;
                                    case -14355110:
                                        str = "۬ۜۨۘ۠ۨۘ۠ۛۥۛۢۦۘۦۘۗۚۡۦ۟۠۟۬ۜۘۘۥۛۙ۟۫ۘۘۥۦۨۨۨۖۛۙۗۨۨۤ۠۟ۡۘ";
                                        continue;
                                    case 1308371187:
                                        str = "ۙ۠ۤۤۧۘۘۨۙ۫ۤۘۥۘۙۦۧۖۜ۟ۗ۠ۘۡۛۖۘۤۖۥۘۜۡۗۥۨۧ۟۫ۨۢۨۥۘۥۥۘۡ۬ۢۗ۠ۜۢۨۤۤۖۘ";
                                        continue;
                                }
                            }
                            break;
                        case 978693594:
                            str = "ۡۜۛۙۖۘۡ۫ۜۘۢۨۘۜۧۢۗۡۗ۬ۢۘ۫ۥۥۘۡۙۚۜۖ۬ۚۙۘۛۧۘۘۤ۠ۥۙۦ۟ۘ۠۠۫ۦۨۘۢۨۖۖۜ۠ۧۖۨۘ۬ۤۢ۠ۦ";
                            break;
                    }
                }
            } catch (Throwable th) {
            }
            String str4 = "ۨۗ۠ۤۢ۟ۗ۠ۘۘۢۥۗ۫ۢۜۘۘۖۡۘۦۧۘۤۦۦۛۧۢۙ۠ۙۚۢۖ۫۫ۛۥۚۚۗۗ۠ۗ۠ۤۙۙۡ۟۟ۡۘۗۜۨۘۗۙۥۙۗ۟۠ۖۚ۠ۢۦۘۡۦۛ۫ۦ۟";
            while (true) {
                switch (str4.hashCode() ^ 559845173) {
                    case -825350025:
                        String str5 = "ۢ۬ۥ۬ۨ۠ۛ۠ۦۖۥۨ۟۫ۤۚ۫ۘۘۖ۠ۥۘ۫ۦۡ۬ۤۡۙۜۘۖۖۡۘۦۢۥۘ۬۫ۜۘۜ۬ۘۘ۬ۢۨۘۙۥۜۚۦۨۘۧۘۧۘۤ۫ۛۚۙۨۘۛۨۧ۫ۜۦۙۘۤۡۥۦۘۦۖۧۨۙ۫ۚ۬ۦۘ";
                        while (true) {
                            switch (str5.hashCode() ^ (-975127562)) {
                                case 921806431:
                                    str5 = "ۤۙۨۥ۬ۜۨۙۡۙۤۤۖۤۘۘۚۗۦ۟ۢۨۘۤۗ۟ۨۥۧۘۛۖۨۢ۫ۨ۫۬ۚۢۤۗۘۨۜ۬ۛ۟ۚۜۘۚۙۥۡۚ۟۟ۤۗ۠ۙۥۚۥ";
                                    break;
                                case 968953380:
                                    str4 = "ۛ۠۫ۛۤۢ۬۬ۙۗ۠ۡ۟ۜۢ۬ۨۘ۫ۥۤۡۙۥۘۜ۟ۤۛ۫۠ۘۨ۫ۧۘۖۖۡۨۦۢۚۚۡۜۘ";
                                    continue;
                                case 1045964216:
                                    String str6 = "ۚۖ۠ۗۥۙۦۜۘۤ۟ۘۘ۟ۧ۟ۗۧ۬ۨۘ۬۫۫ۢ۬ۗۙ۬ۧ۫ۦۨۡۘۛۨۙۨۦۤۘۤۗۡ۫۠۬ۜۘۘۦۤ۠ۧۛ۫ۢۖۛ۫۠ۗۖۛ۫";
                                    while (true) {
                                        switch (str6.hashCode() ^ (-1457034839)) {
                                            case -967130819:
                                                str5 = "ۢ۠ۥۘ۫ۨۦۘۘۛۧۛۗۖۘۘۙ۬۫ۧۡۛ۫ۧۛۚۚ۫ۧۨ۟۟ۦ۫ۡ۬ۡۥۖۘۢۥۛۨۛۛۖۢۧۡۖۖۖ۠۟۠ۢۨۨۨۖۘۚۚۘ۬ۦۙۚۙ۬ۢۘۘۡ۫ۨۛۤۡۘ۬ۜۡۘ۟ۚۨۘ";
                                                break;
                                            case -460550996:
                                                str6 = num != null ? "ۦۜۜۙۦ۠ۢۥۖۦۚۧۙۨۢۥۥ۠ۖۤۖۘۥۗۗۢ۠۬ۤ۫ۦۘۙ۠ۙ۫ۦۢۙۖۜۤۜۗۦۥۚۚۧۜۦۚۛۨ۫" : "۠ۚۚۙۚۗۧ۟ۖۘ۠۬ۖۘۖۨۡۙۙۢۖۙۘ۟ۥۗ۟ۢۥۘۡۘۦۘ۬۫ۦۘۘۧۢۥۙۦۘ۟۫ۘۘۡۡۦۧۦ۬ۛۥۘۘۦۘۡۘ";
                                                break;
                                            case -324052996:
                                                str6 = "۟ۜۧۘۙۘۚۙۚۛۥۡۨۜۛ۠ۛۚۦۧۦۧۘۧۙۧۢۚۛۨۘۖۖۚ۫ۤۜۘ۠ۛ۟ۖ۬ۦۘۜۦۖۘۦۡ۠۠ۧ۬۬ۥۖۦۧۧۢ۬ۦۚۗۖۘۤ۟ۦۥ۠ۡۙۚۦ";
                                                break;
                                            case 1360103563:
                                                str5 = "ۚۙۥۘۡۙۨۘ۟ۘۖۢۘ۠ۖۖ۫ۚۘۥۘ۟ۧۗۨۨۦۨۦۖۢۚۤۘۙ۟ۥۖۙ۫۫ۤۖ۬۫ۨۗۥۘۢۖ۟ۖ۫ۖۧۜۘ";
                                                break;
                                        }
                                    }
                                    break;
                                case 1373504390:
                                    str4 = "ۢۛۘ۟۬۫ۥۡۘۥۥۗۗۘ۬ۙۖ۫ۡۢ۠۫ۚۘۨۥ۠ۖۗۜۘۜ۠ۥۦۘۜۜۤۦۘۗۨۛۗۦۘۢۤۗۧۨۨۘۧۡۥۘۥۨۘۖۧۦۡۘۜ";
                                    continue;
                            }
                        }
                        break;
                    case -510233448:
                        break;
                    case 572179356:
                        str4 = "ۙۥۥ۟ۨۥۖۧ۟ۛۘۜ۠ۚ۬ۢۢۜۚۧۦۖ۠ۡۘۜۙۚۡۙۚۙ۟ۧۧۜۗۢ۫ۙۗۨ۬ۚۘۦۘۚۙۨ۠ۛۗ۫ۢۡۛۡۛۖۖ۟۟ۚ۫";
                        break;
                    case 1708656377:
                        String str7 = "ۥ۬ۘۘ۟ۗۖ۠ۨ۬۟۟ۦۙۡ۟ۨۡۢ۫ۜۘۡ۟ۜ۠ۚۗۙۙۨۥۜۨۛۢۨۘۙۛۧۤۧۦۘ۬۫ۤۘ۫ۥۘۦ۫ۖۘ۬ۧۗۡۖۥۦ۠ۥۘ۬ۤۦۖ۬ۢ۠ۥۨۘ۟ۡۚۢ۬ۚۤ۟ۧۢۜ۟";
                        while (true) {
                            switch (str7.hashCode() ^ (-867811219)) {
                                case -1089482621:
                                    str7 = "ۚۖ۬ۦۢ۟ۜ۬ۚۧۛۚ۠ۚ۬ۚۗۥۘۢۗۚ۬ۢۚ۠ۗۨۘ۠ۧۡۘۗۧ۟ۛۜۦۦۘۦۘۗۦۦۛ۟ۥۘۙۤۜۘۦۜۦۛۢۥۘۢ۟ۙ۬۫ۗۘۙۡ";
                                    continue;
                                case -1009212747:
                                    String str8 = "۟ۦۙۛۤۙۚۗۡۘۙ۬ۚۦۘۖۙۨۜۘۤ۬۟ۛۛۚۥۨ۟۠ۖۨۧۨۡۘ۠ۜۧۘۢۧۙۤۡ۟ۨۢۥۘۘ۠۠ۚۚۦۛۘ۟";
                                    while (true) {
                                        switch (str8.hashCode() ^ 686428059) {
                                            case -450149941:
                                                str7 = "ۨ۠ۖۙۖۖۨۙۗ۟ۧۗۚ۠ۦۘۦ۟ۦۤۥۢۛۨ۫ۘۦۚۗۜۜۘ۟۟ۚۜ۠ۜۚۥۡۘۥۧۛۨ۫ۘۘۚۚۧ۠ۛۨ۠۫ۛۚ۠ۦۘۛۥۖۘۨ۫ۖۖۘۢ۬ۙۛ۟ۦۡۘ";
                                                continue;
                                                continue;
                                            case -403644902:
                                                String str9 = "ۖۛۧۗۙۡ۬۫ۧۙۦۙۥۡۜۖۥۧۜ۫۟ۚۜۖۨۘۜۨۨۘۤۛۥۗۜۨۘۨۘۢۙۖۙۨۢۛۚ۠۟ۨ۬ۥۘۜ۫ۘۘ۬ۡ۠ۗۨۘۖۢۡۧۨۦۘۢۘۗۘۥۢۦۥۘۗ۫ۖۗۡۘ";
                                                while (true) {
                                                    switch (str9.hashCode() ^ (-1507930491)) {
                                                        case -1243102535:
                                                            str8 = "ۘۗۖۢۢۗۧۧۢ۟ۛۧۦۛۤۦ۟۟ۢۥۧ۠ۜۡ۫ۧۗۖۨۘۤ۫ۤۛ۠ۦۘ۬ۨۢۚۖ۬ۤۥۥۘۢۘۤۢۗۨۘۦ۬ۘۘ۬ۚۛۙۙۙۡۥ";
                                                            break;
                                                        case 230760485:
                                                            str9 = "ۘۥۤۡۢۥۦ۠ۙۜ۫ۖۘۗۗ۠ۘۧۥۘۤۘۤۙ۠ۡۖۚۧۘۨۨۘۚۜۘۗ۬۠۠ۚۡۘۡۥ۠۟ۚۙ";
                                                            break;
                                                        case 559619463:
                                                            str8 = "ۢ۫ۡۘ۫ۥ۫ۦۤۡۜۜۜ۟ۨ۟ۜ۟ۢۛۥۢۡۗۦۘ۟ۨۤۚ۟ۦۙۘۘۘۧۘۘۛۛۚۛۢۛۤۢۘۡۡۘ۫ۡۜۨۙۖۨۖۥۥ۬ۤ۠ۛ۟";
                                                            break;
                                                        case 1366527842:
                                                            str9 = num.intValue() > 0 ? "ۤۦ۠ۢۢۢ۫ۜۜۘ۟ۙۢۥۡۜۗۜ۟ۗۗۡۨ۠ۨۛۢۜۘۦ۟۠ۛۗۨۗۘۖۘۛۖۨ۬ۦۘۘۦۙۛ۠ۖۘۦۜۧۘۢۗۖۚ۠ۜۛۢۥۥۗۘۘۦۡ۬۫ۡۧۚ۠ۛ۫ۗۙ۟ۙۡۘۨۢۡ" : "۟ۗۙۗۗۦۘۘۚ۟۠ۚ۠ۤۖۦۛۙۦۘۤۙۘۘۘۤۡۛۜۚۢۢۖۘۗۛۤۦۖ۠۠ۨۡۘۛۜۙۙ۫ۨۘ۟ۥ۠ۛ۬ۨۡۘ";
                                                            break;
                                                    }
                                                }
                                                break;
                                            case 1210223032:
                                                str7 = "ۚۛۨۘۙۦۨ۟ۢۘۘ۠ۧۖۨۚۙۗۡۛۖۜۥۘ۬ۙۖۡ۬ۘۗۢۡۜۢۛۗۛ۠ۚۖۤ۟۠ۚۢ۫ۜ";
                                                continue;
                                            case 2032829033:
                                                str8 = "ۗۜۢۢۛۘۘ۬۬ۦۘۨۡۥ۬ۥۜ۟۠ۚۗۡۛۡ۬ۨ۬ۤۙ۬ۖ۬ۚۨ۠ۜ۬ۡۘۙۦۘ۫ۧۗ۟ۦۧۘۙ۫ۨۙ۬ۙۜۦ۠ۗۥۖۦۜۘۘۘ۬ۖ";
                                                break;
                                        }
                                    }
                                    break;
                                case 458250435:
                                    z = false;
                                    break;
                                case 2067450259:
                                    z = true;
                                    break;
                            }
                        }
                        String str10 = "ۛۖۚۜۥۧۡۖۤۨۧۦ۟ۘۥۡۗۛ۬ۡۨۜۡۜۛۚۜۡۧۜۙ۟ۥۘۚۤۢ۠ۨۘۨۙۨۘۛۙۤۛ۟ۥ۬ۥۦۚ۟ۦۘ۬ۢۗۚۜ۬۟ۨۖۘۨۙ۬ۢۦۜۘۧۛۗ";
                        while (true) {
                            switch (str10.hashCode() ^ (-1416343695)) {
                                case -1110252544:
                                    break;
                                case 242730167:
                                    String str11 = "ۖۡۜۚۛۘۜۘ۬ۜۜ۫ۛۡۘۘۡۧۘۨۙۜۘ۠ۦ۟ۜ۫۟ۥۦ۬ۦۙۢۙۨۗۙۛۛۧۥۜ۠ۦۧۘۢۛۜۢۨۢۜۦۚۧۨۡۛ۫ۥۛ۬۬ۢۗۘۘۧۨۜۛۤۘۥۘۙۨۛۥ۫ۜۘ";
                                    while (true) {
                                        switch (str11.hashCode() ^ 1912558162) {
                                            case -1647315354:
                                                str10 = "۠ۧۙ۫۟ۘۜۘ۫ۢۚۤۘۨ۬ۘۢ۫۠ۖۘۜۜۛۦۗ۟ۢۧ۫ۖۦۧۘۨۗۗ۫ۘۚۗۘۨۘ۫ۢۙۢۢۚ۠ۖۦۖۛ۫۠ۢۚۘۧ۠ۧ۟۠ۖۘۗۖۥۘۧۜۢۜۚۥۦۤۖۦۜۖ";
                                                continue;
                                            case 4278386:
                                                str10 = "ۧۦۧۘۧۘۧۘۦۚۜۘۖۡۙۥۚۚۢۤ۟۠ۚ۟ۢۙۜۘۚۢۛۡ۬ۤۧۤۜۢۡۦۘۦ۫۬۫ۥۨۤۘۘ۟ۖۧۘۢۡۙۥۖۨۛۤۖۘۢۥۧۘۙۥۡۘۚۥۚۦۙۜ۬۫ۦۘۚ۠۟۬ۨۘۦ۠ۧ";
                                                continue;
                                            case 1744064486:
                                                str11 = "ۦۗۛۜۦۤۡۡۜۜۛۢ۟۠ۘۘ۫ۘ۫ۦۥۘۢ۠ۦۦۡۥۘۤۢ۟ۜۤۙۛۚۢۛۤۥۥ۬ۧۛ۟ۘۤۙۛۢۙۦۛۙۛ";
                                                break;
                                            case 2135442432:
                                                String str12 = "ۚۤۘۤۙۦۘ۟ۖۦۘ۟ۛۛۤ۫ۖۘۚۤ۠ۚۘۢۘ۬ۡۘۛۛۜۘ۠ۨۖۘۨۧ۟ۨ۫ۛۖ۫۬ۜۚۘۘۙۦۘۛۥۛۖۗۜ۫۫ۨۘۧۢۡۘۡۙۡۘ۠ۘۜۘ";
                                                while (true) {
                                                    switch (str12.hashCode() ^ 1289284537) {
                                                        case -1525825726:
                                                            str11 = "ۘۢۖۘۘ۫ۚۙۧۢۥۢۜۘۖۜۛۤۦۦۘۘ۟۬ۜۖۖۘ۫ۚۖۘۗ۫ۧۜ۟۬ۚۘۖ۫ۜۘۛۙۥۘ۟ۦۙۦۘۥۘۜۖۦۜۛۥۛۛۥۘۜۚۘ۟ۛۨۤۙۢۛۦۘۢۢۥ";
                                                            break;
                                                        case -1320860950:
                                                            str12 = "۫ۨۜۜۜۡ۠ۗ۬۟۬ۖۘۤۨۛۜۖۜۙۧۥۛۧ۟ۧۘۤۚ۟ۧ۠ۤۜۙۧ۠ۧ۠ۢۥۘۛۡۨۨۘۦ۫ۙۢۗۦۘۢۨۙ۫ۜۦۚۚۦۘۘۗ۟ۛۚۜۘۛۨۦۨ۟ۘۘ";
                                                            break;
                                                        case -105474043:
                                                            str11 = "ۗۥۧۥ۟ۥۧۗۡۘۨۦۖۘۙۛۛۤۤۨۘ۟ۧ۟ۦۘۙۡۙۚ۬ۗۗ۠۟ۜۘۚۡۦ۠۬ۛۚۢۥۨۚۛ۫ۜۖۖۛۡۜۨۘ";
                                                            break;
                                                        case 596881951:
                                                            str12 = z ? "ۢۗ۟ۗۚۧۘ۫ۖۘۖۖۥۛۛۧۢۜۘۚۜ۫ۚۖۥۘ۫ۖۨۛ۠ۖۘۙۙ۠۬ۤۘۖۖۦۘۢۧۜۘۘۢۗۧۡۡۘۤۤۘ۫ۦۦ۫ۜۘۘۧۖۨۘۜۢۦۘ۫ۙۦۖ۠ۨۡۚۘۘۧۗۧ۠ۨۥۜ۫ۦۘ" : "ۙۥ۟ۥۙۖۘۗۧ۫ۗۘۥۖ۬ۤۤۘ۫۫۬ۥۘۦۡۥ۫ۥ۟ۜۙۘۦۘۜۘۧۥۘۗۘۗۙۡۦ۫ۜۡۡ۬ۤۚۤۘۘۚ۟ۨۘ۟ۦۡۘۥۢۦ۟ۚ";
                                                            break;
                                                    }
                                                }
                                                break;
                                        }
                                    }
                                    break;
                                case 1174424612:
                                    num2 = num;
                                    break;
                                case 1914034666:
                                    str10 = "ۚۚ۠۟ۡۚۤۡۥۙۥ۬ۖۧۢۛۖ۠۠ۙۛۙۖۥ۟ۙۡۘۜۗۜۘۙۛ۬ۡۛۦۜۖۜۘ۬ۖ۫ۗۨ۬ۘۨۥۘۡۘۘۘۤۗۖۨۛۦۛ۫ۗۜۜۜۘ";
                                    break;
                            }
                        }
                        break;
                }
            }
            f960 = num2;
            num = null;
            String str42 = "ۨۗ۠ۤۢ۟ۗ۠ۘۘۢۥۗ۫ۢۜۘۘۖۡۘۦۧۘۤۦۦۛۧۢۙ۠ۙۚۢۖ۫۫ۛۥۚۚۗۗ۠ۗ۠ۤۙۙۡ۟۟ۡۘۗۜۨۘۗۙۥۙۗ۟۠ۖۚ۠ۢۦۘۡۦۛ۫ۦ۟";
            while (true) {
                switch (str42.hashCode() ^ 559845173) {
                    case -825350025:
                        break;
                    case -510233448:
                        break;
                    case 572179356:
                        break;
                    case 1708656377:
                        break;
                }
            }
            f960 = num2;
        }
    }
}
