package p001;

import com.tendcloud.tenddata.C0133zz;
import java.io.Serializable;
import java.lang.Enum;

/* JADX INFO: renamed from: ۟.q2 */
/* JADX INFO: loaded from: classes.dex */
public final class C0359q2<T extends Enum<T>> extends AbstractC0176d<T> implements Serializable {

    /* JADX INFO: renamed from: ۥ */
    public final T[] f1039;

    public C0359q2(T[] tArr) {
        this.f1039 = tArr;
    }

    @Override // p001.AbstractC0162c, java.util.Collection
    public final boolean contains(Object obj) {
        boolean z = false;
        boolean z2 = false;
        Enum r11 = null;
        T[] tArr = null;
        int iOrdinal = 0;
        T t = null;
        T t2 = null;
        T t3 = null;
        boolean z3 = false;
        boolean z4 = false;
        String str = "۠ۗۥ۟۫۟۠ۡ۟ۡۘ۠۠ۢۦۘ۠ۦۥۢۧۖۘۨۜۧۦ۠ۨۦۨۛ۟۬ۙۛۖۤۛۘۚۧۧ۠ۚۚۦۨۖۤ۫ۗۖ۠ۛۧ۠ۦۖ۟۬ۦۘۢۤ";
        while (true) {
            switch ((((((((str.hashCode() ^ 502) ^ 606) ^ 861) ^ 377) ^ 878) ^ 593) ^ 808) ^ 550965361) {
                case -2026238825:
                    t2 = null;
                    str = "ۙۘۨۙۗ۬۫ۥۢۤۘ۫ۜۦۧ۬ۗۘۙۘۛۧۗۖۖۚۜۥۖ۫ۗۛۖۘۧ۟ۛۙۧۧۤۡۖ۟ۨۘۡۘۦۘۧۛۢۖ۬۠ۢۘۥۘۚۤۡۘ۟ۚۜۦۖۦۘۛۜۜۘ۬۟";
                    continue;
                case -1459194193:
                    z2 = false;
                    str = "ۜۙۘ۟۟ۧۚۖ۬ۤ۠ۙۡۖۨۙۡۘۢۖۘۘۜۘ۬ۖۧۛۗ۬ۨ۟ۤۦۡۛۦۦ۫۬ۢۥ۠۟ۧۘۧۘۧۨۘۘۜۤۙۗۤۘۘ۠ۛۘۦۗۢ";
                    continue;
                case -1026328203:
                    tArr = this.f1039;
                    str = "ۗ۠ۘۘۗۡ۬۠ۢۡ۠ۛۡۥ۟ۘ۟ۚۙۤۗۜۚۗۛۦۜۜۜۗۢۖۦ۬ۜۘۥۜۘۘۚۡۢ۫ۚۜۘ۠۟ۡۘۧۛۗ۫ۗۙ";
                    continue;
                case -735038334:
                    z3 = true;
                    str = "ۧۙۖۢۚۜۘ۠ۖۥۘۘۜۧۘۤۤۢۤۗۛۜ۬ۙۖۧۘۢۗۖۘۢۚۢ۫۬ۦۡ۫ۛ۟۠ۙۡ۟ۥۘۨۧ۬";
                    continue;
                case -386842826:
                    return z4;
                case -343690549:
                    t = tArr[iOrdinal];
                    str = "ۘۦۜ۠ۧۛۦۙۖۘۦ۟ۤۢۡۙ۬ۡۡۘۚ۬ۡۢۗۖۜۛۗۙۗ۬ۖ۟ۤ۫ۥۘ۫ۨۧۢ۬ۘۨۢۦۘۚۛۘۨۥ۠ۘ۬۟ۚۢۛۚۢۚۚۘۢ۫۟ۙ۬ۜ۫ۨۚۙۖۧۘۖۧۦۘۚۘۦ";
                    continue;
                case -203199663:
                    String str2 = "ۖ۫ۨۛۡۨۘ۟ۚۥۨ۬ۨۦۚۙۚۜۜۨۗ۠ۨ۫ۧۘۤ۫ۛۛۤ۠ۖۜۤ۬ۚۧ۫ۤۤۨۘۜۜ۬";
                    while (true) {
                        switch (str2.hashCode() ^ 139514158) {
                            case -2015367358:
                                str2 = "ۨ۫ۜۘۤۧۖۦۥ۫۠ۙۛۤ۫ۦ۟ۨۚۨ۟ۧ۬ۚۙۙۥۤۚۧۘۢۜۘۗۧ۠ۨ۠ۜۘۥ۬ۛ۫ۤۖۙ۬ۙۦۘۤۖۢۡ";
                                break;
                            case -1875759263:
                                break;
                            case -1658977070:
                                String str3 = "ۘۗۡۘ۬ۖۥ۬ۢۗۚ۫ۛۗۧۡ۠ۦۘۚۨۙۨۛ۠ۖۡۘۘۥۜۦۘۙ۟ۚ۠ۜۦۥۖۘۤۦۡۨ۠ۨۘ۬ۜۡۘ۠ۨۜ۟ۦۤ۬۬۬ۧۖۜۘ۠۬ۨۡۨۧۦ۟ۗۖ۟۫ۗۜۗۧۜۘۦۖۥۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ 730660925) {
                                        case -1806471659:
                                            String str4 = "ۨ۫ۖۥۡۘۡۘۨۧۘ۫ۨۤۥۘ۫ۜۥۥۗۜ۬ۥۙ۫ۚۛ۫ۧۥۨۧۛۛۖ۫ۨ۟ۧۙۥۦۘۖۨۗ۬۟ۢۚۤۗۛۙ۫";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-627009054)) {
                                                    case -2107909604:
                                                        str4 = iOrdinal >= 0 ? "ۖۦۥۘۙۨۘۚ۠ۦۘۙۧۤۘۦ۬ۢۦۧۘۢۛۘۚۗۖ۫ۧۡ۬۠ۨۚۖۗۨۖۘۘ۟ۡۥ۟ۙۧ۟ۜ" : "۠۠ۜۤ۬ۖۘۙ۫ۧۢۚۙۤۚۦۜۜۡۘ۟ۙۛۢۜۖۦۨۤ۠ۦۦۙۦۜ۬ۡۡۘۡۢۖۘۦۘۖۘ۠ۗ۬ۧۗ۫ۛۗۚ۠ۡ۠ۧۗۢۥ۬۠ۛۤۖۘۖۛ۬۠ۨ۫ۦۥۢۨ۟ۥۘ۠ۡۗۛۧۗ";
                                                        break;
                                                    case -1294600306:
                                                        str4 = "۬ۚۢۛۚۨۘۡۦۢۚۙۨ۠ۦ۟ۧۙۢۛۡۜۘ۫ۡ۫ۘۜۦۘ۟ۨ۫ۢۘۢۛ۫۠ۛۘۢۙۛۚ۫ۦۘ۫ۨۙۨۛۥۘۘۚۡ";
                                                        break;
                                                    case 822080459:
                                                        str3 = "ۢۢۢۚۜۦۘۥۢۥۧۚ۠۟ۚۨۘ۟ۤۥۘ۠۬ۜۛ۠۠ۖۙۗۛۦۘ۠ۥۙۦ۟ۜۘۜۗۙۨۗۛۙۥ۠ۗۡۘۥۦۖۘۥۧۜۘۧۤۖۛۙۦۘۤ۫ۜۘ۬ۧۖۘۧ۫ۘۢۡۘ";
                                                        break;
                                                    case 1016520646:
                                                        str3 = "ۘۦۜۗۦۜۘۡ۠ۦۘۦ۠ۖۘۚ۬ۜۘ۠ۛۘۘۨۖۘۚۢۢۛۦۖۙۘۜۚ۟ۨۘ۬ۘ۠۫ۙۖۘۥ۠ۥۘۧۡۥ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -1684137341:
                                            str2 = "ۚۛۨۛۨۤۤ۬۬ۖ۫ۖۘۢۨۦ۟۠ۡۘ۠ۥۥۨۛ۠ۜ۫ۘ۬ۘ۠ۖۨۘۥۥۤۘۖۘۤۛۘۘۜۛۖۘ";
                                            break;
                                        case 332969538:
                                            str3 = "ۗۚۖ۬ۗۡۘ۟ۦۚۨۗ۫ۡ۟ۛۛۥۧ۫ۖۜۘۙۜۥ۬ۚۥۧۖۡۛۛۨۖۚۜۜۜۚۡۗۘۘۧۨۧۘۜۥۥۛۡۢۜۢۦۘ۟ۦ۠ۜ۠۠ۘۙۚۗۧ۬۬ۗ۬ۥۛ۬ۨۚۨ۬ۗۡۘ";
                                            break;
                                        case 607065942:
                                            str2 = "ۖ۫ۤۦۨۛۧ۬ۧۦۡۧۡۖۨۧۚۚۢۤۚۢۤ۬۬ۘۘۚۡۗۡۘۥۘۚۘۤۖۙۘۘۥۛۚ۠ۚۧۗۧۢۥۥۙ۠ۚۦ۠ۥ۬ۘ۠ۥۘۗۘۘۘۢۡۘ۬ۛۗ۫۠";
                                            break;
                                    }
                                }
                                break;
                            case 1041558814:
                                str = "ۥۦۨۢۘۢۘۤۡۘۥۧۛۙۢۖۘ۠ۡۦۘۖۖۧ۬ۗ۫۟ۜۘۜۤۖۘ۫ۢۖ۟ۛۙۜۜۡۘۖۧۖۘ۟۟ۚۤۙۥۘ۠۫ۛ۫ۖ۠ۖ۬ۖۘۤۡۧۘۙۡۘۚۜ۫۬ۦۘۡۢۙ";
                                break;
                        }
                    }
                    break;
                case 288120035:
                    str = "ۜۧۖۥۜۖۚۥۘۘۤۧۘۦ۬ۧۤۥ۬ۧۦۘۢۛ۫ۜۤۨۘۜۘۢۜۦ۬ۡ۟ۜۢۨۥۥ۫ۡۘۢۥۧۡ۠ۢۦۖۘۙۤۜ۟ۚۘۘۤ۫ۘۙۛۘۘ";
                    continue;
                case 290775587:
                    return false;
                case 303754152:
                    str = "ۜۧۖۥۜۖۚۥۘۘۤۧۘۦ۬ۧۤۥ۬ۧۦۘۢۛ۫ۜۤۨۘۜۘۢۜۦ۬ۡ۟ۜۢۨۥۥ۫ۡۘۢۥۧۡ۠ۢۦۖۘۙۤۜ۟ۚۘۘۤ۫ۘۙۛۘۘ";
                    t3 = t2;
                    continue;
                case 523793576:
                    z = obj instanceof Enum;
                    str = "ۥ۠ۨۘۡ۟ۧۥۡۧۤ۫۬ۚۜ۟ۧۨۘۚۘ۠ۗۥۢۥ۟ۘۗۡۜۛۢۡۙۘۢ۠ۦۘ۫ۛۦ۠ۦۛۦۤۗۛۥۦۗۜۘۧ۟۟ۙۚۥۘۙۤۘۘ۟ۧۡۘۙۙۥۘۢۜۘۡۤۨۘۖۢۦۘ۠۬ۨ";
                    continue;
                case 1041416917:
                    str = "ۨۖۘۘ۬ۙۖۘۘۚۤۘۤ۬ۙ۫ۤۤۗۗۡۥۤۖۡۜۘۧۦۜۨۦۖۧ۬۠ۨۘۢۚۘۘۖۖۨۘ۠ۙۛۨۥ۠۠ۛۦۘۦ۟ۤۙۡۥۘۘۦ۟ۖۦۦۜۡۦۖۖۘۨ۫ۥۛۛۚۡ۟ۨۘۚۤۜۘ";
                    continue;
                case 1121494633:
                    str = "۬ۤۨۥۖۖۘۗۚۘۚۜۢۧۚۨۢۦۖۚ۠۠ۤۦۘۡۡۦۘ۫ۜۦۘ۫۟ۦۜۦۨۘۘ۬ۚ۠۬ۥۘ۬ۡ۫ۚۢۥۙۚۦۘۛ۬۠ۖۦۡۙۡۤ۬ۜۥۘۗۥۡۙۧ۟ۦۨۧۘ";
                    continue;
                case 1187132337:
                    String str5 = "ۚ۬ۦ۫۬ۙ۬ۙۚۡۥۘۦۨۧۘ۟ۗۜۘۢ۬۠ۨۧۥ۫ۥۦۘۢۨ۠ۗۘ۟۟ۥۘۢۧۖۘۨ۬ۛۗۛۖۡۛۜۘۖ۠ۖۗۖۗ۫ۤ۟ۜۧۡ۟ۘ";
                    while (true) {
                        switch (str5.hashCode() ^ 554638551) {
                            case -926531637:
                                break;
                            case 75593238:
                                str = "ۜۥ۫ۜۥ۫ۗ۠ۥۘۦ۫ۖۧ۠ۜۢ۬ۗ۫ۚۡۘۛ۫ۦۘۤۜۦۡۦۛۙۜ۬ۖۙۧۛ۟ۘۘۗۤ۬۬ۥۘۘۜۛ۫ۦۙۙۤۖۗ";
                                break;
                            case 768796407:
                                str5 = "ۥۛۘۗۗۨۘ۬ۗۖۤۡۗۖۢۗ۬۠ۦۨ۟ۡۥۨۨ۟ۥۖۘۦۖۨۖ۟ۙۚۘۘۘۚۨ۠۬ۙۛۦ۟ۗ";
                                break;
                            case 1139916378:
                                String str6 = "ۧ۬ۘۥ۟ۦ۫ۢۖۖۦۖۨۜ۬ۗۚ۟ۛۨۘۘ۬ۙۘۧۖۖۘۢۚ۬۠ۛ۬۟ۧۡۢۡۡۗۦۗ۫ۡ۫";
                                while (true) {
                                    switch (str6.hashCode() ^ 867339809) {
                                        case -1195421056:
                                            str6 = "ۘۧۙۢۦۤۚۦۚ۬ۖۨۡ۠ۙۧۙ۠ۗۡۧۜۜ۟۫۠ۘۘۡۦۛۚۘۚۡۘۖۖ۬ۗۤۘ۟ۜ۟ۨۗۖۘۦۢۢۜ۫ۦ";
                                            break;
                                        case -1148351937:
                                            String str7 = "۬۫ۚۛۢۤ۫ۦۘۦۚۜۘۢۚۨۘۛ۬ۛۜۚۘۘۥۥۖۧ۬ۖۥۦۡۨ۫ۛۖ۫ۨۧۨۘۘۙۢۤۧۧ۟۟ۡۢۗۡۡ۬۬ۗ۬ۡۘۘۡۖۘ۟ۚۧۧ۫ۗۗ۠ۦۚۡۧ";
                                            while (true) {
                                                switch (str7.hashCode() ^ 848055876) {
                                                    case -1399522085:
                                                        str6 = "ۨۛۦۘۜ۠۬ۗۛۘۘۢۢۥۘۥۡۧۘۡۗۖۘۗۥۘۦ۫ۧۧ۫ۘۘۜۘۢ۠ۙۗۨۥ۠ۦۜۖۘۛ۫ۧۤۚۖۗۦ۠۬ۧۖۛۧۨ";
                                                        break;
                                                    case -1387087412:
                                                        str7 = iOrdinal <= tArr.length + (-1) ? "ۙۨۡۘۙۚۦۨۗۘ۬ۚ۬ۚۙۨۘۦۧۡۧۡۖۘ۬ۨۥۚۛۛۤۚۖۡۤۦ۟۟ۤ۫۫ۙۖۨۨۘۚۧۦۜۦۧۗ۟ۤ۬۟ۥ۟۫ۢۢۥۚ" : "ۘۛۨۘۘۜ۬ۜۖۤۖۦۡۤۛۜۜۡۦ۠ۚۧۡۦۛۧۨۛۘۤۜۘ۫ۢ۟ۚۛۘ۟ۨۙۢۗۚۙۤۦۨۧۛۦ۫ۦۚۘۖۤۜۗۚۜۜۘۤ۫ۜۘۛۢ۫ۢۖۜۢۛۨۘۖ۬ۡۘ۟ۥۧۘ";
                                                        break;
                                                    case 590088027:
                                                        str7 = "ۛۜۢۛ۫ۧۡۢۜۘۡ۠ۖۜۖۨۘۚ۟۫ۙۧۙۦۘۨۘۙۜۧ۫۬ۥۘ۠۠ۖۜۚ۬ۜۨۥ۠ۙۥۘۛۦۧۘ۬ۨۧۘۡۡۧ۬ۛۢ۟ۛ۬ۤۦۡۘۖ۫ۦۘ۬ۘۙۥۥۘۙۘۚ";
                                                        break;
                                                    case 1938036912:
                                                        str6 = "ۚۥۡۘۖۘۡۜۖۦۜ۬ۖ۫۬۟۠ۨۚۛۜۧ۫ۗۖۘۘۘۜۧۖۖۘۛۙۘۗۖ۟ۜۡۦۘۧۖۡۘۛۦۧۘ۬۠ۦۘۖۗۚ۠ۛۖۘۦۡۥۦۦۥۤۤۙۡۛ۬ۜۗۚۥۙۖۘۤ۠ۢ۫ۧ۫۟ۡۙ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 448505019:
                                            str5 = "ۖۦ۟ۛۨۙ۟ۖ۠ۡ۫ۨۢۛۗۦۛۨۘۗۦۨۘۜۧۛۜۢ۬ۙۖۨۖۙۧ۬ۡۘۨۗۖۘۦۜ۬ۤۛۖۙۜۡۘۢۖۘۢۨۨۘ۠ۛۥۦۙۨۡۡ۬ۡۚۖۨ۟ۙۛۦ۫";
                                            break;
                                        case 1136946678:
                                            str5 = "۠ۦۨۘۚۦۜۘۥ۟ۖۡ۬ۖۥۜۙۖ۫ۡۨۨۡۨ۬ۚۢۨۜ۟ۜۚۖ۟ۡ۟ۛۛۗۥۢۦۦۗۘۤۖۖۘۚۘۧۘۢۨۜۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1193788616:
                    C0237h4.m1090("element", r11);
                    str = "ۨۙۨۗۜۤۖۦ۠ۧ۫ۚۦۘۜۘۥۨۛۨۖۖ۟ۥ۠ۘۢۨ۬ۨۜۖۤ۠۬ۤۨ۠ۨۘۤۨۤۢۤۘۘۧۙۙ۬ۤۜ۫ۖۙۚۜ۫ۦ۟ۚۘۚۥۛۖۡۙۚۡۘۧ۠ۜ";
                    continue;
                case 1320572754:
                    str = "ۚۤۗۧۜۧۘ۬ۢ۬ۛۚۙۤ۬ۥۘۢ۟ۧۛۜۢۦۙۙۨ۬ۥۘۦۨۡۛ۬ۡۘۚۡۦ۬ۙۙۥۘۘۢۦ";
                    t3 = t;
                    continue;
                case 1356773344:
                    String str8 = "ۧۥۥۘۤۚ۬ۛۘ۟ۨ۠ۚۧۦۨۘۛۥۜ۬۫۠ۛ۟ۡۘۡ۠۫ۧۢۘۚۦۘۥ۬ۘۡۛۗۙۛۦۘۡۖۜۘۛۡۖۨۜۖۘ۠ۤۜ";
                    while (true) {
                        switch (str8.hashCode() ^ (-1590748219)) {
                            case -2027676944:
                                str = "ۜ۬ۡۙۜۖۘۥۗۙۖۨۚۚ۟ۘۜۡ۫ۙۜۚۢۙ۬ۤۙۖۥۥۛۧۚۗ۫ۡۨۘۨۦ۟۫ۘۖ۟ۛۨۨۨۖۛۘۢۙۖۘۘ";
                                continue;
                            case 740893237:
                                str = "۠ۖۥۘۙۦۜۘ۫ۘۥۢۗۛ۠ۡۖ۬۟ۥۘۡۦ۟۬ۦۖۛۢۖۤۖ۠ۦ۟ۘۡۤ۠ۜ۬ۨ۠ۢۛ۟ۜۗۦۘ۫ۙ۠ۥۚۢۢۤۘ۟ۖۚۨ۫۫۠۟ۦۦۨۦۥۖۙ";
                                continue;
                                continue;
                            case 1252328183:
                                str8 = "ۗ۠ۦۘ۫ۥۘۧۤۖۘۦ۬ۨۘۦۨۥ۫۠ۙۛۢۜۜۢ۠۟ۦۘۜ۫ۦۘۢۚ۠ۗ۫ۥۘۛۨۚۚۗ۬ۢۥۥۘۛۚۙۢۖۨ۫ۦ۠ۢۙ۬ۜۖۘۧۦۙۡۜۜۘۘۛۨۘۗ۠ۜۖۖۛۗۢۨۘۨ۬۟";
                                break;
                            case 1252951013:
                                String str9 = "ۜۦۧ۫۠ۚۘ۬ۖۢ۫ۛۤۜۢۘۜۚۡۨۦۥۨۢۨۘۘ۟۠ۥۘۥۚۖ۫ۜۢۤۢۜۡۗۘۘۡۗۚ۠۫ۚۛ۟ۘۗۤۦۘۤۧۨۘۧۚۤ۫ۛۢۨۚۛ۠ۚۡۘۚۨ۟";
                                while (true) {
                                    switch (str9.hashCode() ^ 352393159) {
                                        case -1436575417:
                                            str8 = "ۖۗۦۘ۬ۗۤۨۛۦۢۨۖۘۨ۠ۥۚ۫ۜۛۖۘۡۚۡ۫۫ۦۘ۠ۗ۫ۙۛۗۥ۟ۘۜۧۛۡۙ۫ۗ۠ۡۘۖۡۦۤۛۘۘ۠۫ۖۙ۠ۡ۟ۙۧۡۗۘۘۢۦۘۢۗۖۘۗ۠ۨۘ";
                                            break;
                                        case -286416000:
                                            String str10 = "ۥ۬ۡۘۚۧ۟۟۠ۥۘۥ۫۬ۛۧۜۘۘۜۖۗ۠ۜۛۡ۠ۨۛۨۦ۫ۥۘۗۙۡۘۡۦۦ۠ۖۥۦۥ۫ۦ۟ۙۨۙۢۗ۟ۢۜۡۖۧۡۚۖۜۘۛۗۖۘۢۖۦۤ۠۬ۛۙۥ";
                                            while (true) {
                                                switch (str10.hashCode() ^ (-1135959206)) {
                                                    case -1461120772:
                                                        str10 = t3 == r11 ? "ۢۦۗ۟۬ۡۗ۬ۡۘۙۙۦۘۤۗ۬ۡ۬ۜۘ۟ۜۧۘۜۤۚۜ۬ۖۘۗۛۖ۫ۙۥۘۡۜۙۥۗۙۤۥۧۘۥ۟ۨۦۢۜۘۛۧۨۘۢۡۘۘۡۜۨۘۜۙ۠ۜۖۨۘ" : "۠ۢۡۨۤۢۡۧۨۘۢۖۨۘۗۗۙ۫ۖۢ۬۟ۖۢۡۘ۫ۛ۬۟ۥۚۤ۬ۚۧۖۡۧ۠ۦۦۘۛۧ۫ۘۚۙۡۘۢ۠ۘ۟ۤ۟ۢۛۘۨۨ۫ۡ۟ۙ۟۠ۖۘۚ۟ۥۡۡ";
                                                        break;
                                                    case -654564971:
                                                        str9 = "ۘۗۦۚۨ۠ۨۚۥۘۗۥۧۘۛۦ۫ۜۛۛ۬ۨۖۘۨ۬ۙۧۛۡۖۚۨۘ۠ۦۖۤۘۢۛۦۘۚۘۖۘۥۦۙۨۛۙۨۛۜ۟ۘۘۛ۠ۨۛۥۘۘۨ۠۟ۦ۟ۦۢ۫ۗۙۚۥ";
                                                        break;
                                                    case 661947865:
                                                        str9 = "ۡ۠ۜۘ۫ۢۥۘۧۨۘۛۡۘۡۥۘۖۨۥۘۜ۬ۧۨۤۥۘۨۡۛۦۖۥ۟ۚ۠۠ۧۨ۫ۤ۟ۛۜۢۥ۠۫ۥۥ۬ۤ۫ۜۘۨۘۘۧۦۧۘۜۦۨۘۙۗۘۘ";
                                                        break;
                                                    case 2012708128:
                                                        str10 = "ۚۥۖۘۖۧۨۙۧۘۘۨۛۤۖۘۙ۠ۘۘۖۗۨۚۦۦ۠ۙۨۖۦۦ۬ۨۖ۟ۤۥۗۜ۠ۘۘۨ۬ۥۘۚۖۘۜۨۜۚۧۥۤۢۨ۠ۛۥ۠ۢۦۗۚۤۡۥۦۦۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -104235540:
                                            str8 = "۬ۥۡۡۛۥۘ۟ۛۚ۫ۤۨۘۧۦۥ۟ۢۜۗۥۘۘۗۖ۬ۖۨۘ۟۠ۛۨ۠ۖۘۥۘۗ۠ۡۦۘۥۙۡۘۨۦ۟ۦۡۧۘ۬ۥۗۢۧۨۘۙۖۖۘۤۡ۫ۘۤۢ۠ۥۨۤۙ۠ۖۗ";
                                            break;
                                        case 2047867133:
                                            str9 = "ۛۜۨۚۤۖۘۛۧۤۥۤۡۘۡ۫ۥۘ۫ۨ۠ۨ۠ۥ۫ۙۤۡۢۜۧ۠ۥۘۥ۟ۤۛۢ۫ۛۢۥۦۜۜۜۡۘۘۜۜۘۖۦۗ۬ۥۡۦۛۧۜۘۨۘۨۢۙ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1357808052:
                    C0237h4.m1090("<this>", tArr);
                    str = "ۤۡۦۜۡۧۢ۟ۦۧۗۥۢۚۖۜۨۧۘۡۡۙۤۧۢۘۡۜۦۙۥ۟ۡۦ۫ۗۘۘۥۨۘۨۦ۫ۤۧۧۗ۬ۨۘۦۚۥۘۤۥ۟";
                    continue;
                case 1392524227:
                    str = "۠ۖۥۘۙۦۜۘ۫ۘۥۢۗۛ۠ۡۖ۬۟ۥۘۡۦ۟۬ۦۖۛۢۖۤۖ۠ۦ۟ۘۡۤ۠ۜ۬ۨ۠ۢۛ۟ۜۗۦۘ۫ۙ۠ۥۚۢۢۤۘ۟ۖۚۨ۫۫۠۟ۦۦۨۦۥۖۙ";
                    z4 = z3;
                    continue;
                case 1484667951:
                    str = "ۛۛۡۗۜ۫۠ۛۜۜۛۦۘ۬ۡۦۘۤ۫۫۫ۡ۫ۡۗۥۘ۟ۙۡ۟ۙۨۤۙۧ۫ۡ۫ۦۥۧۥ۠۬ۤۥ۠ۦۙۖۡۢۥۙۨۘ";
                    z4 = z2;
                    continue;
                case 1663206154:
                    String str11 = "ۚۥۦۜۜۡۢۙۘۡۘۨ۬ۖۗۛۖ۫ۧ۠ۧ۠۟ۥۘۗۡۚۢۚۖۘۘۦ۠ۡۥۙ۠ۙۤۦۨ۠ۤۥ۟ۛۧۙۘۙۛۚۤۗۦۨ۫ۛۥۧۢۥۚۗ۬ۚۢۛ۟ۙۚۘ";
                    while (true) {
                        switch (str11.hashCode() ^ (-824533840)) {
                            case -752614040:
                                str = "ۡۢۛ۟ۛۡۢ۬ۖۘ۫ۨۛۚۦۨۢۡۘۛۗۡۘۜ۫ۦۘ۫ۖۘۖۥۚ۟ۦۖۙ۠ۜۘۘۢۡۘۢۚۗ۫۬ۛ";
                                continue;
                                continue;
                            case -150915910:
                                str11 = "ۡۛ۠ۘۦۦ۫ۚۢۥ۟۠ۤۦۦۢۚۧۥۖۗۦۨۡۤۤ۟ۜۘۖۘۨۘۘۚۗۨۗۧۦۘۜۦۖۘۨۨ۟ۖۘۥۘۙۧۨۗۜۦۘ۬ۗۜ۬ۖۖۘۘ۫ۘۘ";
                                break;
                            case 618850398:
                                str = "ۚۚۡۚۤۜ۟ۨۨۘ۟۠۠ۥۨۘۙۧۘۡ۫۟ۚۤۢۛۛ۫۫ۖۘۥۜۨۘۤ۟ۡۘۨۦۥۙۛۛۢ۫۫ۥۥۧۘۖۘ۟ۗۖ۬ۦۜۨۢۨۧۘۧ۬ۘۛۗۢۙ۫ۧۙۜ۟ۧۙۘۘۗ۬ۗۦ۬ۥ";
                                continue;
                            case 1859679134:
                                String str12 = "ۜ۠۠ۥۗۛۡۜۦۚۡۗۗۧۨۘۨۘۡۘۡۖۡۘ۬۟۟ۚۨۥۘ۬ۢۢ۠۬ۥۜۛۥۘۧ۬۬ۧۘۙ۟ۗۖۨۘۢۜۢ۬ۚ۬ۡۘ";
                                while (true) {
                                    switch (str12.hashCode() ^ 1631856247) {
                                        case -2101902189:
                                            str12 = "ۜۛۦۘۦ۟ۦۘۦۖۖۘۤۥۡۘۡۢۢۥۤۦۥۜۥۦۜۘۚۛ۟۠ۤۗۛۖۧ۠ۙ۫ۥ۟ۖۙ۫ۧۗۘۘۨۙۨۤۗۘۘۦۡۗۧ۠۟ۦۧۢۜۨۖۘ";
                                            break;
                                        case -640740636:
                                            String str13 = "ۚۘۡۘۖۗۢ۟ۤۤۙۙ۬۬ۥۥۢۢۗۗۚۚ۫ۨۜۘۚۢۡۘۨۘ۬ۖۖ۫ۥۢۨ۬ۖ۟۟ۤ۫ۗۤۜۜۖۜۙۧۖۘۘ۬ۥۘۡۙۗۗۡۦۘۦ۠ۖ۬ۢۢۢۦۚۥۡۖ۠۠ۙۛۤ۠ۨۚ";
                                            while (true) {
                                                switch (str13.hashCode() ^ (-1290275127)) {
                                                    case -184999088:
                                                        str13 = "ۦ۠ۖۥۖۥۘۡۙۖۖۢۢۛۗۦۘۨۜۛ۠۠ۘۦۧۖۘۙۖۖۘ۟ۛ۬ۛ۬ۘۦۜۜۘۙۨۘۤۜۗۥۚ۠";
                                                        break;
                                                    case 902628922:
                                                        str12 = "ۤ۠ۖۜۦۦۚۖۡ۟ۙۜۛۖۛ۠ۤۨۖۙۜۥۖۙۜ۬ۦۢۡ۠ۨۢۚ۠ۦۤۘۜۜ۬ۙۡ۠ۥۘ۟۫ۦۘۗۚۡۘۙۚۙ";
                                                        break;
                                                    case 1925430842:
                                                        str13 = !z ? "ۨۡۨۘۧ۫ۨۘۙۤ۠ۤۦۤ۟ۜۗۦۙ۟ۥ۬ۛۛۛ۠۫ۨۥۘۧۖۘۘ۫ۙۙۛ۟۟۬ۤۛۥۤۖۡۙۨۖۗ۫ۘۙۚۛ۠ۘۘ۫ۜۨۘۚۘۢۙ۠ۦۘۖ۫ۗۗۚۗۖ۬ۡۖ۟ۨۨۗۖۢ۬ۡ" : "ۤ۬۠ۗۨۗ۫ۙۥۘۘ۟۫ۘۗۘۘۨۤ۫۠ۙۘۘۧۛۛۜۡۙۖۖۘۧۦۤۡۘۦۘۡۙۜۘۖۢۙۘۤۨۘۘۤۥ۬۬ۙ۬ۥۧۨۖۚۙ۟ۨۤۙۥۘۢۡۛۘۙۧ۫۬ۢۧ۫ۤۛۜۚۖۖۘ";
                                                        break;
                                                    case 2036331999:
                                                        str12 = "ۙۚ۫ۜ۫ۜۛ۫ۥۖۤۦۜۙۖۘۖۙۛۜۗۥۘۛۨۜۘۢۙۦۘۚۨۜۘ۟۬ۥ۟ۖۘۖۚۡۚۡ۬ۡۚۙۚۛۦۘۨۜۖۖۘۖۜۥۖۘۢۗۙۙۤۚۦۚۜۘۚ۬ۥۙۛۥ۠ۢۜۨۙۧۡۛۜ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 154490990:
                                            str11 = "ۦ۬ۖۤۦۧۘۛۚۛۧۦۥ۬۬ۥۘۖ۬ۤۧۙ۫ۤۗۘ۟ۗۨۘۧۗۘۨۛۢۡ۬ۖۘۡۢۖۖ۠ۘۘۘۦۜۘ۬ۚۜۜ۟ۦۛۖۛ۟ۖۘۛۖۙۘ۟ۜۘ";
                                            break;
                                        case 1441547337:
                                            str11 = "ۖۤۨۜۥۘۥۙۨۘ۠۠ۘۡۛ۟ۧۖۛۨۖۛۢۚۨۘۙۦ۬ۖۢۗۚۦۧۢۚۛۡۖ۟ۧ۟ۨۘۜۚۗ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 2038020263:
                    iOrdinal = r11.ordinal();
                    str = "ۗۖۙۜۡۜۦ۟ۛۛۦۡۘۙۧ۠۬۟۫۟۠۫۟ۡ۫ۢۢۨۘۜۚ۟ۧۚۛۗۛ۫ۥۨ۟ۦۡۚ۬۬ۥ";
                    continue;
                case 2090190930:
                    str = "ۘۗۨۘۨۗۘۗ۬ۚۚۙۨۙ۬ۤۤۜۙۨۡۗ۠ۗ۬ۥ۠ۢۘ۬ۡۢ۫ۥۘۗ۬ۖ۟ۛۜۘۛۜۥۘۙۨۤۛۦۜۘۧۧۘۘۙۦۦۘۤۗۡۘۗۜۗۘۢ۟";
                    r11 = (Enum) obj;
                    continue;
            }
            str = "۬ۜ۠۠ۢۛۜۜ۬ۥۧۘۥۡۨ۠ۚۜۘۧۘۥۙ۠ۦۘۖۨ۬۟ۘۛ۬ۛۤۘۖ۬۫۠ۡۘ۟ۙ۫ۖ۬۟ۡ۫ۢۙ۟ۦۢۡۥ۠ۤ۠ۨۥۛۜۚۖۘ";
        }
    }

    @Override // p001.AbstractC0176d, java.util.List
    public final Object get(int i) {
        int length = 0;
        String str = "۬۫ۘۤۧۘۘۧ۬ۨۨۚۨۘۖۨۨ۠ۖۨۘۤۤۛۨ۟ۖۦ۠ۥۘ۠ۗۨۖ۠ۨۨۡۚۧۤۘۤۘۥۡ۬";
        StringBuilder sb = null;
        T[] tArr = null;
        while (true) {
            switch ((((((((str.hashCode() ^ 741) ^ 822) ^ 71) ^ 693) ^ 647) ^ 565) ^ 914) ^ 808493660) {
                case -1691747397:
                    str = "ۥۛۙۤۤۥۡۥۘ۬ۛۢۢ۟ۗۜ۫ۦۘۜۖۘۦۧۢۚ۠ۛ۫ۨۜۘ۫ۥۧ۬ۡۧۗ۫ۥۦۚۢۜۛۦۨۡۘۨۖۧۘۗۘ۠۬ۥۜۘۥۨۖۡۘۘۘ";
                    continue;
                case -1468105762:
                    throw new IndexOutOfBoundsException(sb.toString());
                case -1315270228:
                    str = "ۘ۬ۖۘ۟ۚۚ۟۫۠ۚۧۢۗۚۥ۫ۙۖۘۘۨۥۘۙۥۖۦۤۜۧۤ۬ۧۨۘۧۦۙۘۛۢۥۛۦۘۨۙۡۛۦۙۥۦۥۘ۫۟۠";
                    continue;
                case -976660077:
                    String str2 = "ۖۤ۟۫ۘۗۘۤۙ۠ۗۖۘ۬ۘۧۘۖۢۤۢ۠ۥۨۢۖۘۥ۬ۧۜۨ۟۫ۘۧۨۢۦۘۘۢۥۦ۬ۦۚۦۧۢۡۘۥۖۡۤۢۜۘۖۢ۟ۦۧۡۗۘۦۘۛۨۙۜۢۨۘۜۥۛۙۢۚۛ۫ۡۘۥۥۛ";
                    while (true) {
                        switch (str2.hashCode() ^ (-131237127)) {
                            case -1514442895:
                                break;
                            case 157452656:
                                str = "ۖۦۘۘۙۗۥۘۛ۬ۘۖۜۜۗۛۥۘ۬ۘۘۜۤۥۘۢۚۨۢۨۡ۠ۦۗۖ۠ۥۘ۬ۛۦۘۧ۫ۗ۟ۘۨۘۛۜۘۘ۟۠ۢۛۙۥۘۜۜۡۘۢ۬ۥۘۢۖۜۘۤۤۘۘۨۚ۠ۙۤۨۖۘۖۘۙۛۦۘۡۗۘ۫ۙۡۘ";
                                break;
                            case 812931365:
                                String str3 = "۫ۧۘۖ۫۠۫۟۬ۢۙۛۧۖۢ۠ۗۖۖۢۜۗۨۛ۟ۛۛ۠ۧۖ۠ۡۘۨ۬۠ۨۥۡۧ۫ۜۖۘۚ";
                                while (true) {
                                    switch (str3.hashCode() ^ 364086367) {
                                        case -2080816450:
                                            str2 = "ۘۖۡۨۢۗۧۜۙۥۥۢۛۚۦۤۨۥۘۥۗۜۘۖۢۧ۬ۖۡۡۥۙۧۖۘۙ۠ۙۗۦۨۖۥۧ۠ۗ۠ۚۥۨۘۖۛۢۖۙ۟ۧ۠ۘۖۘۨ۫ۢ";
                                            break;
                                        case -1973230070:
                                            str2 = "۫ۜۘۘۤۨ۫ۨۛۖۘۨۧۦۙۡۘۘ۫ۦۙۘۨۚۡۨۙۗۧۢۙۧۥۖ۬ۖۘۘۡۛۗ۟ۛ۬ۤۡۘۘۘۚۡ۬ۤۚۚۚۦۗۢۦ۠ۡۛ۠ۖۘ۠۬ۖۘۖ۟۬۬ۖ۠ۧۥ";
                                            break;
                                        case 1223138696:
                                            str3 = "ۨۤۖ۠ۢۧۥۙۧۖۡۜۘۡۡۡۥۡۘۘ۫ۙۚۨۚۥۦۗۥۘۚۜۘۦ۟ۨۥۡۤۗ۬ۤ۟۬۫ۜ۬ۖ";
                                            break;
                                        case 1851280849:
                                            String str4 = "۟ۙ۟ۢۤۧ۟ۖۖۗۜۜۘۧ۟ۛ۫۬۫۫ۦۖۘ۠ۘۡۚۤۘ۬ۘۦۤۦۜ۟۠ۖۖۥۘۘۤۙۘۛۖ۟ۙۘۧۘۢۛ۟ۦۚ۠ۨۚۛۤۨۦ۠ۤۙۜۘۥۦۤ۠ۥۡ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-281402427)) {
                                                    case -766497862:
                                                        str4 = i < length ? "۟ۤۗۛۗۖۘۙۘ۠ۨۦۢۥۚۜۥۘ۬ۤۦۘۨ۠ۛۚ۬ۥۢ۠ۨۦۚۗ۫ۡ۠۫ۗۡۘۧۗۗ۬۬ۘۙۗ۬۬۫ۗ۬ۨۨۘۢ۫ۥ۟ۙۥۨۢۢ۟ۡۘۥ۫ۢۗ۟" : "۬ۜۘۘۗۖ۫ۧۥۜۡۛ۫ۥ۫ۨۤۢ۫ۛۡۢۙۤۦۘۙۛۨۘ۬ۚ۬ۦۦۦۘۨۨۥۘۗۗۨ۟ۥۢۘۗ۠ۗۛۛۗۨۖۘۢۛۜۘ۟۠ۙۙۛۖۛۧۧ";
                                                        break;
                                                    case -267636098:
                                                        str3 = "ۗۤۖۧۖۦۚۚۤ۬ۜۘۘۨۦۥۗۙۧۨۜۦۢۛۥ۠ۖۘ۬ۚۧۘۖۙۡۧۥۥۛ۟ۥۙۢۢۜۤۦۖ۬ۜۚۢۗ۫ۖۘۨۡ۬ۛۨۗۛۧۡۘۢۥۖۥۨۘۨۤۥۘ";
                                                        break;
                                                    case 604917206:
                                                        str3 = "ۜۨ۟۠ۢ۬ۛۙۥۘۢۨۜۜ۬۟۠۠۟ۛۚۨ۬ۜۥۥۦۜۘۚۚۙ۠ۢۦۛۦ۠ۡۖۨۧۧ۠ۦ۬ۛ۫ۜۦۧۜۥۗ";
                                                        break;
                                                    case 1338888808:
                                                        str4 = "ۧۧۜۙ۟ۖۘۢ۬۟ۨۡۘۥۦۖۘۢۢۙۧۨۥۘۦۥۘۘۧۙۛۦ۫ۦۖۚۧ۠۟ۤۗۤۜۘۗۘۘۚۙۨ۬ۦۛۙۡ۬۟ۤۦۘۘ۟ۖۚ۫ۘ۟ۖۦۨۖۖ۬ۡۘ۬ۜ۫";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 1450067437:
                                str2 = "ۧۡۡۘۛۚۖۘ۫ۦۤ۬ۨۚۦۨۢ۬ۘۛ۬ۥۖۘۤۨۙۘ۠ۤۡۚۡۘۖۨۤۛۚۗۤۦۘۥۗ۟ۢۖۢ۬۫۫ۥ۟ۚۦۤۚۙۜۥۛۗۙ۟۬ۖۘ";
                                break;
                        }
                    }
                    break;
                case -730921351:
                    sb.append(i);
                    str = "ۢۚۡۧۘۢۡۙۢ۫ۜۘ۟ۡۦۜۤ۬۬ۧۡۘۤ۟۠ۙۧۡۘۙۚۥۖۧ۟ۚۗۙۤۨ۬ۗۚۘۘ۟ۨۧۘۦۡۦۘۦ۫۠ۤ۠۠ۜۨۦۚۡۖ۟ۥۘۢ۬ۦۥۡ۠۟۠ۙۦۘۘۦ۫ۙۧۧ";
                    continue;
                case -487309506:
                    return tArr[i];
                case -364004005:
                    sb = new StringBuilder();
                    str = "ۢۨۥ۠ۡۜۖۦۜۗۜ۬ۙۜۘۘۦۦۜۘۛۗۡۦۙ۠ۤۥۗ۠ۛ۠ۢۙۘۘۦۤۥۛۨۘۘۛۤۘۘۗۖۜ";
                    continue;
                case 118954750:
                    sb.append(length);
                    str = "ۤۖۥۚۙۖۖۚۙۙۨۘۘۛۥۛ۫ۖ۟ۨۨۢۖۧۗ۠ۢۡۘۖ۠۟ۦ۫۫ۢۡۖۘۧۡ۬ۢۡۘۨۜۢۢ۠ۖۤۢۜ۠ۚۘ";
                    continue;
                case 318323389:
                    str = "ۢۚۛۨۤۛۜۦۚۗۚۛۙ۠ۨۘۖۧۚۛۘ۫ۦ۟ۜۗۤۘۘۥ۟ۘۘۥۘۦۜ۟ۖۜۨ۬ۖۘۥۛۜۖۧ۟ۥۦۘۘۥۘۧۘ";
                    tArr = this.f1039;
                    continue;
                case 591821358:
                    String str5 = "ۤ۫ۨۘۡۢۙۤۜۘۘۚۙۙۚ۟ۛۛۗۖ۠۠ۥ۬ۤۙۘۗۥ۠ۜ۠ۛۗۢ۟ۡۦۦۙ۠ۦۚۗۙۤ۫ۜۘۧۧۚۜ۠ۦۜۧۡۘۢ۬ۧۛ۠ۙۦ۬ۘۘۤ۫ۗۡ۬ۜ";
                    while (true) {
                        switch (str5.hashCode() ^ (-298099529)) {
                            case -1616931198:
                                str5 = "ۨۗۥۡ۠ۗۘۙۤۚۚۥۤۙۘۗۚۦۡۤ۫ۡۖۘۗۗۡۜۢۙۜۥۦۜۚۥۘ۟ۡۛۢۜۨۘۨۘۢ";
                                break;
                            case -374661498:
                                String str6 = "۬۬۬ۡۨۢۨۜۡۘۧ۠ۥۘۙ۟ۜۘۚۙۘۤ۫ۛۦۧۗ۠ۗۙ۟ۛۧ۟ۡ۬ۛۧۜۘۤۜۡۘۗۡ۟۬ۘۢۚۦۨۘۗۨ۠ۙۚ۟۠ۥۚ۟ۛۘۘۖۡۖۘ";
                                while (true) {
                                    switch (str6.hashCode() ^ 1378323566) {
                                        case -817362365:
                                            String str7 = "ۢۜۖۚ۫ۗۧ۬ۛۛۗۧۗۘۨۘۥۢ۟ۢۤ۬ۛۖۡۗۧۥۘۙ۬ۤۨۖۜۛۘۖۚۗۥۨ۬ۢۚۥۖ۠۟ۘۤۙ۫ۨۖۤۡ۬ۘ۟ۖۡ۠۫ۛۜ۬ۨۚۡۙۛۛۛ";
                                            while (true) {
                                                switch (str7.hashCode() ^ 1371761338) {
                                                    case -1132218077:
                                                        str6 = "ۤ۬۟ۨۜۛۡ۫ۤۙ۬ۜۦ۫ۖۘۘ۬ۡۘ۬ۙۧۖۙۥۙۥۨۙ۫۬۠ۧ۠ۙۚ۠ۤۦۛۛۜۛۤۗۙ";
                                                        break;
                                                    case 618404145:
                                                        str6 = "ۖۖۧۡۖ۠ۚۙۥۘ۠ۥۤۙۜ۬۬ۖۜۘ۬ۧۗۥۙۗۘۡۚۢۧۦۜۜ۠۟ۚۖۘ۫۠ۚ۟ۢۖۘۦۥۘۘ";
                                                        break;
                                                    case 1189555769:
                                                        str7 = "ۡۦۘۘۛ۟۫ۖۦۘۜۚۨ۠۫ۚۢۥۖ۠ۖۥۛۦۘ۫ۥ۠ۡۛ۬۫ۡۘۘۖۨۜۘ۫ۨ۫۠ۙ۫۠ۘۥۘ۟ۥ۬ۧۛۘۘۘۛ۟ۡۧۥۘۖۢۨۘۨ۬ۙ";
                                                        break;
                                                    case 1755819943:
                                                        str7 = i >= 0 ? "ۜ۬ۖۘۤۜۨۜۧۡۘ۫ۧۘۘ۟۫ۤۖ۫ۡۘۚ۠ۨۘۗۦۦۘ۫ۥۙۘۡۨۧۨ۬ۦ۫ۗۗۤۥ۟ۦۡۘۗۛۗ" : "ۜۨۢۙۖۗۙۗۨۘۤ۠ۖۘۦۡۜۘۛ۬ۘۢ۟ۥۤۧۘۗۖۦۤ۟ۧۗۘۛ۠ۘۗۗۨۘۥ۬ۥۘۥۨۧ۠ۘۘۛۗۖۘ۫ۙۥۘۧ۫ۨۖۗ۬۬۫";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -574976628:
                                            str5 = "ۗۥ۟ۜۢۘۢ۫ۢۖ۫ۤۦۘۘۘۧۙۙۖۦۘۙۙۖۘۧۘۥۧۦۧۜۙۦۘۧ۟۬۬ۘۡۘۖ۠ۥ۟ۤ۟ۧۡۛ۟۫۬ۛۢۘۡۥۗۚۤۧ۠ۖ۠";
                                            break;
                                        case -402137946:
                                            str6 = "ۢۢۚۡۘۨۜ۫ۢۥۡۧۘۦۥ۫ۥ۟ۡ۬۟ۥۗ۠ۜۖ۫ۨۘۛۤۦۨۘ۬ۙۡۡۗ۠۫ۜ۠ۢۛۖۘۘۧۡۡۙۡۘ۠۬۫ۢۖۨۘۥۧ۬ۗۢۘۘ";
                                            break;
                                        case 1903135591:
                                            str5 = "ۤۧۤ۟۠ۙۡۛ۠ۤۨ۠۟۟۬ۤۡۧۜۘۘ۠۠ۜۙ۟۠ۧۜۦۥۤۨۘ۬ۘۖ۟۫۟ۙ۟ۤۥ۫ۛ";
                                            break;
                                    }
                                }
                                break;
                            case 971972891:
                                str = "ۧۖۡۘۘ۫ۙ۟ۜ۬۟ۤ۟ۢۨۧ۬ۙۖۥۙۥ۠ۘۡۦۤۦۘۨ۬ۜۥۨۤ۫ۦ۬ۡۤۛۡۚۦۘۢ۠ۢ";
                                break;
                            case 1243476838:
                                break;
                        }
                    }
                    break;
                case 784926304:
                    sb.append(", size: ");
                    str = "ۛۗۙۘۜۖۜۛۨۖۘۢۡ۟ۜۘۚۧۦۘۛۥۜۘۛۗۘۤۜ۫ۖۚۤ۟ۜۜۡ۬ۥۛۙۡۘ۟ۡۢ۟ۡ۟ۛۢۨۘ۠ۗۖۘۘۢۨ";
                    continue;
                case 1031137209:
                    sb.append("index: ");
                    str = "ۨ۠ۘۛۥ۟ۚ۠ۘۘ۟ۧۚۦۨۡۗۧۡۘۥۥۥۘۨۗۥۘ۟ۘ۫ۧۥۥۘۚ۠ۖۥ۠ۛ۬ۧۚۙۨۖۚۙۢۦۨۜۘۤ۫ۖۤۤ۠ۥۘۜۤ۟ۧۜۢ";
                    continue;
                case 1699727512:
                    str = "ۡۜۤ۠ۘۡ۠۬ۡۗۧۛۡۢۡ۠ۡۢۥۙۗۤۥ۬ۘۛۚ۟ۙۙ۫۫ۨ۫ۗۥۘۛۖۨۥۚۧۛۨ۠ۜۘۡۥۥۘۙۤۧ۟ۖۘۘۛ۫ۨۦ۠ۥۘ";
                    length = tArr.length;
                    continue;
            }
            str = "۠۫ۘۡ۟ۖۘ۟۫ۖۜۛۘ۟ۜۧ۟ۛۥۘ۫۠ۢۖۜۙۚۨ۟ۢۢۘۘۥۢ۬ۖۛۤۚۚۡۘۧۥ۟ۧۜۧ";
        }
    }

    @Override // p001.AbstractC0176d, java.util.List
    public final int indexOf(Object obj) {
        boolean z = false;
        int i = 0;
        Enum r11 = null;
        int iOrdinal = 0;
        T[] tArr = null;
        T t = null;
        T t2 = null;
        T t3 = null;
        int i2 = 0;
        int i3 = 0;
        String str = "ۧۧۦۘ۫ۧۗۡ۫ۢۨۙۥۢ۫ۜۘۨۢۡۙ۫ۘۛ۠ۘۙ۠ۨۛ۠ۘۘ۫ۥۡۘ۠۟ۢۦ۟۟ۛ۟ۡۜۤۦۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 426) ^ 860) ^ 0) ^ 669) ^ 874) ^ 878) ^ 139) ^ 903615236) {
                case -1902428732:
                    str = "ۤ۬ۚۖ۫۫ۛۛۘۘۖۙۦۥ۬ۨۘۡۜۚۢۡۘۘۨۡۚ۫ۛۖۘۨ۟۫ۥۥۖۘ۟ۛۡ۟ۥۖۘ۬ۗۘۘ۬ۗۙۤ۠ۡۡۨۧ۫ۢۡۘ";
                    r11 = (Enum) obj;
                    continue;
                case -1832370517:
                    str = "ۦۥۙۚۨۛ۫ۚۘۘۧۗۨۗۤۖۛ۟ۡۦۤۛۢۨۘۙۜۨۘۘۚۥ۬ۧ۬ۘۖ۟ۜۨۦۘۥ۠ۖۘۖ۟ۛۦۛۢۥۥ۠ۖۧۚۛ۫ۜۨ۫ۧۥۦۗۧ۠ۛۘۢۜۢ۬ۙ";
                    continue;
                case -1779468054:
                    str = "۠ۨۦۘ۟ۚۢۦۗۖۘۜۛۧ۟ۢۡۗۜۚۗۨۥۘۤ۫ۨۘۧۙۥۘۤۡۦۘۥۡۨۘ۠ۧۚۖۛۖۘۡۗۦۘۥۚۜۘ";
                    i3 = i;
                    continue;
                case -1422085063:
                    String str2 = "۫ۢۨۘۚۧۖ۟۫ۢۖۥۨۚۙۚۙۙۛۨۦ۟ۨۘۦۥۛۢ۟ۛ۫۬ۧۤۚۖۨۢۛ۟ۗۦۨۗۢۗۘ۬ۖۘ۬ۗۢ۠ۥۙۦۢۘۘ۫۫ۜۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 1949965975) {
                            case -890107626:
                                str = "ۡۛۘۦۙۜۘ۬ۤۘۘۨۗ۠ۦۗۨۘ۟ۙۦۡۛۦۡۥۢۧ۬۟ۖۤۡۙ۠ۜۘۙ۠ۤۗۛۘۤۧۧۧۤۦۦۚۥۘۙۛۖۗۚ۫۬ۡۤۘۧۨۘ۠ۖۘۙۧۨۘۙۙ۟ۖۚۧ";
                                continue;
                                continue;
                            case -646211827:
                                str2 = "۫ۧۜۘ۟ۚۢۧ۬۫ۡۙ۬ۨۧۧ۫۟۬ۜ۫۬ۖ۬۫ۢۜۨۘۧ۬۬ۖ۟۬۟ۧۘۥۖ۠ۜۗۥۘۦۘۘ۠ۨۚۘۦۗۡۥۖۢۧ۠ۙۨۘۢ۬ۜۘۡ۠ۖ۬ۥۢ۠ۤۡۜۜۦ۫ۤۜۤۗ";
                                break;
                            case 367654643:
                                String str3 = "ۙۜۧۚۘۧۤۡۛۛۗۧ۠۬ۛۙۘۘۙۜۚۙۧۨۡۛۢ۠۟ۧۡۙ۟۬۠ۘۘۤۖۦۘ۫۫ۘۘۤۤۘۡۙۨۘ۟۠ۢۤ۫ۥۧۤۙۛۦۖۘۧۚۢ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1776489963)) {
                                        case -1722441002:
                                            String str4 = "ۜۜۛۧۢۗۨۜ۬ۙ۠ۧۜ۠ۨۘ۠ۨۘۖۚ۠ۙۛۜۘۛۘ۠ۥۘۧۘۙ۬ۜۘۚۘۤ۫ۖۘۧ۟ۢۘ۠ۤۤۜۨ۟ۢۦۘ۫ۚۥۘۦ۫ۦۤۨۦۜ۬ۖۗۢۧۨۡۖ۟۟ۨۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 539311008) {
                                                    case -1987851581:
                                                        str4 = "ۤۨ۠۠ۘ۫ۧۥۥۚۜۘۨۛ۫ۢۚۚۢۘۢۨۤۥۘۚۡۢ۬۫ۥۖۦۖۘۙۜۚۖۥۨۖۚۨۘۧ۠۬ۖۡۖۡۤۜۘ۟۟۫";
                                                        break;
                                                    case -1616280010:
                                                        str3 = "ۥۚۡۘۨۖۢۛۙ۠ۢۘ۫ۛۧ۬ۨۡۘۦۨۢۢۢۥۗۨۘۘ۬ۙ۟ۢۜۗۥۚۙ۬ۡۥۙۡۘۘۧۛ۠۠۠۟ۨۙۚۙ۠ۨۘ";
                                                        break;
                                                    case -854173833:
                                                        str4 = t3 == r11 ? "ۧۦۢۦۧۦۥۚۧۨۜ۬ۨۖۖۘۚۥ۟ۦۢۥۘۙۛ۟ۛۢ۫ۧۛۨۦۡ۠ۨۖ۫ۤۡۦۦۡۘۢۤۚۙ۟ۥۘ۟ۥۦۘۛۨۛۨۨۢۦۜۨۘۛۘۧۘ" : "ۢۤ۬ۜۗۙۚۖۧۘۦۧۢۘۚۢۖۖۜۘۢ۬ۚۖۘۘۘۙۢۜۘ۫۬ۨۤ۠۫۬ۙۡۛۜۛ۬۠۫ۨ۟ۥۢۛۡۗ۬ۘۘۗۢۜۘ۠ۙۛۧۛۖۨۜۘۦۖۘ۬ۨۦۘۨۢ۠";
                                                        break;
                                                    case 1098938480:
                                                        str3 = "ۡۜ۠ۢۛۨۜۚۜۘۤۖۡۘۘۛۚۧۢۤۚۡ۬ۥۦۧۜۤۨۧۘۜۘۧۚۡۘۤۖ۬۬ۧۗۢۡۘۥۖۧۙۜۥ۬۬ۙۧۢۖۡۨ۫ۨۥ۬ۢۚۦۘ۟ۧۢ۠۫۟ۡۨ۬ۗۨۜۗۡۚۚ۟";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -443179385:
                                            str2 = "ۙۜۜۖ۟۫ۜ۬ۖۘۨۜۖۜۡ۬ۙ۫ۘۙ۠ۢۦۖۨۨۗۖۦۢۜ۫ۨۡۢۙۘ۠ۥۘ۫ۜۨۤۙۙۖ۟ۛ۟ۜ۟ۜۤۗۢ۫ۙۢ۠ۦۘۗۚۥۧۘۜ۟ۛۛۦۙۙۘۦ۬ۡۧۥ۠ۜۖ";
                                            break;
                                        case 98091960:
                                            str2 = "ۚ۫ۨۘۛ۫ۡۘۥ۫ۦۦۖۧۤۦۘۘۜۥۘۘۘۦۨۘۧۡۘ۫۠ۡۘ۟ۦۙ۠۟ۨۘ۠ۙ۟ۦۥۡۜۖۥ۟ۤۢۖ۠۬ۘۦۥۘۢۨۛۦۜۨۘۤ۬۫ۤۢۖ";
                                            break;
                                        case 662218475:
                                            str3 = "ۨۦ۠ۗۡۡۘۖۘۙ۫ۙۙۚۡۧ۫۟ۢ۟ۗۢۗ۬ۘۙۚۨۘ۠۟ۨۘ۠ۛ۬ۗۥ۫ۗۜ۟ۨۤۥۗ۫ۚ";
                                            break;
                                    }
                                }
                                break;
                            case 1791242989:
                                str = "ۢۚۦ۟ۛۚۤۗ۠۠ۚ۫ۦ۬۬۬۟ۘۘۖۤۤۜۦۦۢۖۥۘۥۛۨۗۖۦۘۤۧۖۗۗ۬ۜ۠ۖۦۦۦۧۨۥۧۘۛ";
                                continue;
                        }
                    }
                    break;
                case -1399357372:
                    str = "۫۬ۛۘۥۡۘۨۛۚۥۧۘۘۜۚۚۨۦۘ۠۫ۦۤۥۥۡ۟ۤۥۦۘۛۚۘۖ۫ۗۨۧ۬ۜۛۗۢ۠";
                    i2 = iOrdinal;
                    continue;
                case -1130659031:
                    tArr = this.f1039;
                    str = "ۚۜۨۘ۠ۘۤۜ۫ۤۚ۟ۦۨ۬ۘ۫ۥۜۦۡۘۤۜۚ۬ۨۜۗۨۖۚۨۧ۬ۥۘۘۚۙۡۚۛۛۥۙ۬ۛۦ۬ۛۘۡۘۦۛۤۤۧ۟ۖۗۖۘۤۧۚۥۡۤ۠ۖۥۘ۬ۡۜۦۛۥۘۧۚۙ۟ۧۖ";
                    continue;
                case -921101322:
                    str = "۟ۡۡۖۨۜۘۚۚۖۢۗۚۨ۠ۨۙۖۙۛ۠ۥۘۨ۟۟ۤۜۘۥۙ۟ۥۗ۫ۘۜۦۘ۠ۚۜۧ۬ۛ۠ۜۖ";
                    continue;
                case -180460284:
                    C0237h4.m1090("<this>", tArr);
                    str = "ۥۗۧۧ۫ۖۘۘۤۡۘۢۘ۠ۦۚ۠۫ۧۛۡۘۧۘۤ۟۬ۡۚ۬ۤۧ۬ۘۤۦۤۖۧۘ۠۫ۜۘۦۜۜۙۢۦۘۡ۟ۥۨۥۤۖۖۚۥۘۗ۠ۥۘ";
                    continue;
                case -55080157:
                    t = tArr[iOrdinal];
                    str = "ۜۖۡۤۛۖۘ۟ۜۜۛ۟ۚ۠ۚۢۚۜۛۨ۫۫ۚۙۗ۠ۡ۠۟ۚۚۡۦۗۗۜۥۧۡۘۦۛۦۙۚۛۘۢۚۖۘۢ۟ۦ۠";
                    continue;
                case -29465880:
                    str = "ۙۙ۬۬ۥۜۢۧۛ۟۫ۙۡۧۡۖۡۢۚۘۗۙ۫ۢۜۥۡۘۚۘۤۙۜۚۚۥۢۢۜۘۡ۫ۦۘ۫ۗ۫ۦۢۥۧۢۜۘۖۨ۬ۙۘۘۛۗۙۙۜۜۘۡۧۤۦ۬ۚۙ۟۟۠ۘۨ۠ۡۗۥۤۗ";
                    t3 = t;
                    continue;
                case 264600241:
                    String str5 = "ۧۚۜۤۜۦۘۢۧۧۢ۟ۙۢۦۧۘ۫۬ۘۘۡۖۜۘۤۦ۠۠۫۬ۖۡ۠۫۟ۧۥ۬ۘۘۥۚ۬۬ۙۥۘۘۥۖۘۘۜۨۤۖۛۘۥۜۘ";
                    while (true) {
                        switch (str5.hashCode() ^ 2737942) {
                            case -1592678354:
                                String str6 = "ۧۛۜ۠ۚۗۛ۠ۖۘۛۗۥۘ۠ۗۦۨۢۘۨۚۥۘۨۤۤۡۘۘۤۨۥۛ۟ۦ۬ۥۦۘۜۗۚۢ۠ۘۧۢۜۧۧۥۘۘۡۥۘ۬ۘۛۘ۠ۙۚۛۖۤۚ";
                                while (true) {
                                    switch (str6.hashCode() ^ (-213794389)) {
                                        case -821447580:
                                            str5 = "ۛۜۘۡۧۤۙ۠ۙ۫ۥۤۨۜۢۤۨۤۡۥۘۗۡۗۗۢۢۛۛۗۛ۬ۘۗۛۦۜۨۘۨۘۦۢۚ";
                                            break;
                                        case 532899027:
                                            String str7 = "ۚۤۨۘ۬ۦۤۗ۟ۡ۫ۢ۫ۦۜۘۛۚۜۢۧۚ۫ۤۘۘۢۜۖۦۥۚۘۡۘۘ۟ۥ۬۫ۗۖ۟ۨۨۚ۠۫ۜۗۦۢۙۦ۫ۜۘ۟ۦۖۖۗۘۖۜۡۥۦۧۘۤ۫ۛۢ۫ۚ۠۟ۖۗۢۥۖۘ";
                                            while (true) {
                                                switch (str7.hashCode() ^ 714429860) {
                                                    case -1848914306:
                                                        str6 = "ۧ۠ۧ۬ۡۨۘۦ۟ۜۧۘ۫۟۟ۜۘۢۗۖۘۤۜۜۚۨ۬ۖۗ۠ۗۙۙۜ۠ۗۦۨۘ۬ۡۢ۬ۤۢۤۗۡۦۡۤۖۖ۬۬ۗۗۖۚ۟ۜۤۦۘۙۗۗۗ۬ۥۛۢۡۘۙۘۛۖۥ۠۠ۗۚ۫ۚۦۘ";
                                                        break;
                                                    case -1182616402:
                                                        str7 = "ۤۜۦۜۘۡۘۚۦۘۥ۟ۗۖۥۡۥۦۥۘ۠۫ۖۘۨۢۙۤۘۨۘۚ۠ۖ۠ۚ۟ۧۜ۬۬ۖۨ۫ۙۘۚۗ۠";
                                                        break;
                                                    case -674940134:
                                                        str7 = !z ? "ۗۨۦۖۖۡۘۤۡۦۢۡۜۘ۠ۖۜۘۗ۫ۨۘۗۘۖۚۦۜۦۙۛۗۤۚ۫۟ۚۚۦۦۢۨۢۢ۫ۗۘ۫ۙۚۢۜ۟۬ۘۘ۠۟ۤۚۜۖ۠۠۫ۦۧۡۘۡ۬ۦۘۤۘ۠" : "ۜۚۥۘۖ۠ۨۘۜ۠ۨ۫ۖ۟۟ۚۜۘ۠ۦۜ۟ۡۜۘۚ۬ۜۦۥۥۘۡۡۨۘۢۧ۬ۖۛۨۤۘۥۦ۠ۢۚۢۙۤ۟ۖۘۘۛۨۖۚۖۘ";
                                                        break;
                                                    case 545907443:
                                                        str6 = "ۜۦۗۙۜۖۜۚۧۜۜۜۖۤۘۘ۠۠ۖۘ۬۫ۢۜۗۢۜۛۜۘ۟۟ۢ۫۠ۥۥۛۜۜۜۧۘۢۨ۬ۘ۟ۜۛۜۤۘ۫ۡۜۚۥ۟ۘۙ۬ۦۗۡ۬ۡۧ۟ۥۘۧۨۜۡ۠ۢ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 643101931:
                                            str6 = "۟۫ۗۤۢۨۘۧۗۖۚۗۛۧ۬۟ۗۡۘۜۤۡۘ۬۬ۙۜۘۡۢۦۘ۫۬۬۟ۧۥۘ۟ۥۘۦۦۛۘۧۚ۫ۘۜۘۦۘۨ۠ۖۘۨۥۛۨۦۤ۫۠۫";
                                            break;
                                        case 1524805106:
                                            str5 = "ۦۤۦۢۘۨۨ۠ۛۛۗ۬۠۟ۨۤۨۨۥ۟ۢ۟ۨۘ۟ۧۛۖۗۜۧۡۨۘ۠ۥۘ۟۟۠ۗۦۙۛۡۤ۠ۡۡۘۨ۫ۖۘۜۗۨۘ";
                                            break;
                                    }
                                }
                                break;
                            case -1500785103:
                                str = "۠۟ۦۥۗۨۘۖۢۙۥۦۗۢ۫ۛۦۚۗۛ۟ۖۗۨۖۨۚۥۦۖ۠ۙۡۖ۬ۚۦ۫ۦۥۢ۫ۦۚۖۘ۬ۨ۬۟۫ۜۘۗۥۘۜۥۛۦۢۥۢۦۨ۫ۜۜۚۘۤۢۛۙۧۚۡۖۧۢ۠۫";
                                continue;
                            case -939577202:
                                str = "ۡۘۗ۫ۗۥۘۖۗۦۦ۠ۖ۬ۘۥۜۦۘ۫ۢۖۘ۟ۨ۠ۘۨ۠ۙۗۘۘۜۦۧۙ۟ۚ۠ۡۛۗۦۢ۬ۜۜۘۤ۬ۙۤۖ۟ۦۖۛۖ۬ۖۘۗ۬ۤ۬ۥۧۤۗۜۡۗۛۛۘۘ۠ۜۤۙۥۘۘۛۥۧ";
                                continue;
                                continue;
                            case 1496670626:
                                str5 = "ۚۦۘۘ۫ۜۤۖۥۤۥۛۥۘۜۥۡۘۗۗ۟ۘ۠۠۫ۚۥۘۤۙۦۘۙۡۘۜۛۢۡ۫ۡۖۡۘۜۘۡۘۦۢۙۤۤۡۘۚۥۧۘۙ۟ۙ";
                                break;
                        }
                    }
                    break;
                case 301530241:
                    z = obj instanceof Enum;
                    str = "ۜۦۖۘۤ۫ۛۨۚۚۢۘۧۘۘۦۘۘۚۘ۟ۖ۟۫ۨۢۢۘ۠ۗ۠ۢۙۜ۫ۨۛۛۤۚۥۘۨۤ۫ۢۦۢۢ۫ۨۡۚۦۘۖۖۧۨۛۨۚ۟ۚۘ۠ۘۙۖۤۙ۬ۚۨۦۡۜۗۤۛۚۜۘ";
                    continue;
                case 311069196:
                    String str8 = "ۨ۟ۡۘۢ۠ۖ۬ۙۡ۠۟ۡۘ۟ۦۢۛۤۨۛۚۥۗۜۘۚۤۢۤۤۜۘۢۦۘۧۡۘۤۧۡۘۤۢۦۡ۬۬ۙۦۦ۫۬ۚۚۢۜ";
                    while (true) {
                        switch (str8.hashCode() ^ 915595147) {
                            case -989791123:
                                break;
                            case 612061284:
                                str8 = "ۨۛۥ۫ۤۡۘۥۛ۫ۚۧۨۘۡۧۤ۟ۙۖ۠۠ۜۖۧۜۘۨۥۨۖۡۥۘۧۜۨۘۙۙۜ۠۬ۦۖ۬ۗۨۗۡۛۛۡۘۘۘ۠ۦۚۖۚۘۜ۬ۚۤۛۙۖۦۡۨۨۘۥۛۦ";
                                break;
                            case 1711769727:
                                String str9 = "ۘۛۡۘۡۢۦۤ۫ۥۥۨۦۘۜۤۢ۠ۜۗۦۨۨۘۘۦ۫۬ۦۢ۟ۨ۠ۡۗۘۨ۟۬ۥۢۦۧ۟ۡ۠ۥ۬ۦ۬ۢۡۥۦۘۘۨۦۘۘ۬ۨۘۦۘۖۘۨۖۨۘۖۡۜۢۗ۫۫ۧۙۢۘۖۘۧ۟ۛۡۙۖ";
                                while (true) {
                                    switch (str9.hashCode() ^ (-62969901)) {
                                        case -1180733971:
                                            str8 = "ۦۘۧۘۘۡۡۙۖۥۘۨۜۖۗ۬ۤۗۨۧۘ۟۫ۧۛ۟ۡۘۜ۟ۨۘ۟ۨۚ۟ۘۧۨۜۧۘۧۥۥۜ۬۠۠ۜۥۘ";
                                            break;
                                        case -453060713:
                                            String str10 = "ۗ۬ۤۚۡۖۢۖۤۗۤ۬ۡ۫ۗۖ۬ۜۡۥۘۤۜۧۜ۟ۜۦۡۘ۫ۡۘ۟ۤۨ۟ۚ۟ۘۡۛۡ۫ۧۛۘۤۜۧۛۤۖۘۢۖۨۘۚۜۨۘۗۧۦۘ";
                                            while (true) {
                                                switch (str10.hashCode() ^ (-1382828362)) {
                                                    case -924759529:
                                                        str9 = "ۦۘۨۘۧۗۜۘ۬ۢ۬ۛۦۗۘۜۦۤۥۡۡۜۤۨۤۧۦ۬ۘۘ۫ۤۜۥۖۙ۠ۜ۠ۡۚۧۤۙۥۘۜۨۜۗ۬ۨۘ۫ۙۛۧۦۘ";
                                                        break;
                                                    case -574926248:
                                                        str10 = iOrdinal >= 0 ? "ۘۢۗ۬ۤۘۘۖۚۙ۫۠ۙۛ۟۟ۖ۫ۘۘۙۡۤۧۘۦۘۜ۠ۛۢ۬ۛۤۘۚۖۨۘۗۥۨۘۘۖۖۡ۠ۡۘۧۜۘۘ۫ۗۨۘۘۚ" : "۬ۗ۬ۘۙۡۘۧۦۦۘ۟ۘۘۘۖ۟ۚۚۚ۟ۚۖۘۘۡ۬ۥۘۨۢۚۚۧ۠ۚۘۡۘ۬۠ۦۘۚۥۘۘۥ۬ۥۘ۫۠ۜۘ۠۫ۜۘۜۧۘۘۢۚۥۘ";
                                                        break;
                                                    case -376058384:
                                                        str10 = "ۢۥۨۦ۫ۘۢۦۘۛۥۘۜ۫ۡۘ۠۟ۙۡۧۥۘ۠ۙ۬ۦ۟ۙۨۤۡۚۨ۫ۨۧۦۘۦۨۨۘ۬۠ۘ۟ۨۡ";
                                                        break;
                                                    case 578823706:
                                                        str9 = "ۛۤۜۘۤۖۛۛۦۨۚۗۛ۬ۖ۫ۤۦۘۗۚۦۨۙۨۘ۟ۖۧۘ۬ۜۦۘۧ۠ۡۘ۫ۘ۫ۚۥۨۘۧ۟ۜۖۥۨ۠ۦۙۨۦۖۘۢۤۥۘۥۜۢۖۗۥۘۧۗۚ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -184396397:
                                            str9 = "ۚۗۖ۫ۧۤۖۨۡۡۗۦۡۜۨۚۨۘ۫ۛۦۦۜۜۘۛۧۦۘ۫۫ۨۘۦ۟ۜ۬ۚۨۚۢۦۘۨ۠ۖۘۡۢۥۘۦۗۡۡۙۚ۬ۜ۠۫ۡۙۥۦۤۧۖۧ۫ۘۨ۠ۢۛۢۜۥۘۗ۬ۗ۟ۜۡۡ۠ۨۘ";
                                            break;
                                        case 536779546:
                                            str8 = "ۡ۫ۨۘۦۦۨۧۜۧۘۚۚۘۘۢۧۚۧۖۖۘۧۛۨۘۧۙ۠۬ۚۨۘۗۢۙۤۨۥۢۘۚۥۧ۬ۤۙۥۡۦ۬";
                                            break;
                                    }
                                }
                                break;
                            case 1775333939:
                                str = "ۥۙۖۘۧۤۡۘۤۜۜۘۤۘۢۗۘ۟ۛۧۤ۬۟ۦۤۖ۟ۢۦۗ۫ۙۤۥ۫ۨۤ۬ۙۧۢۡۚۘۘۙۖۦۘۛ۠ۥۚ۟ۜۘۖۚۖۙۧ۠ۦۨۚۜۚۧ";
                                break;
                        }
                    }
                    break;
                case 427331992:
                    str = "۟ۡۡۖۨۜۘۚۚۖۢۗۚۨ۠ۨۙۖۙۛ۠ۥۘۨ۟۟ۤۜۘۥۙ۟ۥۗ۫ۘۜۦۘ۠ۚۜۧ۬ۛ۠ۜۖ";
                    t3 = t2;
                    continue;
                case 977756474:
                    return i3;
                case 984735495:
                    str = "۫ۦ۟۟ۢۜۙۚۥۘۜۥۘۜۨۘۛ۬ۨۘۘۦۨۤۨۧۚۛۜۘۙۤۧۙۤۘ۠ۤۜۦ۠ۦۘۜۛۘۘۦۘۧۚ۟ۙۜۖۛۡ۟ۨۘ";
                    continue;
                case 1058749643:
                    t2 = null;
                    str = "ۜۦ۟ۧ۠ۖۢۧ۠ۛ۬ۧۡۘۖۘۤۢۡۘۨۚۧۥۨ۠ۖۥۢۖۖۘۨۦۗ۫۬ۙۗۙۜۘۙۘۦۙ۬ۥۤۗۚۚۤۙۤۢۛۧ۟ۧۢۦۡۦۡ";
                    continue;
                case 1401298265:
                    String str11 = "ۘ۫۫۟ۡ۫ۘۨۢۦۡۘۙۛۨۘۖۤۚ۫ۛۦۢۡۖۘۗ۠ۚۨۖۘۚۢۜۘۜۦۤۦۦۗ۠۫۠ۥۡۨۘۛۜۜۙۚ۫ۙ۫ۧ";
                    while (true) {
                        switch (str11.hashCode() ^ (-1070875834)) {
                            case -1642666402:
                                String str12 = "ۨۜۘۘۧ۟ۙۦ۬ۙۢۡۨۘ۟۠ۦۘۚۢۗ۟ۙۥۗۖۡۖۚ۟ۡۖۥ۟۫ۦۘۖۧۤۨۤۙ۬ۚۨۘۜ۟ۨۙۦۘۦۨۨۘۡۧۥ۟۠۬ۧۖۧۚ۬ۦۢۙۦۚ۬ۘۤۢۚ۬ۢۢ۟ۜۚۡۦۙ";
                                while (true) {
                                    switch (str12.hashCode() ^ (-1271151755)) {
                                        case -2058867576:
                                            str11 = "ۙ۟ۢۧ۠ۨۢۢۤۜۛۜۘۧۘۘۥۦۖۘ۫ۢۘۘۗۧۢۗۧۡۘۚۧۖۖ۬ۙۤ۠ۥۛۨ۫ۤۥۘۘۜۛ۠۠ۧۥۜۥۧۡۚۜۥۥۡ۬ۘۢۥۛۗ";
                                            break;
                                        case -994725598:
                                            String str13 = "۫ۗۢۤۡۨ۫ۥۚۚۡ۬ۗۗۦۘۚ۠ۨۛۗۙ۬ۦۗۘۦۛۢۗۘ۫ۦ۠۬ۘۢ۟ۧۡۚۨۚۤۚ۟ۖۥۖۖ۟ۜۘۗۘۢۜۡۤۦ۬ۖ۟۫۠ۧ۟ۜۖۧۡ۬ۙۥۘ";
                                            while (true) {
                                                switch (str13.hashCode() ^ 563096063) {
                                                    case -1513107101:
                                                        str12 = "۫ۜۛۡۥۧۘ۫ۤۥۦ۠۟ۗۜۥۘۥ۠ۧۖ۟ۛۗۢۤۤۚۡۢۚ۠ۨۖۧۘۛۗۥۘۥ۠ۙۖۙۤ۟ۘۥ۠ۜ۫ۙۨۧۘۤۥۧۘ۬ۤۖۖۗۨۚۦۖۘ";
                                                        break;
                                                    case -983253882:
                                                        str13 = "۠ۖۨۧ۬۠ۘۦۧ۠۫ۦۢۙۦۘ۠۟ۦۘۘۜۘۘۜۡۨ۫ۦ۠ۢۜۡۘۚۤۥ۟ۛۨۘ۫ۚۧ۬ۘۜۘۖۥۖۦۙۡۘ۫ۧۘۘۡۢۚ۠ۦۤۖۨۛۙۥۛۙۡۖۤۡۘۦ۠";
                                                        break;
                                                    case -852570178:
                                                        str13 = iOrdinal <= tArr.length + (-1) ? "۬۠۬ۖ۬ۤ۠ۥۘۦۖۘۗۨۘۥۢۦۘ۟ۢۘۢ۬ۨۘۡۚۦۨ۟ۢۚۗۦۘۜۗۜۨۘۧۗۡۘۜ۫ۦۘۜۚ۠ۢۤۦۘ۬۫ۖۘۨۤۜۙۖۗۘۨۥۘ۟۬ۥۘۢۖ۟ۦۚ۬" : "۟ۨۧۘۦ۟۬ۡۗۘۘۘۨۘۦ۫ۙۜۘۦۨۥۘۢۖۤۘۥۘۙۨۘۘۛۨۖۖۗۦۖۛۥۘ۠ۥۤۤۛۨۘ";
                                                        break;
                                                    case 384081173:
                                                        str12 = "ۗۛۦۚۥۦۛ۟ۜۘ۠ۚ۬۫ۦۘ۠ۦ۬ۡۤ۟ۖۗۗۗۙۗۜۖ۬ۗۖۛۚۥۧۧۚۡۚ۬۫ۢ۬ۡۦۘۛۙۜۘ۫ۦۨۨۖۧۙۥۤۨۜۘۤ۫ۘۘۜ۬ۢۨۛۘۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1148314194:
                                            str12 = "ۥۤۨۘۛۚۧ۫۫ۡۘ۬ۨۘۘۦۡۨۖۛۤۙ۬ۨۖۖۥۘۖۛۦۘۗ۠ۘۘۥ۟ۘۜۧۢۨۙۖۚ۬ۜۘۚۙ۟ۜۘۗۚ۟ۨۘۤۨۡۨ۫ۥۖۚۥ۬ۜۤ";
                                            break;
                                        case 1195331149:
                                            str11 = "ۡۧۛۨۡۧۛۙۢۙۛۤۡۢۘۧ۫ۧۦۗۧۜۚ۫ۛۘۜۢۜۘۙۚ۟ۢۤۨۥ۬ۖۘۦۨۗ۟ۜۘۗۦ۠ۜۜۨ۫ۜۨۛۨ۟ۦۦۤۜۦ";
                                            break;
                                    }
                                }
                                break;
                            case -1312564190:
                                str = "ۛۘ۬ۜۗۘ۬ۗۢ۬ۗۗ۟ۨ۫ۗۨ۬ۨۜۨۦۦۛ۬ۘۜۘۤۖۖۢۚ۫ۡۧ۬۫ۙۚۖۤۗ۬ۖۘۗۢ۫ۘۥۚ۫ۛۜ۟۫ۚۙۡۥۘۨۘۦۧۛۘ۟ۥ۬ۦۜۡۘۖۘۦ۬ۗۡۦۡ";
                                break;
                            case -1247149456:
                                break;
                            case -836783254:
                                str11 = "ۥۚۥۘۤ۠۬ۦۜۥۢۨۢۛ۟ۧۘ۠ۚۡۖۘۘۥۨۤۥۦۘ۬ۡ۬۠ۦ۠۠ۙۥۖۨۖۡۘۥۖۜۘۡۥۖۘۙۦۧۧ۟ۘ۠ۙۖۘ۬ۡۜۘۜۚ";
                                break;
                        }
                    }
                    break;
                case 1433290173:
                    i = -1;
                    str = "ۢۚۦۗۖۧۛۦ۟۬ۤۦۜ۬ۛۡ۬ۖۘ۫ۖۤۙ۫ۘۙ۫۟ۙۤۚۛۦۘۤۢۙۨۡ۬ۚۗ۟ۚۗۜۛۘۘۥۨۗۛۨۘۨۛۜۘۙۥۚۙ۬ۦۘۧ۠ۨۗۘۘ۬ۙ۠ۘۦۚۦۡۗۖۖ۫";
                    continue;
                case 1523175261:
                    iOrdinal = r11.ordinal();
                    str = "ۗ۬ۨۘۜۛۡۘۢۙۨۘۛۜۘۘۜۤۚۛ۬۟۫ۥۘۖۥۥۘۡۢۨۚۢۘۘۙۤ۬۠ۜۦۨۗۜ۟ۡۡۗۨۘ۟ۧۖۘۢۤ۫۬ۖ۠ۥۧۘۢۙ۬ۤۥ۫۟ۚۥۤۤۥۚ۬۫ۖۘۖۘۦۛۜۡۤۧ";
                    continue;
                case 1681129781:
                    str = "ۡۛۘۦۙۜۘ۬ۤۘۘۨۗ۠ۦۗۨۘ۟ۙۦۡۛۦۡۥۢۧ۬۟ۖۤۡۙ۠ۜۘۙ۠ۤۗۛۘۤۧۧۧۤۦۦۚۥۘۙۛۖۗۚ۫۬ۡۤۘۧۨۘ۠ۖۘۙۧۨۘۙۙ۟ۖۚۧ";
                    i3 = i2;
                    continue;
                case 1822268313:
                    return -1;
                case 1898871146:
                    C0237h4.m1090("element", r11);
                    str = "ۡۡۜۧۡۘۘ۬۟ۥۡۘۥۘۦۗۖۛ۬ۦۤۨ۟ۥۤۗۜۚ۠ۙۦۘۗ۟۟ۤۢۨۘۘۢۡۘۢۛ۬ۥۤۨۗۦۡۘۦ۠ۙۖۨۡۘ۬ۢ۬ۢ۟ۡۘ۫۬ۤۤۨۨۨۘۨ۫ۚۛ";
                    continue;
            }
            str = "ۚۙۘۧۧۤۖ۬ۨۘۚۤۥۘۙ۟ۦۜ۬ۡۡۡۧ۠ۡۥۙۡۧۖۛۡۘۖۧۖۘۧۤۚ۬ۨۧ۟۬۟ۥ۟ۧۦۢۘ۫ۙۘ۫ۚۙۖۦۢۤ۠ۨۖ۠ۙۙۥۜۦۦۤۡۤۘۘ";
        }
    }

    @Override // p001.AbstractC0176d, java.util.List
    public final int lastIndexOf(Object obj) {
        Enum r2 = null;
        String str = "ۚۙۢۙ۫ۥۡۨۘۘ۫ۚۨۘۨ۬ۤۜ۬۠ۧۚۡۘۜۧۤۥۖۧۘۢۢۜۘۤۥۧۘ۠ۧۡۙۗۙۤۦۘۘۨ۟ۘۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 203) ^ 253) ^ 399) ^ 671) ^ 780) ^ 885) ^ C0133zz.f658f) ^ 4362243) {
                case -1173382325:
                    String str2 = "ۦۜۡۘۚۡۤۗۢۨۗ۟ۛۨۧۜۘۤۢۛۖۚۢۜۨۖۖ۬ۜۘۡۢۚۖۘ۟۠ۤ۬۬ۚۜ۠ۥۡۘۥۧۖۗۚۙ۟ۚ۟ۢۗۙۜۖۚۡ۫ۥۢ۬ۥۦ۬ۢۜ۠ۙ۫۫ۙۨۢۨۘۥ۠ۧۧۚۨۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 486471482) {
                            case -229480071:
                                String str3 = "ۖۜۧۘۡۛ۫ۨۚۦۘۖ۠۟۬ۗۡۨۚۜۙۚۜ۫ۚ۟ۦ۠ۡۜ۟ۤۥۦۙۚۜۘۘۨۤ۠۫ۥۙ۬ۧ۟ۖۘۥۘۡۧۨۘ۠ۖۚۥۜ۠ۜ۟ۥۛۨۗۦۥۛ۫۬۫۬ۦۜۘۚۡۘۘ۟ۚۢۧۢ";
                                while (true) {
                                    switch (str3.hashCode() ^ 196295783) {
                                        case -499341438:
                                            str2 = "ۛ۬ۘۘۖۚۜ۠ۛۨۘۚ۟ۡۛۢ۟ۧۥۖۥۖۨۘۚۢۗۡ۟۟ۡۚۘۘۨۡۗ۠ۖ۟ۖۜۖۘۜۨۡ۠ۛۡ۟ۥ۟ۖۥۦۦۨۘۢۛۦۥ۟ۡۢ۫";
                                            break;
                                        case 711656095:
                                            str3 = "۠ۦ۟ۨۚۗۦۛۨۜ۬ۥۨ۟ۘۘۗ۬۫ۘۙۥ۬ۛۖۘۘۨۦۡ۬ۦۙۡۤۧۙۙۨۙۛۢۥۨۘۙۤۡۛ۫ۧ۠۟ۘۥۛ";
                                            break;
                                        case 1208024647:
                                            str2 = "ۚۘۛۗۚۨ۠ۨۙۤۚ۫ۖۚۡۜۙۧ۟۬ۛۚۡۧۜۡۨ۫ۡ۟۠ۢۘۘۙۥ۟ۙۛ۟ۦۖۘۢۘۙۘۤۜۘ۟۟ۗۤ۬ۛۧۚۖۥۜۥۜ۟ۖۦۖۖۘۘ۫۠ۖۦۘ";
                                            break;
                                        case 2138529009:
                                            String str4 = "ۘ۠ۗۨۖ۫ۛۨۦۘ۬ۚ۫ۦۖۦۘۤ۬ۙۚۡۙۜۧۥۨ۠۠ۜۙۚ۫ۥۖۙۢۘۗۥۤۖۖۖۘ۬۠ۜۘ۬ۤۘۘۚۦۤۗ۫ۖ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-44970542)) {
                                                    case -1151799863:
                                                        str4 = !(obj instanceof Enum) ? "ۧۦۘۘۘ۫ۙۥۚ۟ۨۜۘ۟۠۬۫۟ۦ۫ۤۢۥۨۢۛۧۘۘ۫ۡۘۢۙ۠۬ۢۦۘ۬ۗۦۘۛۖۦۜۛۥۘۛ۫ۧۛۗۛۘۧۥۧۧۛۡۢۡۜۘۢۨۗۘۛۖۘ۟ۧ" : "ۛ۫۠۠۫ۢۚۜۨۘۡۥۚۘ۠ۜۢۨۘۢۦۨ۫ۚ۬ۢۜۜۤۨۙ۠ۘۡ۟ۥ۠ۥ۟ۜۘ۠ۙۥۘۗۢۗ";
                                                        break;
                                                    case -950791919:
                                                        str3 = "۫ۜۜۗ۠ۘۡ۫ۢۚۘ۫ۘ۫ۜۡۢ۫ۙۤۨۙۜ۫ۨۗ۫ۤۙۨۘ۬ۜۦۘۛۡۦۛۧۨۖۨۨۡۘۖ۟ۜۨۘۢۤۗۨ۟ۜۘ";
                                                        break;
                                                    case -831541312:
                                                        str3 = "۬ۗۚ۬ۙۙ۫ۨ۟ۥۜۤۧۛۛ۫ۡۧۡۘۚ۠ۡۜۘۖۜۙۥۥۘۖۜۥۘۖۖۜۘۡۡۨۢۢۗۧۢۖۘ۠ۜۜ۟ۘۨۘ۬ۛۖ۟۠ۧۡۘ۬ۡۚۙ۫۫۟ۜ۬ۢۖۤ";
                                                        break;
                                                    case 2064288644:
                                                        str4 = "۫۫ۦۦ۬ۜۘۧۤۨ۫ۢۧۖۥۘۖۧ۟ۧۚۘۤۙۨۘۨ۬ۧۢۧۘۨۘۥۘۛۧ۬ۜۘ۟ۚۙۦ۫ۢۛۛۘۘ۫۫ۨۘۤۧۥۘ۠ۡۥۘۖ۟ۘۘ۫۬ۗ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 51094267:
                                str2 = "۬ۚۡۚ۬۠ۧۤۜۘۡ۟۠ۧۥۖۘ۠ۖۚ۠ۜۖۥۖۙ۠ۙۦۛۨۘۘۢۧ۟۠ۚۖ۬ۘۦۖۡۨۘۦۙ۫۟۫ۧۤ۫ۨۘۢۨۥۛۡۦۘۢۡۤۙۤۜ۬ۜ۬ۚۥ۫ۧۢ";
                                break;
                            case 1232817457:
                                str = "ۦۥۦۘۙ۠ۖ۫ۧۗ۟ۘۘۧۢۦۘ۫ۦۧۘۗۜۘۡۨۡۘۤۥۛۨۛۧۙۨۡۚۙۖۨۥۡۘۡ۠ۦۨۛۖۘ";
                                continue;
                            case 1381111267:
                                str = "ۘۤۢۜ۠ۗ۠۟ۚۡۛۡۘ۬ۚ۫ۧ۫ۦۥۨۢۡۗۡۘ۬۟ۖۚۗۙۥۥۧۛۧۖۘۦۤ۫ۚۛۛۙۦۥۥۤۜۦۛۥۨ۫ۧ۟ۜۨ۠ۡۨۘۙۤۤ";
                                continue;
                        }
                    }
                    break;
                case -430778413:
                    C0237h4.m1090("element", r2);
                    str = "ۘۚۥۦۘۚۤۛۦۘ۟۠ۡۜۙۡۦ۫ۘۚ۠ۜۗۨ۬۠ۙۢ۟۫ۡۘۘۥ۠۠ۘۧ۬ۜ۫ۦ۫ۛۨۘۖۜۧۘۦۤ۫۬۟ۦ۫ۜ۫۠ۨۦۦ۟ۖۘ";
                    break;
                case -165633111:
                    str = "ۢ۠ۨۤۨۥۛ۟۠ۛۜ۫ۨۜۤۖۢۙۙۦۘۥۛ۠ۗۚ۬ۗۡۚۛۖ۫ۦۛۨۘۢۥۢۢ۟ۚۚۨ۟ۦ۫ۘۘۡۚۖۜۗۜۡۨۦ۫ۨۨۘ۟ۜۡۘۜۧۛ۟ۡۤۥۜۗ";
                    break;
                case -221315:
                    str = "ۜۙۦۤۦۦۘۜ۟ۘۘۙۜۖ۠ۦۙۜ۬ۚۘۧۘۥۗۨۥۚۡ۟ۜ۫ۛۤۡۗۧۧ۫ۥ۬۠ۦۖۙۡۙ۠ۦ۬ۨۤۗۥۘ۠ۤۢۖۜ۬ۗ۬ۤۛۡۖۛۚ۠ۘۚۦۘ";
                    r2 = (Enum) obj;
                    break;
                case 284687367:
                    str = "۠ۨۨۘ۠ۢۥۦۡۡۘۨۛۘۘۧۛۤۡۧۖۘ۟۬ۡۘۛۙۥۘۜۧۘۤۤۡۦۘۘۜۦۥۛۡۨۘۙۚۜۢۤۘۘ۠ۚۘۘۙۦۥۢ۠ۡۨۗۧ۫۠ۘۘۡۥۧۘۚ۟ۡۘ۬ۗۘۘۘۦ";
                    break;
                case 504505929:
                    return -1;
                case 2095469139:
                    return indexOf(r2);
            }
        }
    }

    @Override // p001.AbstractC0162c
    /* JADX INFO: renamed from: ۥ */
    public final int mo828() {
        String str = "ۗۜۚۘۦ۫ۙ۟۬ۡۗۙۡۧۦ۫ۥۘۦۡۦۘۖۖۡۘۧۛۨۘ۫۟ۨ۟۠ۤ۟ۛ۫۠ۧۗۜۖ۠۠۫۠ۦۤۘۜۙۘۢۤۜۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 767) ^ 609) ^ 780) ^ 706) ^ 870) ^ 353) ^ 654) ^ 1397129948) {
                case 1605064748:
                    str = "ۤۗۥۡۤۘۖۙۦۜۘۘۘۨۘ۠ۡۚۥ۟ۖۚۖۜۘۡ۬ۘۘۡ۬ۨۘۦ۬ۤۚۛۨ۠ۜ۠ۧۧۛۨۚۘۘ";
                    break;
                case 1996547162:
                    return this.f1039.length;
            }
        }
    }
}
