package p001;

import org.json.JSONArray;
import org.json.JSONObject;

/* JADX INFO: renamed from: ۟.q6 */
/* JADX INFO: loaded from: classes.dex */
public final class C0363q6 extends AbstractC0335o4 implements InterfaceC0222g3<JSONObject, Object> {

    /* JADX INFO: renamed from: ۥ */
    public final C0211f6 f1044;

    public C0363q6(C0211f6 c0211f6) {
        this.f1044 = c0211f6;
    }

    /* JADX DEBUG: Method arguments types fixed to match base method, original types: [java.lang.Object] */
    /* JADX WARN: Failed to find 'out' block for switch in B:4:0x002f. Please report as an issue. */
    @Override // p001.InterfaceC0222g3
    /* JADX INFO: renamed from: ۥ۟۟ */
    public final Object mo984(JSONObject jSONObject) {
        JSONObject jSONObject2 = null;
        JSONObject jSONObjectOptJSONObject = null;
        JSONArray jSONArrayOptJSONArray = null;
        JSONArray jSONArray = null;
        JSONArray jSONArray2 = null;
        boolean zM1166 = false;
        boolean z = false;
        boolean z2 = false;
        boolean z3 = false;
        int iM1169 = 0;
        JSONObject jSONObjectOptJSONObject2 = null;
        int i = 0;
        int i2 = 0;
        String str = "۫۬ۡۘۗۡۥۘ۬ۙۙۚۗۤۥۙۗۙۢۙ۠ۙۥۢ۬ۥ۠ۧۨۗۖۙۨۘۚۙۖ۬۟ۨۗۖۗ۟ۘۜۘۙۤۛ۠ۧۚۖۖۚ۫ۥۖۘۤۥۦۘۖۚۧ";
        while (true) {
            switch ((((((((str.hashCode() ^ 894) ^ 597) ^ 726) ^ 851) ^ 280) ^ 7) ^ 575) ^ (-811702245)) {
                case -1926454036:
                    z2 = false;
                    str = "ۨۖۡۗۨۥۦۛ۫ۘۤۖۗ۠ۛ۟ۘۢ۠ۛۛۜۥۘۤۢۨۧ۠۬ۤۢۗۛۨۘۛ۫ۡۘۖۜۨۛۤۜۡ۫۬ۖۚۢۙۢ۠ۤۥۚۛ۟ۘۚ۠ۨۡۙۖۤ۟ۢۗ";
                    break;
                case -1909181179:
                    int i3 = C0330o.f1000;
                    str = "ۡۖۤۗۡۨۗ۟ۥۘۦۥۨۨۘۘۛۙۛۦۡۤۖۡۜۘۡ۠ۡۧ۟ۧۢ۫ۡۡ۬۫ۥ۬۬ۥۖۡۦۗۡۘ۟ۧ۠۠۠ۖۘۦۖۥۥۥ۟ۦ۬۠ۧۘۡ۟ۧۖۨ۬ۛۛۜۘ";
                    break;
                case -1880356152:
                    String str2 = "ۘۜ۟ۖۙۗ۠ۦۧۛ۬ۥۘ۠۠۫ۛۦۢۤۜ۬ۨ۬ۗۜۡۘ۬ۧۥۦۛ۠ۜۦۧۜ۠ۗۙۙۡۜۢ";
                    while (true) {
                        switch (str2.hashCode() ^ 367062372) {
                            case -2137868208:
                                String str3 = "۠ۗۜۤ۫ۖۘۢۘۜۘۜ۬ۦۘ۬ۡۡۙۨۖ۟ۛۜۘۤۡۥۖۦ۫۠ۚۜۗۧۦۨۘۨۘ۠ۨۚ۫۬ۛۘ۠ۡ۫ۖۡۚۢۦۘۢ۬ۜۘۡۥۧۘۧ۟ۗۘۧۨۘۗۦۚۖۥۘۘۗۥۥۘۙۙۨۤۚۜۘۙۨ۫";
                                while (true) {
                                    switch (str3.hashCode() ^ 1016802987) {
                                        case -332606594:
                                            String str4 = "ۘ۠ۙۥۡۦ۫۫ۖۡ۟۠ۛ۫ۦۘۚۧۨۚۖۜۘۘۥۡۘ۬ۥۢۥۙۦۘۢۗۧ۟ۢۚۨۖۜۦۛۛۥۖۜۘۛۧۦۘۖۜۖۗ۠۠ۨۨ۟ۧۗۘۘ۟ۨ۫";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1042716971)) {
                                                    case -1082805753:
                                                        str4 = "ۙۧۨۜۧۦۘ۟۬ۤۙۡۡۡۘۙۙۗ۫ۘۘۘۥۨ۟ۛۨۨۖۦۘ۠۟ۜۜۚۡۘۨۦۧ۟ۤۤ۫ۧ۠";
                                                        break;
                                                    case -722236908:
                                                        str4 = jSONObjectOptJSONObject2.optJSONObject(C0341oa.m915(new byte[]{-30, -127, -119, 36, 29, 38, -27, -118}, new byte[]{-125, -27, -6, 123, 116, 72})) != null ? "ۤۥۜۦۘۨۘۜۧۘۘۦۗۖ۠ۨۥۘۡۦۗ۠ۜۜۘ۟۠ۨۖ۟ۛۙۥۖۘۡۦۘۗ۟ۗ۫۬ۘۘ۬ۖۥۜۜۤ۫ۤۚۨۙۥۘ۫ۦ۠ۜۛ۠۫ۧۥۢۛ" : "ۚۡۥۘۨ۫ۧۘۥۖۦۘۦ۬ۢ۟ۜ۟۟۠ۗۙۗۥۘۜ۟ۘۜۢ۬ۦ۠ۘۧۜ۫۬۟ۦۘۡۗۜۘۚۥۘ۟۬ۚ۬ۤۘ۬ۥۨۜۥۧۘۙ۬ۗۡۤۨۘ۠ۖۢ۠ۥۡۧۢۡۘ";
                                                        break;
                                                    case -497591356:
                                                        str3 = "ۜۙ۟ۙۖۚۛۛۤۚۚۦۧۚۧۨۥ۟ۗۥ۠۠ۚۖۡۧۘۥۡۜۘۤۨۥۘ۫ۚۛۜ۟ۨۘۛ۬ۢ۫۫ۧۙۧۦۘۥۢ۟ۖۦۢۡۜۘۧ۫ۖۘۖۘ۟۟۠ۙۙۨۥ۟ۚ";
                                                        break;
                                                    case 831822837:
                                                        str3 = "۟ۤۖۙۧۡۖۦۡۘۛۦۦۘۜۚۥۘۧ۟۠ۛۥۛۛۙۨۜۘۘ۠ۦۨۘۨ۟ۦ۠ۥۜۘۘۙۡۘۚۗ۟۬ۚۜۘۡ۬ۢۜۤۘۧۥۥۗ۬ۥۘۢۥۥ۠ۥ۬ۚۧۢۗۚ۟۠ۢۜۘۙ۫ۨۘۜۤۧۤۙۚ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -95084057:
                                            str3 = "ۜۦ۫ۦۦۡۢ۠۬۟ۨۛۨۛۘۘۜۢۜۡ۫ۦۗۢۧۗۘۚۧ۟ۢۜۨۘ۠ۨۨۚۡ۠ۡۜ۫ۙۖۘۜۥۨۘ۫۫ۖۡۦۙۛۙۧۜ۫ۢ۟ۨۨۘ۫۬ۦۘۨ۬ۦۗۡۘۘۘۚۜۡۢۤۤۢۖۘ";
                                            break;
                                        case 1469325283:
                                            str2 = "ۧۘۧۥ۠ۜۘۥ۬ۚۚۘۧۘۙ۫ۚۚۘۥۘۦ۟ۛۥۙ۫۫۠ۘۥۢ۟ۖ۬۬ۧۛۘ۟ۡۥۢۙۘۘۨ۬ۘۚۦۢۤ۬ۡۘۢ۫۬ۙ۟ۜۜۜ۬ۢۛۡۘ";
                                            break;
                                        case 2046525271:
                                            str2 = "ۙۛۜۘۡۙۡۘۨۘۡۚ۠۟ۢۛۡ۟ۛۛۢۙۡۘۚ۫ۙ۬ۡۢۡۜۘۢۤۦۘ۬ۢۡۡ۫ۨۧۡۧ۠ۢۨۘۛۦۘۢۨ۠۬ۥۘۛۡۜۘۖۜۛۨۛۨۧۛۨۘۡۧۛۡۘۥۧۗ۫ۥۤۥۘۧ۠ۛ";
                                            break;
                                    }
                                }
                                break;
                            case -1536111634:
                                str = "ۡۨۛۡۖۥۡۧۢۖۜ۟ۥۗ۫ۗۜۧۘۖۜۢۚۙ۫۠۫ۚ۠ۨۖۜۘۤ۠ۨ۠ۥۥۘ۟ۤۜۙۦۘۘۨ۬ۚۡۨۘۤ۫۬ۦۤ۬۫ۙۛ۟ۘۜۘۡۢۜۜ۬ۜۛۡ";
                                break;
                            case 1758690088:
                                break;
                            case 2075853168:
                                str2 = "ۨۜۘۘۜۗۜۗۦۨۘۡۦ۬ۢۧ۠۟ۨ۬ۤۤۘۘۧۛۦۘ۠ۡۡۖۖۡۘ۫ۙۗۜۜۖۘۨۙۤ۫ۘ۠ۘۥۜۚۜۘ۟ۘۛۗۙ۟ۙۥۥۖۡۨۥۙۡ";
                                break;
                        }
                    }
                    str = "۫ۜ۬۬ۚ۠ۘ۟ۥۘۥۖۛۚ۫ۦۢ۠۬ۜ۠ۥۘ۠ۤۡۥۨۤۥۘۦۘۙۘۗۧۜۘۘ۟ۡۚۦ۫ۖۘۧۢۥۚۙۜۘۚۧۡۥۜۜۘۨۛۙ۠ۡ۠ۗۢ۠ۘۦۜۘۘ۠ۤۜۜۖۘۦ۫ۖۘ۫ۖۜۘۥۜۖۘ";
                    break;
                case -1605143882:
                    break;
                case -1586849682:
                    str = "۠۟ۚ۫ۥ۬۫ۚ۠ۤ۟ۚ۫۫ۦۡۨۗۚۖۘۡۙۥۨۙۗ۠ۧ۠۠ۡۘۘ۫ۧۦۘۤ۬ۨ۬ۧۙۚۙۤۢۡۡۘۗۦۤۛۡۧۛ۠ۨۘۦۨۜۘۡۢ۫ۚ۠ۡۘۜ۫ۥ۠ۢۤ";
                    i2 = iM1169;
                    break;
                case -1490598590:
                    str = "ۡۘۦۘۘۚۦۘۨۚۘۘۧۥۗۤۢۡۜۜۥۧۤۗۛۘۖۘۨۘۥۜۖۘۦۢۡۘۗۧۢ۟ۧۖۘۨۧۘۘ۬۬ۥۜۚ۬ۦۧۘۤ۠ۡۛۖۘۘۙ۫ۧ۫۠۫";
                    break;
                case -1435924272:
                    z = true;
                    str = "ۨۚ۫ۧ۫ۚۙ۫ۥۘۥ۫ۤۤۢۖۖۨۚۨۘۥۘۢۖۙۙۦۧ۟ۢ۠ۜۜۧۧۖۘۗۨۨ۟ۦۦۘۥۥۙۗ۫ۤۨۨۢۜ۬ۚۖۧ۟۠ۚۥۥۘۡۢ۫ۢۜۚۥۘۧۛۥۘ";
                    break;
                case -1240677072:
                    String str5 = "۠ۡۥۖۢۧۢ۠ۛۙۗ۫ۗۧۡۜۦۧۨۗۧ۠ۥۘۘۡۛۖۗۛۘۤ۬ۜ۟ۗ۬ۡۛۢ۬ۛۧۦۥۥ۠ۥۤۤۨۦۛۦۧۚۡ۠ۥۚۖ۠ۛۖۘۙۦۡۖۨ۟ۥۘ۬";
                    while (true) {
                        switch (str5.hashCode() ^ (-1943407600)) {
                            case -759555185:
                                str5 = "ۘۚۡۘۜۛ۟ۨۢۤۥۧۘۘۨ۬ۘۡۤۦۘۢ۠ۢۘۗ۫ۤۖۥۚۙۘۘ۫۠ۨۘۛۡۧۘۜۢ۬ۡۨۜۘۥۖۦ";
                                break;
                            case -120798082:
                                str = "۠ۙۡۘۖۢۥۜۛ۫ۥۖۘۘۚۢ۠ۤۨۥۘۥۡۘۘۚۤۜۗۥۨۦ۬ۙ۠ۨۧۘۤۥ۬ۙۡۗ۫ۧ۫ۥۘۙۗۥۧۛ۟ۥۘۘ۟ۚۜۚ۟ۛ۬ۡۢ۟ۚۜ۟ۛۖ۬ۜۨۡۨ";
                                break;
                            case 725076998:
                                String str6 = "ۛۘ۠۫ۨۡۘۡ۟۫ۤۧۘۘۢۛۧۥۡۜ۬ۨۥۘ۫ۢۤۨۧ۫ۥۗۖۧۖۡۘ۬ۨۧ۬ۨۥۤۗۨۘۛۧۦۛۨۜۘۦۤ۠ۗ۬ۡ";
                                while (true) {
                                    switch (str6.hashCode() ^ 257132926) {
                                        case -1893322296:
                                            str5 = "۟ۦۧۘۢ۬۠ۢۛۡۘ۠۬۟ۛۧۛۢۢۥۘۥۦۨ۬ۖۖۗۤۚۢ۫ۨ۟ۧۘۘ۫ۜۘۨۚۖۘۜ۫ۘۥ۫ۙ۬۫۟ۤۥۧۚۨۛۦۥۜۡ۫ۘۖۦ";
                                            break;
                                        case -763341147:
                                            String str7 = "ۖۚۘۘ۫ۙۜۘۥۗ۠ۗۜۘۙۘۖۘۤۗۖۡ۫۟۫ۚ۬ۥۧۥۖ۟ۨۖۢۙۙۤۘۗ۟ۡۥۦۗۥ۟۠ۙۜ۠۫ۢۜۘۢۤ۠ۢۚۘۡۡ۫ۙۛ۬";
                                            while (true) {
                                                switch (str7.hashCode() ^ (-1471076687)) {
                                                    case -1167320118:
                                                        str7 = z3 ? "ۚۘۥۘۖۙۖۤۗۘۧۧۡ۫۫۟ۦۜۦۗۤ۠ۨۙۖۖۘ۠ۘۡۘۖ۠ۘۘ۠ۗۗۤۢۡ۟ۤۥۖ۬" : "ۚۘۧۘۚۥۨۜ۠۬ۛۥۤ۠ۧ۫ۧۛۘۘۥۨۖ۫ۨۤ۠ۡۜۘۨۡۨۘ۫ۡۖۘۢۜۘۥۡۛ۬ۥۘۛۥۦۡ۟ۦۜ۟ۧۙۦۘ";
                                                        break;
                                                    case -1146366810:
                                                        str7 = "ۚ۬۬ۖۥۢ۟ۗۚۥۡۦۚۡۖۘۥۘ۠ۢۡ۠ۛ۟ۢۖۡۘ۠۠ۨۘۛ۬ۦۤ۠۟۠ۨۥ۟ۦۖۧۡ۬ۨۛۦۥ۠ۡۙۘۘۦۛۚۖۜۚۢۦۦۙۜۘۘ۟ۚۦۘۜ۫";
                                                        break;
                                                    case 187509974:
                                                        str6 = "۠ۙۘۘۢۜ۫ۢۡۘۘۢۨۜۘۛۨۧۘۚ۠ۙۛۡۖۗۧۡۘ۬ۨۥۘۛۥۨۘۚۢۖۘۙۢۘۦۥۙ۟ۘۨۡ۠ۢۥۘۤ۬ۚۧ۫ۦۖۘۡ۟ۨۘۘۧۛۧۘۨۘۧۜۜۘۥۖۚۥ۫ۜ";
                                                        break;
                                                    case 802338928:
                                                        str6 = "۬۫ۨۧۛۜۦۢۡۙۢ۬۟۠ۥۘۘۗ۠ۦ۬ۨۘۚۛۤۡ۫۟ۙۖۤۜۢۚ۫ۚۜۦۡۙۢۨۥۚۘۡۡۗۡۖۥۦۘۨۗۖۢۖ۫۠۟ۗ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -516605163:
                                            str5 = "ۡۥ۠ۧۗ۬ۡ۟ۡۜۥۦۘۦ۠ۤۡۗۘۘۚۛۡۘۦ۟ۦۘ۟ۡۡ۠ۦۖۘ۬ۗۧۡۜۦۨ۟ۜۡۘۢ۟۫ۤۨۖۘۚۘۜۘۤۢۜ۫ۤۛۗۤۜۘۜۘۡ۫ۥۖ۟ۨۘ۬۬ۖۘۗۖۙۨۦۘۜۥۥ";
                                            break;
                                        case 701320:
                                            str6 = "۠ۧۨ۬ۗۜۘۙۛۖۜۚ۫ۗۖۧۗۤۘۦۗۖۢۜۧۘۨۤۥۗ۬ۘۜ۟۟۫ۨۧۗۤۙۜۧۘ۫ۖۗۛۢۦۦۘۛۖ۟ۨۘۡۨۙۢ۬ۤۘ۫ۦۛۛۨۘۖۡۥۙۨۖۢۢۚۤ۬ۥۘۡۨۤ";
                                            break;
                                    }
                                }
                                break;
                            case 751692962:
                                break;
                        }
                    }
                    str = "۫ۡۨۘۖۙ۫۠ۙ۠ۜ۬ۜۧۥۖۘۚۗۖۘۦ۟ۘۙۙۖۘۧۙۛۤۘۘۘۢۗۦۗۦۘۥۗۨۤۖۦ۬ۘۤ۫ۢۖۘۥۛ۟ۙۤۧ۟ۤۗۘۥۜ۟ۛۨ۟ۨ۫ۥ۟ۘۘ۫۟ۥۙۘۨۧۥۥۘ۟۠ۦ";
                    break;
                case -1109222035:
                    str = "ۜۤۛۖۙ۟ۚۢۘۘۘۘۧۘۡۙۥۘۜ۫ۨۘۡۨ۠ۗ۫ۦۘۢۛۜۚۗ۫ۗ۬ۗۖۧۚ۬ۙۥۘۗ۫ۦۡۘ۫۟۟ۗۘ۟ۨۘۦۨۢۨۡۖ۟ۖۗۢۜۥۘۜۢۚ۫ۤۢۛۗ۫";
                    break;
                case -946218990:
                    str = "ۡۧۡۘۘ۫ۢۚۘۥۡۛۨۘۥۤۦۦۚۛۙۘۦۡۖۥۘۗ۬ۧۦۡۘۘۨۧۦۡ۬ۘ۟ۙۨۘۗۦۜۘۡۧۘۘ";
                    break;
                case -711357840:
                    i = i2 - 1;
                    str = "۬۟ۥۘ۟ۥۢۘۥ۬ۧ۟ۗۖۛۦۘۦۛۖۘ۟ۘ۫ۗ۠ۜ۫۠ۘۦۚ۫ۙ۫ۦۘ۠۬ۥۘ۠ۧۘۘۘ۠ۨۥۨۥۘ۬ۤۨ۟ۛۥۘ۟ۢ۠ۙۢۘۖۛۖۘۡ۫ۛ";
                    break;
                case -450795114:
                    String str8 = "ۦۜۦۘۜۘۡۚۖۨۢۨۥۦۖ۠۫ۦ۟۟ۢ۬ۦۘۘۚۤۤ۫ۘۡۡ۬ۡۚۜۨۧۘۥۘ۫ۖ۬ۥۘۢۜۛۖۘۧۛۛ۬ۢۨۘ";
                    while (true) {
                        switch (str8.hashCode() ^ 204787563) {
                            case -1040234046:
                                str8 = "ۜۖۥۘۨۜۜۘۛۦۘ۬ۛۜۗ۫۠ۙۜۥۘۜۘۜۘ۬ۘ۠۟ۘۢۛۥۗۢۛۚۨۖۘۡۜۦۘ۠ۘ۫ۗۨ";
                                break;
                            case -442246569:
                                str = "۟۠ۜۘۗ۟ۛۚۨ۠ۘ۬۟ۛۙۗۨ۠ۚۚ۬ۚۙۗۨۥۘۤۦۨۘۖ۬ۦۘۢۚۢۥۢۛ۫ۡۘۘۨۘۖۨۙۜۨۙۜ۬۫ۥۚۥ۬۟ۖۚۗ۫۬۠۠۫ۨ۟۠ۚۧ۫۟۫ۡۗۘۖ۬ۛ";
                                continue;
                            case 429571812:
                                String str9 = "ۛۘۘۢۨۙ۫ۨۢۡۢۙۢۚۨۘ۬ۖۡۘۥۛۛۤۖۜۛۧۗۗۛۢۧۗۗۦۚ۠ۘۘ۫ۜۛۘۚۦۘۨۦۗۡۛۡۘۗۛۛ۫ۙ۬ۦ۬ۡۘۧۨ۟";
                                while (true) {
                                    switch (str9.hashCode() ^ 1129826774) {
                                        case -1651896390:
                                            str8 = "ۚۘۦۦۥۖۜۘۙۙۤۨ۬ۥ۫ۨۤۤ۟ۗۡۘ۬ۦۦۘۤۛۜۧۨۧۘۚ۠ۜۦۤۢ۫ۡۘۚ۫ۥۘۢۥۙۘۢۜۘۗۤۡ۠ۨۨ۫ۖۥۘۥۖۖۘۦۜۗ";
                                            break;
                                        case -1252477788:
                                            str9 = "ۥۙۜۘۙۖۥۘ۬ۥۥۘۛۗۚۙۨ۠ۤ۠ۜۘ۠ۚۦۛۥۘۦۧ۠ۡۤۦۘۜ۠۬ۥۧۚۖۜ۫۫۬ۥۘۥۛۖۖ۠ۘۘۨۧۛۚ۟۫ۥۤۖۦۧۖۖ۫ۥۗ۫ۨۧۖۘۦۘ۟";
                                            break;
                                        case -106411125:
                                            String str10 = "ۛۥۖۜ۠ۗۘۜۖۘۦۙۥۘۨۧ۬۫ۤۤ۫ۛۘ۟۫ۢۦ۟ۦۘۚۙۜۘۡۡۦۘۖۡۤۢۥۛۘۙۤۦۥ۠۠ۢۢۚۧ۠۟ۛۤۗۜۛۖۘۘۗۗۜ۠۫۠ۗۖۛۨۧۛ";
                                            while (true) {
                                                switch (str10.hashCode() ^ 175961992) {
                                                    case -1997733365:
                                                        str9 = "ۨۤۥۤۘۡۥۚۖۤۚۜۜۗۜ۟۠ۘۘۘ۠ۥۘۜۦ۠ۦ۠ۖۘ۠ۨۘۤۖۥۥۗۦۖۙۛ۬۫ۧۤۙ";
                                                        break;
                                                    case -1684477350:
                                                        str10 = "۬ۦ۫۫ۥۧۘۙۚۨ۟ۤۚۚ۫ۦۨۧۜ۬ۢۘۘۨۥۦۘۥۘۧۘ۟ۨۘۘۡ۫ۚۦۡۘۨ۬ۘۙۗۦۘ۟ۜۗۜۨۦۘۧۜ۠ۦۘ";
                                                        break;
                                                    case -506314798:
                                                        str10 = jSONObjectOptJSONObject != null ? "ۨۗۧۡ۬ۗۖۚۨۜۤۘۘۨۖۥۘۚۖۦ۟ۖۜۘۧۦۢۢۨ۟ۛ۬ۘۚ۬ۗۜ۟ۜۘۧۘ۟ۖ۬ۗۢۗۥۢ۠۟ۙۢۗۥ" : "ۨۤۥۘ۠۠۬ۘ۟ۖۘۤۢۨۡۧۡ۬ۖۘ۟ۡۧۘۙۨ۟ۙۦۨۘ۬۟ۢۢۖۥ۬۟ۥۘۦۡ۠ۜۧۧۘۢۜ۠ۥۙۖ۬ۦۦۖۜۙۜۘۙۦۛۙۙ۬ۡۚۙۦۤۦۦۢۚ";
                                                        break;
                                                    case 1383786864:
                                                        str9 = "ۛۧۨۘۘۡۥۜۥۨۛ۫ۚۢۧۘۖۜۘۘۡۛۦۨۡۡۘۦۤ۟۠ۥۢۜۜۨۘۖۘۡۘۡۥۦۤۖۡۥۢۦۧ۬ۜۘ۟ۤ۬۫ۨۦۢۦۦۖۤۚۦۤۘۗۧۧۢۥۥ۟ۢۤ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 750080206:
                                            str8 = "ۗ۬ۘۤۖۖۜۦۙۤۧۨ۟ۗ۬ۜ۠ۡۘۗۨۘ۫ۡۧۘۤۦۨۘ۬ۨۡۘۖۗۛ۫ۢۖۘۗ۠۠ۜۙۘۚۨۘۨۙۤ۬ۜۨۘۦ۫ۜ۫۠ۨۦۤۨۗۢۨۥ۠ۡۖۡۨۖۚۘۘ۬۫ۢۜۦ۬ۛۘۧۘ";
                                            break;
                                    }
                                }
                                break;
                            case 1060981560:
                                str = "ۦۢۘۘۨۛ۬۟ۥۨۘۗۗۘۢۡۡۘۖۚۤۡ۫ۤ۠ۘۘۧ۫ۦۘۡۨۘۥۛۖۜۢۘۘۙۢۚۤ۠ۛۜۛۚ";
                                continue;
                        }
                    }
                    break;
                case -418245681:
                    jSONObjectOptJSONObject2 = jSONArray2.optJSONObject(i2);
                    str = "ۘۨ۬۫۠ۦۘۖ۬ۜۛ۠۬ۗۙۘۦۘۢۛۥۗۦۗ۬ۙ۫ۢۗۛۘ۠ۨۛۜ۠ۗۡ۬ۦۜۘۦۧ";
                    break;
                case -262166911:
                    str = "ۡۘۦۘۘۚۦۘۨۚۘۘۧۥۗۤۢۡۜۜۥۧۤۗۛۘۖۘۨۘۥۜۖۘۦۢۡۘۗۧۢ۟ۧۖۘۨۧۘۘ۬۬ۥۜۚ۬ۦۧۘۤ۠ۡۛۖۘۘۙ۫ۧ۫۠۫";
                    z3 = z2;
                    break;
                case 1525676:
                    String str11 = "ۘۚ۠۠ۛۖۢۜۚۜۙۜۘۦ۟ۨۘۙۗۨ۬ۖۗ۫ۖۛۧۙۛۥۡۘۘۤۦ۫ۘۤۚۜۖۖۥ۫ۡۖۤۜۘۡۜۡۚۤۜۘۤۡۛ۟ۦۚۜ۫ۥۡۢۨ";
                    while (true) {
                        switch (str11.hashCode() ^ (-1140428432)) {
                            case -1322331593:
                                String str12 = "ۙۡۖۘۦ۫ۨۘۨۚۚ۠ۥۧۥۦۙۢۜ۠۠ۨۨ۬ۧۦۘۡ۫ۥ۬ۘۡۘۧۖۡۡۜۤ۫ۡۚۜۢۢۘۨۘۙۚۥ۫ۢۜۘۗ۟ۖۘ۬ۤۨۘۖۢ۠ۖ۫ۥۘۨۤ۬ۚۨۦۖۘۘ";
                                while (true) {
                                    switch (str12.hashCode() ^ 1577279735) {
                                        case -1634814176:
                                            str12 = "ۥۤۘۦۜۙۤۙۦۘ۠ۤۡۘ۟ۨ۬ۛۖۚۗۘۜۜۛۨۘۤۨۙۙ۫ۡۤۙۗۙ۬ۢۨۤۡۘۨ۬ۘۘۗۦ۠";
                                            break;
                                        case 27031341:
                                            String str13 = "ۜۧۙۤۙ۠ۙۛۥۘ۠ۘۥۘ۫ۚ۟ۖۡۘۢۤۖۗۢۙ۟ۦۡۡۡۛۦ۬ۗۨۛۡۜ۫۫۟ۗۨ۫ۧۢ";
                                            while (true) {
                                                switch (str13.hashCode() ^ 295556920) {
                                                    case -631187432:
                                                        str13 = -1 < i2 ? "ۜۨۚۚۘۜۘۜۚۛۘ۠ۡۡۖۜۘۜۜۡۘۦۙۙۧۢۘۧۡۧ۫ۛۨۘۜۖ۠ۤۢۚۦ۬ۡۘ۠ۚۥۚۨۨ" : "۠ۢ۬ۛۜۘ۟ۨۘ۬ۤۖ۟۟ۛۛۜ۟ۗۦۘۦۘۦۘۖۥۜ۠ۛۚۛۨ۠ۜۡۚۘۖۘۘ۬۟ۜۘۧۤۧ";
                                                        break;
                                                    case -381569405:
                                                        str12 = "ۛۗۥۨۦۨۘۛۛۗۨۚۙۥۗۥۥۧ۟ۦ۫۬ۨۥۦۘ۫۫۬ۖۙۚۛۙۖۘۦ۠ۢ۟ۚۧۚ۬ۨۘۖ۬ۛ۟۟ۡۖۨۦۧۘۜ۬ۘۘۤۖۢ۠ۤۡۘ";
                                                        break;
                                                    case -39861100:
                                                        str13 = "ۡۧۖۘۜۦۥۜۛۨۘ۬ۜۗۧۢۥۘۙۚۥۘۘۢۖۥۙۗۗۗۛۧۚۧ۟۠ۚۘۚۧۥۖۘ۠ۜۥۦۙۦۘۧۗۧۜۜۛۜۗ۬۬ۖۢۦۦۢ۠ۗۘۚۘۧۤۨۦۥۢۡۥ۠ۛۙ۬ۛۖۦۡۘ";
                                                        break;
                                                    case 926992446:
                                                        str12 = "ۜۜۥۥۚۨۙۛۦۘ۫ۗۗۧۢۖۦۨ۬۬ۦۘۢۧۘۚۢۧۤۖۘ۠ۚۧۖۜۗ۫ۢۜۥۡۜۘۖ۫ۜۘۙۘۦۤۢۖۘۙ۟ۡ۟۠۟ۜۗۘۘۘۗۦ۫ۧ۬ۡۧۗۥۢۚۜۛۨۘۙ۫ۘۖۚ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 336752031:
                                            str11 = "ۖۤۡۢۛۜۘۚۘۚۙۧ۠ۢۘۘۥۜۨ۬ۜۜ۬ۥۙۧ۟ۖۖۗ۠ۨ۫ۥۡۗ۟ۚۧۤۖۥۡۜۜۖ۬ۡ۠ۤۖ۟۫ۥۘۜۨۜ۬ۦۛۘۧۢ";
                                            break;
                                        case 1710257094:
                                            str11 = "ۧۤۖۘۤۜۨۘۧۘۡۨۦۗۙۨۤۤۖۛ۟ۦۘۡ۟ۦۙۡۚۧۗۦۘۛۘۘۘۥۦۜۘ۟ۙۖۘ۬۫ۛۜۦۘۘۢ۟ۘۘۨۧۤۗۛۢۢۦۨۘ۟۬ۚۘۛۦۘۚۤۚۘۜۗ۫ۜ۬";
                                            break;
                                    }
                                }
                                break;
                            case -306704548:
                                str = "ۨۛۦۙۗۤۖۖۨ۠ۗۘۘۦۚۦ۬ۥۘۥۛۗ۫ۤۦۢ۫ۜۤ۠ۨۜ۬ۛۜۚۧۗ۟ۚۢۨۖۘۘ۟ۧ۬ۧۖۘۢۦ۬ۚۘۡۘۛۤۥۘۧۗۙ۫ۡۜۦ۟۠ۛۛ۬ۧۥ";
                                break;
                            case 261157415:
                                str11 = "ۡ۟ۗ۠ۗۚۤ۟ۛۖۚۜۡۛۙۖ۟ۗۗ۬ۥۘۥۜۜۘۡۨۦۥۨ۫ۖۖ۬ۖۨۖۤۢۦۢۢۥۘ۟۠ۖۘۙۚۦ۠ۥۡۘۜۛۡۜ۬ۦۥۚ۫ۤۗۘۚۢۧۛۘۧۗۤۗ";
                                break;
                            case 1233934664:
                                break;
                        }
                    }
                    str = "۫ۡۨۘۖۙ۫۠ۙ۠ۜ۬ۜۧۥۖۘۚۗۖۘۦ۟ۘۙۙۖۘۧۙۛۤۘۘۘۢۗۦۗۦۘۥۗۨۤۖۦ۬ۘۤ۫ۢۖۘۥۛ۟ۙۤۧ۟ۤۗۘۥۜ۟ۛۨ۟ۨ۫ۥ۟ۘۘ۫۟ۥۙۘۨۧۥۥۘ۟۠ۦ";
                    break;
                case 6792473:
                    str = "۟ۥۖۘۥۛۤۜۦۜۦۥ۟۬ۖۨۢۡۜۘۥۤ۠۬ۖۖۘۢۦۛۡۜۘۘۗۡۧۘۦۛ۫ۘ۬ۨۘۛۡۢۤۘ۟ۥۡۘ۟ۖۤۛۥ";
                    i2 = i;
                    break;
                case 112467488:
                    str = "ۛۛۨۘۙۥۘۚ۫ۤۧۡۘۘۢۤۤۚۨۨۢ۠ۦ۫۫ۜۗۥ۫ۚۥ۫۠ۘ۬ۚۙۦۘۙۧۘۘۜ۟۬ۙۙۗۗۥۡۘ۟ۚۢ۬ۢ";
                    z3 = z;
                    break;
                case 250479332:
                    this.f1044.getClass();
                    str = "ۛۥ۫ۨ۟ۥۦ۟ۦۘۖۙۨۧۧ۟ۡۨۧۘۗۙۛۢۤ۠ۙۤ۠ۢۦۚۢۡۖۖ۠ۘ۫ۤۜۧۛۤۥۘۛۧ۠۠ۧ۠۟ۚۥۡۘۥ۠ۡۖ۬ۦۧۖۧۧۖۧۡۢۨۘۜۗۧ";
                    break;
                case 277889986:
                    str = "ۛ۬۠ۚۧۨۦۖۥۛۥۖۛۧۙۚۗۜۥۤۡۘ۟ۙۡۤۛۛۧۧۦۗۙۚ۬ۗۢۘۧۤۙۗ۠ۤۚۢ۠۫ۢۘ۬ۧۘۧۖۚۢۚۖۡۢۢۧۚۙۦۘۙ۠ۙۘۙۧ";
                    jSONArray2 = jSONArrayOptJSONArray;
                    break;
                case 521372221:
                    String str14 = "ۗۜۤۦۖۛۧۢۗۙۙۘۘ۠۠ۧۖۘۗ۬۬ۡۡۤۦۨۦۖۘۗۢۦ۟ۦۢ۬۬ۡۧۘ۬ۖۛۡۘۗ۬ۗۧۖۦۘۜۘۥۦۨۘۥۚۘۘۦۢ۠۬ۤ۫";
                    while (true) {
                        switch (str14.hashCode() ^ 1972443424) {
                            case -1067614818:
                                String str15 = "۬ۢۖۘۤۖۘۘۙۛ۟ۗ۫ۡۘۢۖۘۘ۬ۚۡۦۤۗۖۤۦۘۗ۫۟ۥۡۡۛ۫ۨۥۖ۠ۨۗۨ۬ۖۘۥۘۨۖۤۧۢ۠ۚ۟ۧ";
                                while (true) {
                                    switch (str15.hashCode() ^ (-1086076360)) {
                                        case -2054744623:
                                            str15 = "ۖۗ۫ۖۡۧۘ۫ۘ۬۬۫ۥ۫ۘۚۨۚۥۤ۬ۗۚۛۤۥۧۖۥۨۘۘۧ۬ۗۗۖۘۦۛ۠ۥۜ۬ۜۘۡ۠۟ۥۘ۫ۦۦۘۙ۬ۦ";
                                            break;
                                        case 600044136:
                                            str14 = "۟۬ۢۥۢۧۥۨۖۥۛۢۘۦۖۘۨۖۦۘۨۨۥۘۡۚۦۦۘۨۖ۬۠ۢۧۤۘۛۦۘ۫ۚۨۘۥۙۖۦۖ۬۬ۚۡۜ۟ۙۧۛۨۙۡ۟ۡۢۛۜۡۧ۬ۦ۫ۦۘ۫";
                                            break;
                                        case 1175364794:
                                            String str16 = "ۙۥۦۘۛ۠ۘۢۢۡۢۙۘۘۨۢ۟۠ۜۨۘۜۘۨۘۙۦۖۘۡ۠ۥۘۨ۠ۖۘۦۥۘۤۖۜۘ۫۫ۚۦۨۖۤۦۥ";
                                            while (true) {
                                                switch (str16.hashCode() ^ (-1611708922)) {
                                                    case -1189992758:
                                                        str15 = "ۚۖۚۛۚۘۘۧۙۨۘۖۡۥۥۘۛۢ۟ۗۦۗۦۧۨۜ۫۫ۦۘۤۜۨۤۤۥۘۨۙۛۦۤۘۤۦۦۦۚۘۦۨۧۘ۫ۘ۟ۥۗۚۨۖۥۘۖ۠ۨۤۗۥۨۨۜۘۧ۬ۜۙ۬ۡۘ۠ۜۙۚ۬ۥۧۖۢ";
                                                        break;
                                                    case -1095279175:
                                                        str15 = "ۛۛۨۨۨۛۧۤۡۘۦۘۚۡۗۖۘۨۘۢۡۢۢۛۥۘۡۥۖۜۦ۫ۧۛۥۘۘۢۡۘۖۡۖۘۧ۠ۤۦۦۖۨۨ۟ۡۦۡۘ۠ۥۦۘۡۧ۬ۧۙۖۘۖۨۘ";
                                                        break;
                                                    case -672486179:
                                                        str16 = "ۚۨۥۜۥ۫۬۠۬ۙۨ۠۫ۤ۬ۖۥۤ۟ۚ۟ۥ۬ۧۚۖۛۦۤۗ۫۬ۛۦ۟ۡ۫۬Oۗ۬ۘ";
                                                        break;
                                                    case 1430305073:
                                                        str16 = jSONObjectOptJSONObject2 != null ? "ۚۤۚۛ۫ۗ۬۫ۜۧۗۡۘۧۖۖۜۢۧ۠۠ۤۙ۠ۚۦۨۢۛ۬۟ۛۤ۫۟ۦۥۘ۬ۨۖۜۦۜۜۢۜۘۦۢۦۖۛۨۘۗۥۘۘ" : "ۧۤۡۤۤۖۘۖۤۡۜۖۜۘۖۤ۬۬ۗۦ۬ۡۙۛۙۜۘۦۢ۠۟ۧۥۚۛۡۘۛ۟ۦۨۧۖۘ۬ۤۡۘ۟ۤۤۢۙۥۚۡ۠ۛ۬ۤ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1709687100:
                                            str14 = "ۨۦۡۚۦۜۜ۬۫ۥۛ۠ۙ۫ۨۙۡۧ۠ۛ۠۠۠ۦۘ۫۠ۜۦ۫۫۬ۖۜۨۙ۠۫ۢ۟۟۟ۨ۟ۖۡۘۘ۬ۢۥۚۡۘۥۗۘۖۘۥ۫ۦ۠";
                                            break;
                                    }
                                }
                                break;
                            case -23043350:
                                break;
                            case 58168943:
                                str = "۠ۘۦۘۦۡۖۚۛۥۥۛۡۘۖۘۛ۫ۖۙۧ۬ۤ۫۟ۜۥۡۘۚ۫ۜۘۚۦ۬ۙۨۧ۟ۙۦۘۡۦۧۘۚۘۙۜۛ۠۠ۤ۠ۡۖۘۥۗۗۖۘۡۘ۫ۥۧۘ۬ۦۚۘ۫ۘۘۘ۫ۚ۬۬ۘۘۧۧۖۘ۟۫ۖ";
                                break;
                            case 346814547:
                                str14 = "ۖۙۤۤۤۦۘۤۚۗ۠ۙ۟ۥۧۖ۠ۤۢۙۘۗۤۤۢۛۜۦۖ۬۫۠ۨۘۛۘۛ۟ۧ۬ۤۡۖۖ۠ۤۥۛۦ۬ۡۖ۫ۘۨ";
                                break;
                        }
                    }
                    str = "۫ۜ۬۬ۚ۠ۘ۟ۥۘۥۖۛۚ۫ۦۢ۠۬ۜ۠ۥۘ۠ۤۡۥۨۤۥۘۦۘۙۘۗۧۜۘۘ۟ۡۚۦ۫ۖۘۧۢۥۚۙۜۘۚۧۡۥۜۜۘۨۛۙ۠ۡ۠ۗۢ۠ۘۦۜۘۘ۠ۤۜۜۖۘۦ۫ۖۘ۫ۖۜۘۥۜۖۘ";
                    break;
                case 559166509:
                    zM1166 = C0330o.m1166(jSONArray2);
                    str = "ۧ۬۫ۚۙۖۘ۠ۥۥۘۥۤۥۖۦ۫ۡۡۡۙ۟ۘۘ۟ۡۖۚۙۢ۬ۖۦۥ۫ۗۤۤۘۚۢۧۢۛۜۘ۟ۛ۬ۤۗۨ۟ۡۘۘۗۙۡ۟ۢ۬۫ۨۦۨ۬ۧۖۥ۫۠ۧۦۡۙۜۘ۠ۜۧۦۘۖۘۧۢۘۘ";
                    break;
                case 675782849:
                    jSONArray2.remove(i2);
                    str = "۫ۜ۬۬ۚ۠ۘ۟ۥۘۥۖۛۚ۫ۦۢ۠۬ۜ۠ۥۘ۠ۤۡۥۨۤۥۘۦۘۙۘۗۧۜۘۘ۟ۡۚۦ۫ۖۘۧۢۥۚۙۜۘۚۧۡۥۜۜۘۨۛۙ۠ۡ۠ۗۢ۠ۘۦۜۘۘ۠ۤۜۜۖۘۦ۫ۖۘ۫ۖۜۘۥۜۖۘ";
                    break;
                case 699215792:
                    jSONObjectOptJSONObject = jSONObject2.optJSONObject(C0341oa.m915(new byte[]{31, -13, 62, -19}, new byte[]{123, -110, 74, -116, 29, -66}));
                    str = "۟ۙۚۗ۬ۗۥۢۖۘۖ۠ۥۨ۫ۖۘۦۨۛۙۦۖۚۡۘۧ۬ۡۤ۬ۢۖۖۜۙۢۖۘۛ۫ۡۘۦۥۛۤۗۨۘ۠ۘۦۘۛۧۥۘۨ۠ۛ۬۬ۡۥ۫ۢۧۨۨۘۧۙۢۚ۬ۜۘۤۧۡۘ";
                    break;
                case 905197675:
                    iM1169 = C0330o.m1169(jSONArray2);
                    str = "۫ۨۥ۟ۧۥۘۚ۠ۙۛ۬۬ۗۖۘۘ۬ۤ۟ۤۗۢۤۘۥۘ۟ۡۨۘۘۛۘۛۤۧ۠۫ۡۘۦۦۘۘۛ۫ۛۛۗۧۗۨ۟ۜۗۥۘۖۚۡۘۛۦ۬ۗۡۙۜۨ";
                    break;
                case 917690404:
                    String str17 = "ۖۗۥۙۖ۬ۚۗ۠ۧۨ۬ۡۖۢ۬۬ۤۖۢۢۥۖۦۘۤ۬ۚ۫۟۫ۙۚۤۤۙۚۦۜۥۘ۠۬ۚ۠ۤۨۘ۠ۦۧۘ۠ۗۤ۫۠ۦۧ۬ۥۘۨ۠ۘۘۛۗۧ";
                    while (true) {
                        switch (str17.hashCode() ^ 2125545506) {
                            case -1626591147:
                                str = "ۢۗۙۚ۬ۤ۠ۦۖۘۙ۫ۜۖ۫ۘۘۦۧۖۚ۬ۨۘۢۛۤۖۧۖۘۗۨۜۘۦۧۨۢۤۨۘ۟ۙۦۘۦۦۥۘۘۗ۟ۥۜۥۖۚۦۘ۫ۥۚۗۡۘۡۗۙۤۡۖۦۧۗۙۛۢۦ۫ۢ";
                                break;
                            case 877731172:
                                break;
                            case 1566195738:
                                str17 = "۟۬ۨۘۡۧۗۦۜۘۨۤۡۖۘۦۘۢۖۜۘۨۤۤۛۚ۬ۢۢ۫ۗۜۜۥۧ۟ۛۜ۟ۧ۫ۡۛ۬۠ۢۦۧۘ۬۠ۜۘ۟ۥۘۛۡ۫";
                                break;
                            case 1932240799:
                                String str18 = "۠۠ۥۘۖ۠ۖۘۜۘۖۘۢۛۛۧۥۨۘۜۨۘۘۡۛ۬ۛۡۥۘ۟ۧۛ۠۠ۛۗۜۦۗۘۤۦۜۛۧۧۜۖۚۦۘ۫ۧۗۨۥۛۧۜ۟ۚۢۘۘۡ۟ۢ";
                                while (true) {
                                    switch (str18.hashCode() ^ (-488538350)) {
                                        case -1003032694:
                                            String str19 = "ۙ۠۫ۜۢ۠ۙۦۖۡۗۘۨۛۖۘۘۡ۠۠۠ۥۛۦۧۜۘ۟ۡ۟ۙۘۘۘۨۦۘۘ۟ۜۚۢۚۚۚۜۨۛ۬۟۠ۘۘۘۨۚۙ۠ۙۦۤۛۧۧۘۘۘۨۨۡۘۘ۬ۖۘۥۥۙۢۜۥۘۨۡۖۘۚ۟ۖ";
                                            while (true) {
                                                switch (str19.hashCode() ^ (-1656822616)) {
                                                    case -1793364611:
                                                        str18 = "ۢ۠۫ۧۚۖۜۢۜ۠ۦۢۨۗۜۛۙۖۘۘۧۙۦۧۨۘۖ۫ۢۙۧۙۗۗۡۘۧۡ۫ۙ۠ۧ۫ۢۡۙ۬۫ۜۨۧۘۦۛۜۘۨۜۡۨۜۜ۬ۡۤۧ۬ۥ";
                                                        break;
                                                    case 993017056:
                                                        str19 = "ۘۖۖۘۘ۟ۗۤۘۦۧ۬۫ۧ۬ۛ۬ۨۜۘ۟ۖۙۚۥۘ۟ۧۡۙ۠ۦۥۜ۠۫۬ۡۨ۟ۦۘ۬ۤ۟ۙۜۘۖۛ۬ۖ۬ۦۖۛۡۡۖ۫۟ۥۡۘۨۡۡۘ۟۫ۖۛۡۨۖۜۘ";
                                                        break;
                                                    case 1342216503:
                                                        str19 = jSONArray2 != null ? "ۗ۠ۦ۠ۦۤۤۨۘۢۜۥۦۥۙۙۡۧۦ۬ۚۡۡۛۙۛ۬ۥۖۘۘۢۤ۫ۛۢۘۘۛۤۘۤۦۗۤ۠ۛۖ۫ۧۙۢۨۗۛۡۘ" : "ۦۙۤۖۦۧۚ۠ۦۤۤۜۛۘ۫۠ۨۙۥۘۚۜۥۗۗۡۡۢۡۢ۠ۤۖۦۨۘ۟ۤۡۖۢۚۖ۠ۘۗۖۨۘۚۙۨۘ۬ۚۦۘۙ۬ۖۚۛ۬ۡ۠ۚ";
                                                        break;
                                                    case 1723051529:
                                                        str18 = "ۙ۠ۥۘ۠ۨۘۘ۫ۘۘ۫۟ۦ۠۠۬ۖۚۖ۟ۖۡۡۙۨۤۦۥ۬ۧ۬ۖۗۚۨۢۥۙۧ۠ۥۙۡۘۢۦۥۧۙۤۘۚۦۘ۟ۛۡۚۤۤ۬ۜۢۚ۟ۜۘ۫ۥۡۜۘۢۘۤ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -83045980:
                                            str17 = "ۖۡۨۢۛۥۢۚۙۡۧۖۘ۬ۗۜۘۙ۟ۡۘۨۡۥۙۨۜۘ۟ۚۧۨۘۚۙۧۜ۫ۧۜۘۦ۠ۡۡۦ۠۬۟ۨۘ";
                                            break;
                                        case 1108947656:
                                            str17 = "۬۫ۥۘۘۤۖۘۡۘۧۘ۟۬۬۫ۤۚۥۗۨۘۨۧ۫۬ۗۨۘ۬ۡۜۘۘۢۥۛۖۚ۫ۨ۠ۤۤۖۙۦۗۡۨۦ";
                                            break;
                                        case 1489104238:
                                            str18 = "ۧ۟ۤۚۘ۫۟ۥۜۡۤ۬ۦ۠ۛ۠ۡۦۢۘۦ۬ۙۜۚۛۧۨۜ۫ۘۙۘۙۛۗۖۦۨۘۧۦۡۘۙۛۛۚۦۤۖۧۖۘۖۥ۟ۙۛۢۨۢۢ۟ۖۛ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 952911309:
                    str = "ۜۤۛۖۙ۟ۚۢۘۘۘۘۧۘۡۙۥۘۜ۫ۨۘۡۨ۠ۗ۫ۦۘۢۛۜۚۗ۫ۗ۬ۗۖۧۚ۬ۙۥۘۗ۫ۦۡۘ۫۟۟ۗۘ۟ۨۘۦۨۢۨۡۖ۟ۖۗۢۜۥۘۜۢۚ۫ۤۢۛۗ۫";
                    jSONArray2 = jSONArray;
                    break;
                case 1052397215:
                    jSONArray = null;
                    str = "ۘۙۚۜۛۢۛۨۢۛ۟ۤۜ۠۫ۥۜۘۧۦۜۘۘ۠ۨۜۜۘ۟ۙۤۜۥۘۢۡۘۘۙۗ۫ۛۛۥۘۨ۬ۖ";
                    break;
                case 1169352545:
                    String str20 = "ۚ۬۬ۤۗۜۘۚۘۤۙۘۛۚۧۛۧۢ۫۟۫ۢۢۢ۟ۤۛۡۥۧۘۜ۟ۢ۬ۙۨۘۡۘ۫ۚۡۘ۬۟ۚۤۤۛ۫ۘۤۢۦۖۘ";
                    while (true) {
                        switch (str20.hashCode() ^ (-1158590405)) {
                            case -1319608032:
                                str20 = "ۛۧۘۛۙۦۘۙ۠ۜۢۗۦۜۦۘۢۧۖۗۛۜۡۗۛۡۦۛ۠ۢۜۦۘۘۥ۫ۦۨۚ۟۠ۤ۬ۙۦۘۨۜۘۦۡۡۘۙۦۥۘۘۤۘۘۙۙۤۚۧۛۘۗۚۧۨۘ۟ۦۤ";
                                break;
                            case -262507890:
                                str = "۬۬ۧۦ۠۠ۖ۫ۗ۠ۘۦۘۘ۠ۘۗۤ۠ۛ۫ۚۦۤۚۥۖۖۘۨ۟۟ۗ۬ۖۤۖ۠ۚ۠۫ۚۗ۬ۗۡۘۡ۫ۧۨۢۦۘۧۘۘۚۙۙۙۙۘۙۤۤ";
                                continue;
                            case -225957987:
                                String str21 = "ۚۛۦۘۧۘ۬ۜۢۖۧۡۙ۠ۖ۟۬ۥۧۚ۬ۡۘۜۥۦۥ۬ۥۘ۫۫ۡۘ۟ۚۡۗ۫ۦۛۨۢۡ۬۠۟ۦۧۖۡۘۦ۫ۗۘۤۦۘۤۥۦۘ۫۠ۥ۬۟ۚ";
                                while (true) {
                                    switch (str21.hashCode() ^ 1336173215) {
                                        case -516503741:
                                            str20 = "ۢۢۦۜۥۦ۟ۤۙ۬ۗۜۗۖۥۘۥ۫ۦۡۘ۫ۚۖۜۘۥۙۨۘۖۛۘۚۢ۬ۡۨۜۛۦۘۨۢ۟ۚۚ۫ۗۥۥۦۥۙ۟ۨۘۡۥۤ۠ۤۛۗۙۤۧۥۖۨۦۘۡۡۡ";
                                            break;
                                        case -41172348:
                                            str21 = "ۦ۬ۨ۬۠ۚۦ۬ۖۘۘ۠ۥۤ۫ۦۙۛۥۛۗۢۢ۟ۦۨۜۡ۟ۥۥۘۦۡۖۘۚۢۥ۠ۛ۬ۨ۬ۨۘۧۥۜۧۘۦۘۥۚ۬۫ۗۜۘ۬ۜۦۘۨۙۙۚ۟ۖ";
                                            break;
                                        case 319522907:
                                            str20 = "ۦ۟ۜۘۗۧۜۘۤۦۢ۟ۜۥۡۤۘ۫ۜۙۙ۬ۡۢ۬ۖۘۜۨۘۤۦۛۗۨۥۦۜۗۜۧۜۛۨۨۤۦۚۡۧۥۢ۠ۨۘۘۖ";
                                            break;
                                        case 1393979495:
                                            String str22 = "ۗۛۡۘۜۦۜۘۚۦۙۨ۫۠ۤۙۨ۠۟ۘ۫ۧ۟ۗۥۚۙۢۨۤۛۡۘۦۦۨۢۡ۠ۘۡ۠ۙۦۘ۫ۙۛ";
                                            while (true) {
                                                switch (str22.hashCode() ^ 1106283028) {
                                                    case -1562142777:
                                                        str22 = "ۧۨۦۘ۟ۧۦۥۙۖۘۚۧۧۥۦۙۢۥۘۧۧۖۘۖۚۢۢ۟ۜۘ۬ۗۡۘۧ۠ۗۜۤۖ۬ۖۘۘۥۥۙ۟۠ۗۚ۠ۙۗۤۖۖۧۘۜۛۥۘۖۨۛ۟۠۬ۡ۫ۙۧۚ۠ۢۜ";
                                                        break;
                                                    case -1237834680:
                                                        str21 = "ۙۢۘۨۚ۫ۤۥۦ۟ۛۤ۫ۡ۬ۦۖ۬ۥ۠ۚۥۖۥۨۛۜۘۤۧۛ۠۟ۧ۫ۖۘۧۚۡۘ۠ۨ۬۬ۖ۫ۙۙ۠ۢۤۘ۬ۚۨۘۢ۟ۦۡۢ۫ۖۚۡۘۖ۟ۨۨۧۡۘۢۜۖ";
                                                        break;
                                                    case 1098563495:
                                                        str22 = zM1166 ? "ۡۨۥۘۗۙۢۜۗۜۧۛۦۚۗ۟۟ۥۦۜۙۤۨ۫ۖ۫ۜ۬ۙۢ۫ۛ۬ۨۡۨۗۘۛۜۚۜۘۢ۟ۥۘۖۢۧۤۙۛۙ۠ۜۘۙۖۥۘۦۙۘۚ۟۫۟ۛۖۘۢۛۢۖۖۦۘۤ۫۫ۡۙۘۙۖۜ" : "۠۫ۦۘ۠ۚۡۘۦۧ۫۠ۨۜۘ۠ۡۢۘۤۖۙۘ۠ۧۡۜۘۖۜۨۢۘۜۥۦۜۘۙۙۘۜۦۘۘۤۛۨۛۜۤۡۙۙ۟ۙ۬ۨۦۘ۠ۗ۠ۦۙۡۡ۬ۥۧۖۘۥۡۥ۟۫ۗۚۗۜۘۜۧ۠ۡۚۗ";
                                                        break;
                                                    case 1335644113:
                                                        str21 = "ۚۛۦۘ۬ۙ۫ۧۗۚۢۢۗۗ۠ۘۘ۟ۖۧۢۜۤۤۢۜۘ۟ۘۗ۫ۤۨۘۖۨۖۘ۟ۜۧۡۘۘۘۧۧۢۥۚۨۘ۫ۜۖۘ۫ۖۦۘۖ۫ۦۥ۬۠ۚۨ۠ۛۧۢ۟ۘۥۘۢۚۗ۟ۚۡ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 1723592676:
                                str = "ۖ۠ۖۘ۠ۛۥۘۙۥۨۘۘۗۢۦۘۨۢۚ۠ۢ۫ۗۦۛۤۥۨۘۚۨۛۧۨۚ۟ۙۛۤۦۧۘۡ۬ۖۘۚۦۡۤۜۜۦ۫ۗۡۨۘۘۜ۫ۛۖۗۜۘۜۦۧۘۙ۟ۜ۟ۧۖۘۗۗۡۧ۠ۖۘۙۧۧ۠ۢۨۘ";
                                continue;
                        }
                    }
                    break;
                case 1220072873:
                    C0341oa.m915(new byte[]{113, 56, 77, -60}, new byte[]{27, 75, 34, -86, 65, -18});
                    str = "ۧۡۦۘۡۜۨۘۗۦ۫ۧۖۧۘۛۧ۫ۥۢۖۘ۬ۜۘ۟ۙۗۙ۟ۙۦۜۨۘۗۘ۟ۙۢ۟ۛۤۚ۟ۘۗۗۦۘ۠ۥ۟ۢۖ۟ۙۙۡۘۜۙۢۧ۬ۦۦۚۨۘۧۧۥۥۛۧۚۛۡۘ";
                    break;
                case 1374415373:
                    C0237h4.m1090(C0341oa.m915(new byte[]{100, 61}, new byte[]{13, 73, -46, 121, -43, 52}), jSONObject2);
                    str = "ۥۧۙ۬ۦۢۡ۫ۘۘۚۛۜۛۜۙۘۛۡ۬ۤۡۖۧۜ۠ۡۥۤۚۨۖ۬ۥۘۧۢۢۨۜۢۦ۟ۙ۫ۗۗ";
                    break;
                case 1767082402:
                    jSONArrayOptJSONArray = jSONObjectOptJSONObject.optJSONArray(C0341oa.m915(new byte[]{107, 106, -46, -112, 101}, new byte[]{2, 30, -73, -3, 22, 90}));
                    str = "ۧۜۨۘۢ۫ۛۚ۬ۨۥ۬ۡۘۦۥۦۘۨۨۘۛۖۚۛۘ۠ۚۦۜۚۘۘۧ۟ۨۨ۠ۜۜ۫۫۬ۥۙۥۖ";
                    break;
                case 1834469474:
                    str = "ۢ۫۠۬ۧۗۙۜ۟ۧۢۘۨۨۜۢۢۜۜۗۚۡۙ۫ۦۧۥۧ۠ۛۤۙۥۙۤۘۘ۠ۤۛۢۡۤ۟ۢۦۖۡۖۤۖۡۦۡۖ۟ۛۧۖۢۖۨۦۤ۬ۗۥۗۜۜۘۥۧۘۧۡۘۚۘۘۘۤۙۛ";
                    break;
                case 1852800970:
                    str = "۠۟ۚ۫ۥ۬۫ۚ۠ۤ۟ۚ۫۫ۦۡۨۗۚۖۘۡۙۥۨۙۗ۠ۧ۠۠ۡۘۘ۫ۧۦۘۤ۬ۨ۬ۧۙۚۙۤۢۡۡۘۗۦۤۛۡۧۛ۠ۨۘۦۨۜۘۡۢ۫ۚ۠ۡۘۜ۫ۥ۠ۢۤ";
                    break;
                case 1908341451:
                    str = "۫ۜۜۘ۬ۤۛۨۤۜۘ۫ۧۦۘۦ۠ۨۘۨۦۖۚۙۦۢۤۨۘۛۖۢۗۡ۠۫ۡۢۖۢ۬ۤ۠ۦۘۤۨۖۜۚ";
                    jSONObject2 = jSONObject;
                    break;
            }
            return jSONObject2;
        }
    }
}
