package p001;

import de.robv.android.xposed.XC_MethodHook;
import de.robv.android.xposed.XposedBridge;
import de.robv.android.xposed.XposedHelpers;
import java.lang.reflect.Method;
import java.util.Arrays;
import java.util.Set;
import p001.AbstractC0149b0;

/* JADX INFO: renamed from: ۟.r3 */
/* JADX INFO: loaded from: classes.dex */
public final class C0373r3 {
    /* JADX INFO: renamed from: ۥ */
    public static final Object m926(Object obj, String str, Object... objArr) {
        boolean z;
        boolean z2 = true;
        C0237h4.m1090(C0341oa.m915(new byte[]{77, -123, 100, 5, -30, -98}, new byte[]{113, -15, 12, 108, -111, -96}), obj);
        C0237h4.m1090(C0341oa.m915(new byte[]{31, -36, -95, 17}, new byte[]{126, -82, -58, 98, -127, -88}), objArr);
        String str2 = "۟۠۟ۤۦۘۘ۟۟ۚ۫ۤ۬ۦ۟ۜۨ۬ۖۘۨۙۛۧ۬ۡۧۖۖۢ۫ۦ۟ۥۦۖۘۢ۠۠ۡۧۧۙۧۖۘۢۦۖۧ۫ۤۡۥۙ";
        while (true) {
            switch (str2.hashCode() ^ (-1573588827)) {
                case -1841293045:
                    String str3 = "ۦ۟ۙۚۦۨۘۨ۟ۗۦ۫ۧۘۧۢۛۥۙۦ۟۬ۦۜۖۛ۟ۦۚۖۘ۫ۘۘۥۥۡۘۥۨ۠ۚۖۘۘ۟۟ۦۚۜۛۢۜۖۦۗۘۘۗ۠ۥۤۧۡۘۨۗۖۜۘۚۜۦۦۘ۫ۘۥ";
                    while (true) {
                        switch (str3.hashCode() ^ 181089663) {
                            case -1256862386:
                                String str4 = "ۢۜۨۘ۠۬۬ۜۥۧۦ۠ۨ۠ۤۖۘ۫ۡۘۘۘۗۥۘ۟ۢۛۙۜۚۜۘۙۥۖۤۡۘ۠ۢۥۡۘۤۙ۫ۢۥۧ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1779181827)) {
                                        case -1807832228:
                                            str3 = "۫ۙۚ۬ۧۥ۬ۘۧۦۖۦۦۖۦۡۘۧۘۜ۟ۥۘ۬ۧ۠ۗۛۤۧۨۘۘ۠۫۬ۙ۫ۡ۫۠ۛۡ۫ۜۘۗۨۜۥ۫ۥ۠ۘ۫ۧ۠۬ۗۘۛ۫۟ۘ۬ۨۦۡ۟ۥۙۢۙ۫۠ۡۡ۟ۤۛۙۚ۫ۨۘ";
                                            break;
                                        case -1760956363:
                                            str4 = str != null ? "ۚۛۡۗ۫ۖۘۗۡۢۗۗ۠ۘۚۦۜۖۤۛۧۤۡۥۜۡۧۘۘۧۤۥۘۨ۠ۦۘۗ۠ۨۚۖ۠ۙۖۛ۫ۙ۬ۖۧۨ۬ۢۛۢۚۥۘۥۛۡۥ۟ۜۙۡ۬۠ۥۨۨۛۨۘۢۙۥۘۗ۠۬ۚۦۚۧۗۜ" : "ۤۗۨۛۡۚۚۚۨۘ۬ۤۡۘ۟۫ۖۘۘۨ۬ۖۨۙۧۛۦۖۧۡۘۖ۟ۘۨۖۦ۟ۥۡۖۨۜۖۚۥ۟ۨۚ";
                                            break;
                                        case -1436991295:
                                            str4 = "ۧۦۜۘ۫ۢۨۨۧۜۘۧ۠ۢۤۗۦ۬ۙۛ۟۟ۨۘ۬ۖۜۤۜۙۗۗۤ۬ۗۢۚۖۧۘۖۨۖۘۤ۫ۦۧۖۛۗۥۚۖۘ۟ۘۗ۟ۨۨۢۗۧۖۘۡۡۡۘۖ۠ۘۘ۬۫ۧۥۚۥ";
                                            break;
                                        case 406920726:
                                            str3 = "۟ۙۡۘۙۧ۠ۗۤۖۜۙۜۨ۠ۢۛۗۥۘ۟ۙۖ۟ۚۢ۫ۨۖۛۡۥ۟ۛ۬ۚۢۧۖۨۡۦ۫ۥۥۢۨۜۙۨۘۗۖ۫ۤۚۜۘ۠ۡۘۥۤ۠ۤۖۚۥۛۢۙۖۘ۬ۢۘ";
                                            break;
                                    }
                                }
                                break;
                            case -353461832:
                                str2 = "۫ۨۙۥۙۥۘۗۘۘۗۗ۟ۚۛ۫ۥۘۧۢ۬ۛ۟۟ۘۘۙۦۧ۟ۗۜۘۧ۠۬۠ۧ۟ۨۢۡۥۦۤۚۨۙۨ۫ۙۥۖۦۘۥۧۘۗۛۧۜ۠ۖۗۛۗۚۢ۠ۛ۬ۙۤۤۜۘ";
                                continue;
                            case 574058065:
                                str2 = "ۡۧۦۢۥ۬ۢ۬ۚۘ۠ۜ۫ۡۥ۟ۚۜۘ۠ۙۖ۬ۛ۬ۡ۫ۜۘۗۤۥۤۖۤۨۘۙۡۦۡۧ۬ۘۘ۠ۚۨۡۤۢ۟ۘۧ۠ۧۦۡۥۥ۬۠ۧۘۗۥۧۥۤ۬ۢۘۨۦۘۘ";
                                continue;
                            case 1499925208:
                                str3 = "۫ۦۧۘ۟ۖۡ۬ۘۡۛۥۗۘۙۧۜۘۖۘۚ۬۟ۗۙۖۘۜۖۦۧ۟ۙۧۚۤۘۧۥۘۖۧ۟ۤۙۡۘۚۡۛۡۦۦۗۖ۟۬۬ۛ";
                                break;
                        }
                    }
                    break;
                case -696136290:
                    break;
                case 1030687774:
                    str2 = "۬ۥۧۚۗۜۘ۬ۜ۟ۘۜۥ۟ۚۦۘ۟ۛۜۢۚۚۨۚۙ۠ۛۥۤۥۧۘۚۦۚ۫ۥۘۡۤۙ۟۫ۨ۠ۦۚۗۚ۬ۦ۫ۦۗۚ۫ۤۨۘۥۨۧۥۢۚ";
                    break;
                case 1671853883:
                    String str5 = "ۨۥۖۛۧۨۚۚۥۘۥۢۥۜۢۗۧۜۙۘۜۧۜۡۘۘ۫ۧۦۘۥۥۖۘ۬۬ۚۖۨۢ۬۠ۙۡۥۗ۫ۖۥۘۨۥۜۢۖۧۚ۬ۘۥۙۢۛ۠ۤۤۖۦۘۢۡۡۘ۬ۥ۠ۦۧۜۘ";
                    while (true) {
                        try {
                            switch (str5.hashCode() ^ 1301616568) {
                                case -877918265:
                                    z = true;
                                    break;
                                case -312365252:
                                    str5 = "ۦۡ۫ۚۚۢۨۗۨۘۦۤۦۘۘۘۧۘۧۧۖۘۨۘۘ۠ۚۦ۫ۤۜۘۨۙۛ۠ۡۡۘۦۡۥۡۡۨۘۦۧۜۘۨۨۨۦۡۘۖ۫ۡۘۚ۟ۡۘ";
                                    continue;
                                case 1459424964:
                                    String str6 = "ۚۛ۫ۘۘۢۗۘۗۛۙۦۘۡ۬ۦۧۙۘۘۜۦۡ۟ۚۤ۠ۖ۫ۙ۫ۡۘۘۜۘۧ۠ۡۘۤۖۖۖ۟ۙۦ۟۫۬ۥۢۖۧۘ۟ۛۤۜ۟ۙ۬۟ۖۘ۬ۧۜۘ";
                                    while (true) {
                                        switch (str6.hashCode() ^ 563299863) {
                                            case -1897634320:
                                                String str7 = "۟۠ۦۢۦۨۗۙۡۘ۫ۦۨۙۘۜۙۨۜۘۙۧۜۘۜۗۚ۬ۦۜۙ۫۠۫ۥۜۘۘۚ۬ۢۨۛۢ۟ۚۨۘۘۘ";
                                                while (true) {
                                                    switch (str7.hashCode() ^ (-1593045038)) {
                                                        case -659968291:
                                                            str6 = "ۥۙۚۖۡۦۘ۠ۚۖۘۜۡۧۨ۠ۦۘۚۨۗۥۦۙۡۥۘ۠۟ۢ۟۫۠ۦۘۡ۬ۦۢۧۘۜۘ۠ۖۧۘ";
                                                            break;
                                                        case 579854904:
                                                            str7 = "۟ۗۥۘۨ۫ۡۨۤۦۤ۬ۦ۬ۙۛۨۙۧۖۙۜ۫ۖۦۦ۠ۙۜۤ۬ۖ۫ۧۨۜۦۧ۠ۥۛۨۛۗ۬ۖۘ۫ۤۚۚۜۡ۬ۘۥۘۘۧۙ۠ۘ۬ۡۡۘ۬ۦۦ۟ۚ۬ۢ۟ۜۘ";
                                                            break;
                                                        case 1017451916:
                                                            str7 = str.length() > 0 ? "ۧۗۗۤۧۢۘۖ۟ۖ۫ۧۗۥۘۘۦۥۙۧۚۨۦۖۜۘ۬ۘ۠۟ۗۛ۬ۤۤۜ۬ۨۘۤ۫۫ۡۡۦۚۜۜۘۗۚۨۘۥ۠ۖۘۨۛ۫۟ۤۙۜۙۛۘۡۡۘۨۜ۠ۛۗ۬ۡۘۘ" : "ۗۜ۫ۢ۟ۥۦۗۨۚۙۘۘۚۖۘۜ۬۫۟۫ۘۨۛۗۤ۬ۗۚۘۘۛ۫ۦۘۦۙۘۖۖ۫ۛۖ۠ۘ۬ۨۘۗ۠ۜۙۘۜۘۦ۫ۘۘۤ۫ۢ۫ۘۥۘ۬ۦۖۘ";
                                                            break;
                                                        case 1570854482:
                                                            str6 = "ۥۤۤۧۖۦۙۧۨۨ۟۟ۧۡۢۘۙۜۨ۠۬۫ۜ۫ۢۜۦۘۜۛۦۘۨۖۨۘ۟ۧۨۚۨۢۢۥۡۘۡۡۧۘ";
                                                            break;
                                                    }
                                                }
                                                break;
                                            case -1619028191:
                                                str5 = "ۡ۟ۢۤۚۜۘۡ۫ۜۘۚۚۜۘۢۜۤۚۥۢ۟۠ۜۜۜۡۘۗۘۨ۫ۛ۟ۖۥۤۛۦۧۚۨۖۖۚۡۤۜ۠۫ۦۖۙۥۥۘ۬۬۫ۚۢۖۥۡۦۘۦۜ۟ۤ۠ۙۛۢۘۘۨۡۢ";
                                                continue;
                                            case 315974020:
                                                str5 = "ۢ۠ۙۖۦۘۘۙۗۡۘۙ۠ۜۗۙۘۦۘۖۘۗۜۢۨ۟ۜۘۖۥ۠ۖۦۛۥ۫ۚۛۨۥ۫۬ۜۚۡ۬ۚۤۚۚۚ۟ۖۜۢۧ۬ۖۗۛۛ۟ۘۧۛۦۜۥۨۚۙ۠ۖۘ۠۠ۗ۠ۧۡۖۢ۬ۚ۬ۖۘ";
                                                continue;
                                                continue;
                                            case 1497337860:
                                                str6 = "۫ۨۥۧۧۛ۠ۢۚۡ۫۠ۨۘۛۙۦۘۢۤۥۡۦۦۗۗۖۤۗۖۙۨۛۗ۠ۧ۫ۖۥۡۙ۫۟ۧۡ۫۟ۨۤ۠ۦۛۥۘۖ۫۬ۧۙۗۤ۬ۡۘ";
                                                break;
                                        }
                                    }
                                    break;
                                case 1702794210:
                                    z = false;
                                    break;
                            }
                        } catch (Throwable th) {
                            StringBuilder sb = AbstractC0149b0.f695;
                            AbstractC0149b0.a.m817(th);
                            break;
                        }
                    }
                    String str8 = "ۢۥۤ۬ۙۢۨۢ۠ۥۤۨۚۤۡۚ۠ۗۢۤۧۤۜۚۤۙۗ۟ۗۢۤۜۧۤۗۥۢۡۚ۫۬۠۬ۦۘۘۨۙۢۤ۠ۜۦۖۘۜۙۜ۠۟ۛۖۜۘۘۤۖ۟ۤۥۨۘۘۙۚ۟ۗۜۘۢۘ۬۫ۢۖۘ";
                    while (true) {
                        switch (str8.hashCode() ^ (-908130308)) {
                            case -1617701042:
                                break;
                            case -1607555567:
                                str8 = "ۨۢۢ۫ۖۘۨ۬ۖ۫۠ۗ۫ۧ۠۬۠ۙۤۗ۫ۦۖ۠ۧۤۜۧۛۜۘۖۜ۫ۚۦۨۘ۫ۨ۠۠ۤۘ۠ۢۛۖۚۗۙ۟ۙۜۡ۟";
                                break;
                            case -354100793:
                                String str9 = "ۤۚۡ۬ۤۙۧۗۧ۬ۖ۫ۜ۬ۖۖۡۢۗۥۡۥۜۡۥ۟ۡۘۙۛۨۢۦۖۘۤۖۘۚۡۗ۬۟۬ۚ۟ۥ";
                                while (true) {
                                    switch (str9.hashCode() ^ 506672873) {
                                        case -1789723150:
                                            str8 = "ۤۡ۬ۘۡۘ۫ۧ۠ۚۤۨۘۜۢۘۡ۟ۢۧۗۦۘۤۦۡۚ۬ۨ۟ۨۘۙۘۨۘۤۗۧۧۛۤۚ۟۠ۥۙۦۤۡۨۤۚۖۖۛۦ۟ۚۨۜۚۧۡ۟۫";
                                            continue;
                                        case -1263528243:
                                            String str10 = "ۦۙۜ۟ۥ۠۫ۚۗۡ۫ۦۗۥۖۥۘ۫ۢۛۛۙۜ۟ۧۗۡۤۜۗۛۗۦۥۡۘ۫ۗ۫ۚۖ۠۟ۙۥۘ";
                                            while (true) {
                                                switch (str10.hashCode() ^ 1241815432) {
                                                    case -1839827052:
                                                        str9 = "۫ۧۧۡۘۘۢۘ۬ۚۢۘۢۨۦۤۡۙۜ۠ۥۘۡۚۨۥۘۢ۫ۜ۬ۨۚۘۘۖۖ۠ۥۙ۬ۜۦۘۜ۬ۨۘۛۖۤۨۗۢۥۙۨۛۙۦ۠ۚۜۦۜۘۥ۬ۚ۫۟۟ۡۢۜ";
                                                        break;
                                                    case -1206472468:
                                                        str10 = "ۧۦۚۧۛ۬ۙ۫ۙۦۛۘۧۦۨۘۢۤۨۘ۬ۛۡ۬۟۟ۛ۠۠۫۟ۗۙۦ۫ۤۜۘ۫ۡ۟ۡۚۦۚۛ۟";
                                                        break;
                                                    case -1083235082:
                                                        str9 = "۫ۜۖۘ۬۬ۜ۟ۡ۟۫ۧۥۛۥۥۛۚۥۘ۫۬۟ۤ۟ۗۧۢۦۦۢۥۗۘۜۘۘۙۤ۬۫ۨۚۨ۫۬۫۟ۧۚ۠۠۫۬ۡۥۦۨۡۘۧۗۛۨۥ";
                                                        break;
                                                    case -84233975:
                                                        str10 = z ? "ۥۗۙۖۧۨۛ۠ۡۘ۟ۖۖۘۦۙۡۖۨۥۘۘۙۘۗۗۜۘ۟۬ۨۘ۠ۜۥۦۨۘۨۙۘۢۛۗ۠ۜ۫ۛۙۘۘۧۦۡ۬ۡۜۘۧۥۖۘۛۖۘۡۗۨۘۘۦۛ۬ۧۦ۫ۥۦۘ۬۠ۙ" : "ۦۧۘۘۤۦۙ۬ۘ۫۬ۙۡ۠ۖۤۧۨۖۙۢۨۛۜۖۘۖۗ۠۬ۙۘۘۖۥۘۘۧۦۘۜۚ۟ۖ۫ۥۨۙۨۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -236234028:
                                            str8 = "ۗۙۡۚۚۨ۬ۚۦۘۚ۠ۜۥ۫ۖۖ۬ۖۡ۫ۨۘۢۥۡۘۗۜۨۘۖۥۥۦۧۢۗۧۖۧۧۤۖۢۥۘ۟ۜۜۘۢۤۦۘ۟۬۟ۦۙۤۦۛۢۥۢۖۘۢ۫۠ۤ۫ۖۘۨ۬ۥۘۢۨ۬ۙۙ۬ۚ۟ۙۡ۬ۥۘ";
                                            continue;
                                        case 238007408:
                                            str9 = "ۗ۫ۗۨۡۧۦۚۚۘ۠۬ۨ۫ۜ۫ۨۙ۠ۖۦۘۗ۫ۘۘۛۡۚ۫ۨۗۨۡۘۚۥۥۘۥۘۧۤۥۨۘ۫ۙۡۘ";
                                            break;
                                    }
                                }
                                break;
                            case 1543565051:
                                break;
                        }
                    }
                    break;
            }
        }
        z2 = false;
        String str11 = "۟ۜۧۘۡۡ۫۬ۖۛۤۖ۠ۧۛۜۥۥۗ۟ۜۗۢۚۗۜۡۥۘۢۢ۫۠۫ۤۢۡ۫ۗۖۜۘۙۛۜۢۘۡۘ";
        while (true) {
            switch (str11.hashCode() ^ (-957520487)) {
                case -705751082:
                    str11 = "ۦۗۖۘ۠ۖۨۘۤۥۨ۟ۖۚۨ۠ۖۙ۠ۗ۬ۘۘ۬ۤۖۙۚۨۜ۬۫ۜۙۦۘ۠ۘۨۗ۬ۖۧ۠ۖۘۧۛۗ";
                    break;
                case -670335801:
                    break;
                case 1109425794:
                    return XposedHelpers.callMethod(obj, str, Arrays.copyOf(objArr, objArr.length));
                case 1585841837:
                    String str12 = "ۧۛۜۨۡ۠ۢۢۦۨ۠ۡۘۗۚ۟۠ۥ۠ۨۙۥ۫ۙ۠۫ۗۗۧۙۦۖۤۖۘۨۘۖۜۛۢۛۢۛ۠ۜۘۡۘۜ۠ۦۖۥۘۘۦۡۗ۟ۨۜۡۧۗ";
                    while (true) {
                        switch (str12.hashCode() ^ (-637401244)) {
                            case -2088998539:
                                String str13 = "ۢۛۛۚ۬۬ۜ۫۫ۖۙۦ۠ۙۥ۬ۛۧۖۖ۫ۛۘۖۘۙۖۨ۟ۦۦۗۛۚۦۖۡۧ۟ۦۖۤ۬ۗۦ";
                                while (true) {
                                    switch (str13.hashCode() ^ (-380504622)) {
                                        case -1641169300:
                                            str12 = "ۨۛ۠ۥۧۗۗۘۡۘۡۙ۬ۚۧ۟ۡۨۚۤۨ۠۫ۚۢۥۜۗۖۘۚۥ۫۫ۙۢۥۜۡۘۚۧ۠ۢۡۢۜ۟ۖ۬ۧ۬ۤ۠ۥۘ";
                                            break;
                                        case -892654625:
                                            str13 = z2 ? "۠۫ۡۘ۠ۢۢۙۥۧ۫۬ۙۘۖۘ۠۠ۙ۬ۡ۟ۨۨۗۨۤۜۘۙۨۡۘۛۤۡۘ۬۫ۧۨۘۜۘۤۛۡۡۦۥۦۧۚۧۦۜ۟ۡۥۖ۠ۜۜۜۘ۬ۘۡ۫ۚۨۘۤۤۚۦۡۦۥ۟ۖۢۜۖۥۡ۬" : "ۘۘۨۘۢۧۢ۠ۚ۟ۢۦۘۖۤۤۘۤۛۗۜ۫ۜۤۗ۫ۖۥۘۧۧۨۛ۫ۛۚ۠ۜۦۙۘ۠۫۟ۘۡۘۛۧۗۘۙۜۡ۟ۡۘۨۧۡ۬۫ۧۙ۬ۤ۠ۥۛۜۘ۠ۖ۫ۢۙۨۙۥۜۨ۫ۜۘ";
                                            break;
                                        case 558267735:
                                            str12 = "ۜۥۙۗ۟ۢۡۨۙۘۛۖۘۦۜۧۦۘۢ۠ۚۖۖۦۖۚۖۘ۟ۨۜۘ۫۠ۨۤۖۥ۠ۜۖۘۡ۬ۦۘۚۛۨ۫ۤۡ۟ۤۘۚۧۘۘۡۗۦۘۧۗۖۥۤۖۙۡۢ۬ۗۘ۫ۨۚۤۧ۫ۨۘۙۤ۫";
                                            break;
                                        case 1330610809:
                                            str13 = "ۛۙۦۘۜۨۚۨۥۙۛۥۢۥۤۥۡۦۘۨ۫۫ۥۨۙۜۗ۟۟ۤۥ۟ۜۧۘۨۢۨۘۛۛۛۛۤۜۧۛۘ۫۫۫۠ۦۡۘۜۦۜۛ۟ۥۘۛ۠ۦۙۜۥ";
                                            break;
                                    }
                                }
                                break;
                            case -1010769788:
                                str12 = "ۢ۟ۗۢۨۤۜۖۘۘۜۛۥۢ۫ۡۨۨۘ۠ۦۖۘ۬ۨۛ۫ۦۥۘ۬۟ۧۘ۬ۛۙۘۘۘ۬ۢۘ۫ۨ۬۟ۗۦۘ";
                                break;
                            case 1718185521:
                                str11 = "ۢۛۨۘۛۛۖۘ۟ۘۜۘۦۦۡۘۚۚۦۨۗۧۜۛۚۗۡۚۖ۟ۡۘۥۧۚ۟ۖ۬ۢۨۤۢ۬ۢۜ۟ۗۘۢۜۖۡۛۖۘ۟ۘۖ";
                                continue;
                            case 1931174722:
                                str11 = "ۦ۠۟ۘۢۜۧۥ۟ۤ۠ۘۘۥۢۚۧۥۥۘۦۙۦۘۤۚۘۘۦۛۙۧۙۡۧۥۦۨۘ۠ۘۥۛۛۚۨۤۚۢۤۨۡۘۧۚۥۢۘۥۘۘ۫ۥۙۘۚۜ۬ۘ۠ۖۧۘ۫۫ۡۘۘۨۤۤ۬ۦۖۘۡۘۙۧۜۘ";
                                continue;
                        }
                    }
                    break;
            }
        }
        return null;
    }

    /* JADX INFO: renamed from: ۥ۟ */
    public static final <T> T m927(Object obj, String str, Object... objArr) {
        String str2 = "۫۫ۛۨۛۧۥۛۡ۟ۥۜۘۧۘۜۗۦۨۚۚۜ۟ۧۧۦ۠ۥۧ۫ۧۖ۬۬۫ۦۥ۠ۖۛۨۘۥۖۜۖ۟ۖ۬۬۫ۤۥ۠";
        T t = null;
        Object objM926 = null;
        while (true) {
            switch ((((((((str2.hashCode() ^ 410) ^ 173) ^ 471) ^ 982) ^ 679) ^ 393) ^ 271) ^ 1722343214) {
                case -2043055354:
                    str2 = "ۨ۟ۖۘ۠ۘۢۙۘۢۦ۠۫۫ۖۨۘ۠۟ۜۘۙۗ۬ۧۦۙۚۜۦۘۖۦۗۥۨۡۘۤ۠۬ۦۘۘۜۚۨۗ۬ۖۘ۫ۡۜۛۜۖ۟ۙۨۘۢۗ۫ۗ۫ۦۡۦۘۥۤۥۘۖۛۗۧۡۘۜۢۨۘۤۢۜۘۚ۫ۡ";
                    break;
                case -1991818165:
                    objM926 = m926(obj, str, Arrays.copyOf(objArr, objArr.length));
                    str2 = "ۥۗۚۘۤ۠ۥۢۨۘۜۘۧۘ۫۟ۜۜۥۡۘۥۢ۫۟ۛۗ۫ۜۘۧ۠ۡۘۢ۬ۦۘۤۡۘۥۙ۠۟ۦۛ۟ۘ۫۬ۜ۟۟۫ۖۘۛۗۥۘۥۘۚ۠ۜۙۨۙۦۘ۟ۤۡۘۚۖۦۥۥۢ";
                    break;
                case -1910443033:
                    str2 = "ۙۖۖۘۘۤ۫ۜۛۦۘۛۧۢۦ۬ۗۥۥ۟ۖ۟ۚۘۘۡۘۚ۬ۘۘۡۨۜۜۡۜۖۛۘۘۨۗۡ۬ۦۤۨۤ۫ۦ۬ۗۛۗۨۦۡۘۘ";
                    break;
                case -1041234191:
                    return t;
                case -853201025:
                    str2 = "ۚ۬ۜۘۧۖۖۘۡۛۥۥۘۨۘ۟ۚۡۢۗۦۢۥۨۥۦۚۚۚۨۨۢۛۘ۬ۜۘ۫ۢۖۘۙۙۗۙ۫ۡۘۨۜۛ";
                    t = (T) objM926;
                    break;
                case -851876014:
                    C0341oa.m915(new byte[]{37, 54, -61, -30}, new byte[]{68, 68, -92, -111, 17, 116});
                    str2 = "ۢۗ۬ۨۘۖۘ۬ۛ۬ۦۢۥۘۘۥۘۖۡۜۦۘۛۡ۟ۙۥ۟۫ۥۙۨ۠ۚۙۥۙۜۧۦۖۜۜۖۘ۬ۢۥ۟ۗۦۘۥ۫۫۫ۜۨ۫۬ۖۘۥۜۜۘۘۤۚۖ۫۫ۚۜۘۧۙ۠ۨۙۨۧۜ۫ۢۢ۠";
                    break;
                case -845511922:
                    String str3 = "ۘۖۨۤۛۜۘۢ۫۟ۘۨ۟ۧ۫ۦۘۢۥۜۘۘۢۤۗۤۜۨۧۧۙۡۗۥۛۨۜ۬ۦۙۥۘۡۖۜۘۡ۟۟ۢۢۨۘۙ۠ۙۢۨۚۜۢۥۘ۫ۚۧۙ۫ۢۘ۠ۢۛۧۤۜۚۖۘ۬ۖۜۤ۫ۧۤۜۘ";
                    while (true) {
                        switch (str3.hashCode() ^ 1755664150) {
                            case -1885261627:
                                str2 = "ۙۨۖۥۗۥۘ۠ۧۘۘۥ۠ۗۨۘۨۘۜۧۖۘ۠ۙۛۤۜۨۜۤۥۘۘ۠ۦۘۙۦۜ۟ۤۘ۫ۢۙ۠ۘۚۧ۫ۚ۟ۡۨۘۗۖ۬ۤ۟ۢۧۦۥۘۜ۬ۜۧۨۦۘ";
                                continue;
                            case -702536889:
                                str3 = "ۦۙۨ۬۬ۜۥ۬۟ۜۚۤۜۖۘۙۖۡۘۜ۠ۖۤۘۙۜۤۙۛۛۧۛ۠ۡ۠ۥۨ۟ۘۦۨۜۨۚۥۥ۫۫ۖ۬ۗ۟ۙۨۘۨۡ۬ۙ۬ۡۘۗۨۥ";
                                break;
                            case -683887756:
                                String str4 = "ۚۛۗۧۙۡۖۨۤۥۥۨۘۡۨۦۦ۠ۘۤۚۨ۟ۧ۠ۨۥۧۘۨۚ۫ۢۗ۬ۗۨۖۘۦۘۥۘۤۢۡۘۢۥۨۘۤۨۖۡۨۡۤۤۘۘۖۧۧ۠ۖۡۘۖۛۡ";
                                while (true) {
                                    switch (str4.hashCode() ^ 348573637) {
                                        case -1765646561:
                                            str4 = "ۡ۬۬ۥ۫ۛۢۥۢۡۢۡۘۚۨ۫ۨۨۗۘۦۢۥۛ۫ۥۜۥۘۥۛۨۘ۟۟ۦۘۤۧۙۨۗۦۖۘۧۘۗۖۘ۠ۘۨ۟ۧۗۦۜ۬۟ۗۜ۟ۧۨۡ۬ۚۜۨۜۘۢۗ۫ۢ۫ۧۨۡۤۙۖۧۘ۠ۦۖۘ";
                                            break;
                                        case -497468098:
                                            String str5 = "ۡۡۘۗۙۧ۟۟ۘۨۦۨۘ۠ۡۢۡۘ۟ۦۘۘ۟۠ۤۤۘۜۘۨۘۜۘۤۤۚۛۛۘۘۚۗۘۚۧ۟ۛۖ";
                                            while (true) {
                                                switch (str5.hashCode() ^ (-1937474066)) {
                                                    case -2057795171:
                                                        str5 = objM926 == null ? "ۜ۫ۙ۟ۜۖۙ۫ۦۘۜۘ۫ۥۢ۟ۖ۫۫ۗ۬۟۠ۛۗۖۚ۫ۦۧ۬ۛۡۘۖ۟ۢۘۘۘۥۚۘۘ۬ۨۜ" : "ۤ۠ۛۗ۬ۥۘۧۥۗ۟ۜۧۘۦۚۥۦۘۙۖۚ۠ۢۦ۟ۛۚۜۦۗۥۙ۟ۥۛۡۥۚۛۙۨ۫۠ۦۨۚ۠ۡ۬ۜۗۨ۫ۖ۠ۖۧۤۖۜۤۛۘ";
                                                        break;
                                                    case -421829697:
                                                        str4 = "ۜۤۦۨۖۘۙۘۤ۫ۚۨۘ۫ۖ۟۠ۡ۫ۡۗۘۘۡۖ۫۫ۧۡۘۙۡۛۘۜۥۘۤۙۨۥ۫ۥ۟ۘۚۙۧۜۘ";
                                                        break;
                                                    case -65451122:
                                                        str5 = "۠ۘۦۘۦ۠ۜۨۜۤ۠ۘۡۘۘۧۢۦۦۤۘۖۧۙۛۜۜ۬ۢۗۢ۬ۡ۫ۥۖ۫ۜۘۤۚۖۢۦۥۥۚۛ";
                                                        break;
                                                    case 930438394:
                                                        str4 = "ۧۡۛۖۦۛۚۨ۬ۥۙۘۖۦۧۤۚۡۘۥۗ۫ۛۛۘ۠ۥ۟ۖۦۦۧۦۨۘ۬۫ۚۧ۫ۗۦۧۡۘۧ۠ۨ۫۫ۚۚۚۥۗۥۙ۫ۤۨۨۤۦۥۖۥۘ۟ۨۥۘ۠ۡۗۗۡۜ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 38390451:
                                            str3 = "ۖۢۡۡۤ۟ۘۧۤۡۛۨۘ۟۠۬ۨۘۤ۠۬ۦۘۜۢۥ۬ۛۙۧ۬ۦۘ۟ۧۥۘ۟ۜۘۘۚۡۙۦۜۥۥۚۡۦۧۘۙۘۨۘۧۗۦۚۢ۟ۥۖۨ۬۠ۗۘۜۦ۠۟ۨۥۧۙ";
                                            break;
                                        case 106548565:
                                            str3 = "ۚۗ۠ۦ۠ۖۘ۟ۖۛ۠ۨۢۙ۬ۖۛۧۦۘ۫ۢۦۘۖ۫۟ۘۥۗۗۗۖۢۖۘۜ۫ۘۛۜۘۧ۠ۡۨۘۘ";
                                            break;
                                    }
                                }
                                break;
                            case 1922482922:
                                str2 = "۫ۨۧۥۦۥۘۛۙۢ۬ۘۦۘۜ۠ۤۤۙۤۨۜۖۤۨۛۤۖۖ۬ۜۨۘ۫ۡۘۙۚۜۘۗۜۘۧۘۜۚ۫ۖۚۧۨۛ۫ۜۘۧ۬ۚۗۚ۟ۤ۫ۙۨۡۜ";
                                continue;
                        }
                    }
                    break;
                case 534972410:
                    C0341oa.m915(new byte[]{57, -106, 104, -56, 102, -3}, new byte[]{5, -30, 0, -95, 21, -61});
                    str2 = "ۛ۟ۥۡ۬ۦۧۗ۠۟ۚۚۛۘۤۙۘۦۛۚۙۨۦۢۡۧ۬ۤ۬ۡۦۤ۬ۘ۟۠۬ۚۘۘۘۡ۠ۢۤۨۘۢۢ۟ۖۚۦۘۗ۬ۜۢۥۥۨۚۗۗۤۛ۫ۜ۠ۚۛۨۘۙۘ۬ۘ۬ۥۘۚۢ";
                    break;
                case 867822626:
                    str2 = "ۙۨۖۥۗۥۘ۠ۧۘۘۥ۠ۗۨۘۨۘۜۧۖۘ۠ۙۛۤۜۨۜۤۥۘۘ۠ۦۘۙۦۜ۟ۤۘ۫ۢۙ۠ۘۚۧ۫ۚ۟ۡۨۘۗۖ۬ۤ۟ۢۧۦۥۘۜ۬ۜۧۨۦۘ";
                    t = null;
                    break;
                case 1665157059:
                    str2 = "ۙ۬ۥۡ۫ۚ۟ۜۗۨۘۘ۠ۧۥۢ۬ۧۦۛ۬۟ۤۛۦۜۥۦۦۛۡۜۚۤۦۘۖۦۘۖ۟ۘ۟ۛۢۡ۫۫ۚۤۦۘۧۗۡۤۖۙۤۜۘۖۚۡ";
                    break;
                case 1989637740:
                    str2 = "ۘۖۘۖۛ۬ۜۤۧۥ۟ۧۜۜۜۚۥۖۨۦۜۜۚۡۚ۬ۥۧۙۚۤ۫ۦ۬۟ۦۘۚۨ۟ۘۘ۬ۢۦۚ۟ۘۜۘ۬ۧۨۘۙۦۜ۫۫۬ۚۙ۬ۚۗۨ۠۟ۥۘۘ۟ۥ۬ۛ۠";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟۟, reason: contains not printable characters */
    public static Object m1197(String str, String str2, Object[] objArr) {
        ClassLoader classLoaderM1137 = C0292l3.m1137();
        C0341oa.m915(new byte[]{-57, -29, 98, 97, -128, 76}, new byte[]{-5, -105, 10, 8, -13, 114});
        C0341oa.m915(new byte[]{126, 33, 104, -88}, new byte[]{31, 83, 15, -37, -31, -35});
        C0341oa.m915(new byte[]{-110, -87}, new byte[]{-15, -59, 35, 76, -59, -79});
        Class clsM1199 = m1199(str, classLoaderM1137, 2);
        String str3 = "ۗ۟ۜۘۤۙۜۛۡ۠ۘۙۖ۟ۨۘۢۚۘۘ۠ۛۖۜۙۨۜۖ۫ۨۖۦۥۙۜۘ۬۠ۡۦۘۜۗۗۥۙۜۡۘۛۢ۟ۥۜۙۘۛۧۢۚۖۘۛۘ۬ۥۗ۠ۢ۟ۜۘۘۨۘۚ۟ۘۘ۬۠ۦۘۛۚۛۨۘۥۘ";
        while (true) {
            switch (str3.hashCode() ^ 984766181) {
                case -1097055086:
                    str3 = "ۦۢۥۨۨ۬ۚۢ۬ۧۙۘۘ۬۬ۘۖۚۥ۠ۢۙ۬۬ۜۤۘۜۜۘ۫ۢۚۚۙۗ۟ۦۥۘۢۧۧۙۡ۟۬ۙۜۘۥۦۥۘ۬۫ۡۘ";
                    break;
                case 399959011:
                    String str4 = "۟ۥۖۦۤۜۘۖۜۨۢۚۦ۟ۘۦۘ۬ۘ۫ۥۤۦۦۙۘۘ۫ۧۘۚۦۘۘۥ۬ۥۘ۫۟ۥۘۛۛۡۘۘۛۘۘۥۡۡۘ";
                    while (true) {
                        switch (str4.hashCode() ^ 1744931960) {
                            case -596116467:
                                str4 = "ۗۜۗۘۤۧۨۜ۫ۡۤۖ۬۟ۧ۠ۘۘۜۙۘۤ۟ۡ۫ۜۦۨ۠ۤۡۥۘۚ۬ۚۜۜۥۘ۠ۙۗۗۖ۬ۘۘۤ۟ۦۤۦ۟ۗ۬ۨۚۡ۠ۧۙۡۘ";
                                break;
                            case -325968010:
                                str3 = "ۗ۬ۙۙۦۚۜ۠ۢۤۥۦ۬ۙۛۤۚۜۘۢ۟ۡۘۖۤۡۧ۟ۖۘ۠ۗ۫ۙۡۖۛ۠ۖۘۚۗۡۘۗۖۙ۟ۥۜۗۛۖۜۨۘۘۦۨۘۖۙ۬۟ۨ۟ۧۤۡۘۢۧۡۘۦ۟۫ۨۥۗ۬۬۬ۖۧۦۘۜ۬۟";
                                continue;
                            case 395546546:
                                str3 = "ۜۗۗۡ۬ۛۦۧۦۘۥ۟ۡۧۥۧۘۢ۟ۦۘۤۤۢۙۤۖۘۜۤۚۙۤۦۘۛۡ۫ۗۜۨۨۛۘۤۦ۠ۜۡۘۜۥۘۨۡۧۘۥۛۦۘۡۖۗۡ۬۫ۡۧۨۘ";
                                continue;
                            case 1056881186:
                                String str5 = "ۙۢۤۥۦۦۘۥۙ۠ۡۦۙۜۦۡۥۙۥۘ۟ۘۨۘۗۚۜ۫ۤۖ۠ۛۦۡ۬۫ۦ۟ۧۧ۠ۥۖۜ۫ۢۦۡۜ۫۫ۧۡۧۦۗۙۧۜۦۘۙ۟ۥۘۢۡۜۘ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-713500036)) {
                                        case -1852573234:
                                            str5 = clsM1199 != null ? "ۧ۟ۜۘۤۗۙۖۘۥۘۡۗ۟ۙ۬ۘۘۥۥۗ۬ۛۤ۬۬ۦۧۡۧۤۚۛ۬ۙۥ۠ۚۖۘ۟۬ۨۦ۟ۗۙۖۢ۠ۦۧ۠ۜۡۧۢۘۘ۠ۡۡۛۢۘۘۡ۟ۦۘ" : "ۗۨۦ۟ۨ۟ۦۨۖۦۢۨۘۨ۠ۘۘۚۨ۫ۧ۬ۥ۬ۚۨۧۧۥۨۚۥۘۜۤۘۘ۬ۖۗ۟ۡۘ۟۬ۡ۫ۛۡۘۙۥۘۘ۟ۨۘۘۥۡ";
                                            break;
                                        case -1184109555:
                                            str4 = "۠ۤۦۘۗ۫ۧۜۖۘۘ۠ۦۧ۬ۦۖۡۢ۠ۜۗۨۘۗ۫ۖۘۙۜۗۛۘۡ۬۟ۗۘۛۖۤۦ۬ۥۚ۫ۥۚ";
                                            break;
                                        case -1142309018:
                                            str4 = "ۘۦ۟۫ۛۦۥ۟ۛ۟ۥۛ۠ۚۤۚۦۤۨۗۦ۬ۨۘۖۤۚۡۨۡۚۤۧ۠ۙ۠۫ۡۦۙۡۘۖ۠۫۬ۗۦۘۗ۫۠ۛۜۡ۬ۛۖۘ۬ۥۧۘۧ۟۟ۜۤ۬ۡۡۚۖۤۥۘ";
                                            break;
                                        case 932247075:
                                            str5 = "ۙۜۘۘ۠ۥ۠ۖۨۚ۫ۦۤۧۥۘۨۘۤۚۨۦ۫۠ۙۘۙۡۡ۟ۘۗۢۢۛۡ۬ۤۡۡۤۤۥۘۦۤۡۘ۬ۤۡ۬ۚۨ۟ۙۦۘۖۛۦۧۦ۟ۛۨ۬ۧۨ۫۠ۗۡۙۦۤۜۡۙ۟ۦۢۥۦۚ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 747725983:
                    Object[] objArrCopyOf = Arrays.copyOf(objArr, objArr.length);
                    C0341oa.m915(new byte[]{3, 13, -53, -67, 34, -15}, new byte[]{63, 121, -93, -44, 81, -49});
                    C0237h4.m1090(C0341oa.m915(new byte[]{-70, -61, -67, -82}, new byte[]{-37, -79, -38, -35, -121, 49}), objArrCopyOf);
                    try {
                        return XposedHelpers.callStaticMethod(clsM1199, str2, Arrays.copyOf(objArrCopyOf, objArrCopyOf.length));
                    } catch (Throwable th) {
                        StringBuilder sb = AbstractC0149b0.f695;
                        AbstractC0149b0.a.m817(th);
                        return null;
                    }
                case 1771232274:
                    return null;
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:7:0x0032, code lost:
    
        return null;
     */
    /* JADX INFO: renamed from: ۥ۟۠, reason: contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
    */
    public static final Class<?> m1198(String str, ClassLoader classLoader, boolean z) {
        C0237h4.m1090(C0341oa.m915(new byte[]{-122, 47, 109, -84, 92, -55}, new byte[]{-70, 91, 5, -59, 47, -9}), str);
        C0237h4.m1090(C0341oa.m915(new byte[]{41, 109}, new byte[]{74, 1, 82, -93, -45, -76}), classLoader);
        String str2 = "ۨۙ۬ۥ۟ۧۢۤۤۚۨۡۖۛ۬ۛۥۥ۠ۢۙۤۙۘۧۖۧۥۨ۟ۨۘۧۨ۬ۜۧۚۚۦۨۗۙۨ۬ۧۚۧۖۨۖۘ";
        while (true) {
            try {
                switch (str2.hashCode() ^ 901280706) {
                    case -1675197533:
                        String str3 = "۟ۙۥ۟۬ۜۜۛۡۘۜۛۢ۠ۚۜ۬۠ۨۨ۫ۥۘۢۢۜۜ۫ۜ۬۟ۘۧۨۨۘ۟ۖۦۘۖ۬ۥۘ۠ۥۧۡۨۜۘۙۦۚۚۥ۫ۙۤۗ۟ۛۨۛۛۛۥۨۘۘۚۥۥۖۨۘ۟ۚ۬";
                        while (true) {
                            switch (str3.hashCode() ^ (-1571298681)) {
                                case -1858763311:
                                    str2 = "ۥ۟ۡ۠۠ۖۘ۫ۚۦۘ۟۬ۥۘۦۛۨۘۡۙۦۦۙۢ۫۬ۚۤۦ۫ۨۨۚۧۗۨۦۨۥ۫ۚۨۗۥۨۘۘۧۡ۬۟ۦۙ۬ۖۚۛۖۘۚۙۖۘۘۧۡۜۘۥۚۦۚۡ۫۟ۙۦۘ";
                                    continue;
                                case -86115010:
                                    String str4 = "ۗۜۛۦۨۡۘۖۚۦ۫ۖۨۘۜ۠ۜ۠ۜۧۘۧۜۘ۟ۛۦۘ۬ۨۡۘۥۧۢۚ۬ۡ۟ۥۥۘ۟۫ۧۚ۬ۧۚۙ۠ۨ۫ۘ۫ۦ۫۟ۛۜۘ۠ۜۥۘۤ۬ۗۢۖۖ";
                                    while (true) {
                                        switch (str4.hashCode() ^ 1581400411) {
                                            case -2137389966:
                                                str4 = "ۗۧۡۢۢۙ۬۠ۜۢۚۖۘۨۚۤ۫ۦۨۘۢۗۧۜ۟ۥۦۤ۬ۚۦۖۘۘۤۡۤ۬ۨۥۡۖ۠ۨۘۗ۟ۦۨۥۙۙۥۦۘۢۗۛۙۤۡۚۢۘۘ۟۬ۘۘۧۜ۟ۦۛۦۘۨۤۛ";
                                                break;
                                            case -1022729252:
                                                str4 = C0406ta.m1245(str) ? "ۦۘۢۡۤۥۘۖۡ۠ۥۨۥۧۜۛۛ۬ۛۜۤۥۘۥ۠ۙۖۨۥ۟ۨۥۥ۬۫ۡ۠ۢۖۢۨۘۡۛۨۧۨۨ" : "۟ۗۤۚ۬ۤۤ۟ۢ۬ۥۡۘۥۛ۟ۙۨۨ۠ۧۙۚۡۧۘۗۢۘۛۙۖۧۦۚ۠ۤۙۜۥ۬۫۫ۘۘ۫ۥۡۘ";
                                                break;
                                            case 629560450:
                                                str3 = "ۖۨ۟ۙۦ۟ۢۜۡۘۢۤۛ۬ۧ۟ۢۧۤ۫ۤۖۚۙ۟ۦۡۜ۫ۜۤۙ۠۬ۨۢۨۖۙۛۙۖۡۨۘۡۧۗۜۚۨۚۛۦۘ";
                                                break;
                                            case 1844997661:
                                                str3 = "ۤۜ۠ۗۥۙۜۖۧۘۙۚۗۚۚۛۤ۟ۡ۟ۨۜۧۡۦۘۙۧۧۜۧۡۨۜۛۛۤۙ۬ۥۢ۬ۚۚۧۙۛۘۘۗۡۗ۟۬ۦۢۥۢۜۘۗۛۡۘۦ۠ۦ";
                                                break;
                                        }
                                    }
                                    break;
                                case 1476833656:
                                    str2 = "ۡۜۖۘۢۛۥۤۙۨۖۤۚۘۡۦۘۜۗۧ۬۫ۚ۟ۧ۠ۙ۫ۨۙۡۘۡۘۡۘۚۙ۟ۢۦۤۦۡۦۘۡۛۧ۬ۥۡۛ۟ۨۘ۫ۗۚۙ۬ۗۥۤۖۘۤۨۜۘۜۜۡۛۨۦۘ۟ۡۡۙۦۖۦۧۘ";
                                    continue;
                                case 1632913027:
                                    str3 = "۫ۙۙۢۙ۠۠ۘۧۘۦ۠ۨۥۧ۫۫۠ۖۘۙۖۖۗۡ۠ۚۨۖۘ۬ۖۥۘۘۤۨۘۦۚ۬ۚۛۙۙۡۡۘۢۜۖۧۢۘۘۡۙ۟ۤۡۚ۫ۜۢ۬ۥۗ۫ۨۘ";
                                    break;
                            }
                        }
                        break;
                    case -1056182884:
                        break;
                    case -297497044:
                        str2 = "۫۬ۜۙۘۚ۠ۛۦۘۦۨۘۘۛۛ۠ۛۚۖ۫ۤۨۘ۬ۘۧۧۗ۟ۖۢ۠ۧۘۥۘ۬ۤۖ۠ۦۛۢ۫ۗۖ۫۟۠ۖۘ۟ۥ۬ۛۜ۫";
                        break;
                    case 697335195:
                        return XposedHelpers.findClass(str, classLoader);
                }
            } catch (Throwable th) {
                String str5 = "ۛۙۖ۫ۧ۬ۥۗ۫ۜ۠ۨۤۡۛۘۧۘۤۦۧ۟ۜۡۙ۬۠ۢۙۙ۬۟ۘۘ۟ۗۘۘۚۛۖۛ۬ۧۛۨۖۘۙۚ۠ۦۖۢۥۥۨۘۚۙۛۛۖۘۡۦۘۤ۬ۥۘ۠ۦ۠ۧۘ۠";
                while (true) {
                    switch (str5.hashCode() ^ (-542023821)) {
                        case -630062895:
                            String str6 = "ۤۖۗۦ۫ۖۖۜۖۢۧۗ۠ۡۚۨۖۥۜۨۗۡۘۘۡۖۘۘۗۥۡۘۛۥۡ۫ۚ۫ۥۜۘ۬ۙۥۘۚۤۜۘ۠ۖۛۦۤۢۙۙۗۗۥۗ۫ۚۖۘ۬ۗۧ";
                            while (true) {
                                switch (str6.hashCode() ^ 501016214) {
                                    case -717346235:
                                        str5 = "۫ۙ۫ۤۗ۠ۥ۠ۦۘ۠ۧۚۡۦۡۡ۬ۥۦۗ۠ۛۜۚ۟ۛۥۘۜۗ۟ۘۖۧ۟ۨۨ۠ۙۢۧۦ۫۠ۧۘۙ۟ۚۖۗۖۘۖۖۘۚۦۦۘۥۘ۠ۥۢۥۥ۬۬ۨۤۗۢۛ۬ۧۨۨۗۖۗۖۡۘ";
                                        continue;
                                        continue;
                                    case -531229905:
                                        str6 = "ۡ۫ۗۢ۬ۥۛۛ۬ۜۙۜۘ۬۫ۜۘۖۜۚ۬ۙ۠ۦۚۨۢۥۡۘ۟۠ۤۨۙۘۘۗ۫ۖۥۜۥ۠ۚۙ۟ۦۘ۟ۛۥۘۥۤ۫ۦۗۡۡۨ۬ۢۜۘۘۨۘ۫ۗۦ۬ۡ۠۟ۛۜۜۘۡۙۧۚۘۖۢۨ";
                                        break;
                                    case 753919138:
                                        String str7 = "ۦ۫ۖ۫ۨۥ۫ۚۡۙۢۖۙۡۥۘۢۦۘۖۨۦ۠۬ۨۨۖۘۘۛۙۛۥۡۘۘۙۦۨۘۙۧۘۧ۠ۖ۠ۡۡ";
                                        while (true) {
                                            switch (str7.hashCode() ^ 801325252) {
                                                case -1973805973:
                                                    str7 = "ۗۖ۬ۥ۫ۨۛ۠ۖۛۡۨۘۡۚۧۘ۟ۚۖۢۚۡۙۛ۠۫۫ۡۚۖۘۘۘۡۙۥۘۜۤ۬ۘۘۧۘ۫ۡۙ۠ۛۙ۠ۗۤۚ۫ۤۧۨۘۘۦۧۜۘۧۤۨۘ۠ۤ۟ۚۚۜ";
                                                    break;
                                                case -1629848724:
                                                    str6 = "ۢۜۚۦۘۜۢۙۖۗۤۚۥ۠ۦۘ۫ۧۘۘۨۨۖۦ۠ۨۤۥۘ۟۫ۡۘۛۚۤ۟ۨۥۜۗۜۘۡۡۡۘۛۖۧۘۤۤۗۨۙۘۘۦۚ۠ۢۤۨۘۢۘۧۘۘۗۧ";
                                                    break;
                                                case -761903824:
                                                    str7 = !z ? "ۨۤ۬ۤۥۘۥۦ۫ۤۡۖ۬ۚۘۘۧۢۜۛۚۘ۫ۥۘۖۡۜۘۚۤ۬ۧ۬۫ۨۜۜۥۘۨۧۙۧۚۗۥۘۚۡۚۨۤۨۧۢۖۘۖ۟ۖۘۦۥۧۛۙۧۥ۟۟ۡ۟ۥۥ۬ۙۨۡۘۤ۟ۨۛۖۛ" : "ۦۜ۟ۘۡۡۘۢۧۦۘۡ۬ۤۦۛۚۗ۬ۘۙۙۜۙ۟ۛ۠۠ۡۗ۫ۥۘ۫ۙۛۦ۠ۖ۫ۙۨۚۥۘۢۧۛ";
                                                    break;
                                                case 279128504:
                                                    str6 = "ۚ۠ۜۜۤۦۦۛۙۧۛ۟۠ۡۦۘۡۤۡۘۖۧۜۘۛۗۜۙ۠ۚۨۥ۬ۜۘۜۧۧ۬ۗۛۤ۫ۡۤۘۖۘ۬ۦ۟ۘ۬ۥۜ۟ۖۘ";
                                                    break;
                                            }
                                        }
                                        break;
                                    case 1332210952:
                                        str5 = "۠ۢۡۘۙۙۘۘۛۧ۠ۘۢۨۧۨۧۘۛۗۡۘ۟ۥۤۨ۫ۥۡ۠ۨۤۜۛ۟ۖۦۢۖۖۘۖۦۡ۫ۛۛۥۢ۫ۡۘۗ۫۟ۜۘ۠۬ۡۜۛۢۧۦۨۧ۬ۦۜ۟ۗۥۤۧۡۢۥۘۧ۬ۗۡۗۗۗۢۦ";
                                        continue;
                                }
                            }
                            break;
                        case 381231600:
                            break;
                        case 1644840073:
                            str5 = "۠۬ۨۘ۟ۧۖۘۤۖۖ۫ۢۢۤۡۧ۟ۛۧ۟۬ۜۥۧۙۢۢۘۘۥۦۙ۠ۨ۟ۙ۠ۡۥ۠ۧۘ۬ۤۘۛۨ";
                            continue;
                        case 1858461583:
                            StringBuilder sb = AbstractC0149b0.f695;
                            AbstractC0149b0.a.m817(th);
                            break;
                    }
                }
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۡ, reason: contains not printable characters */
    public static Class m1199(String str, ClassLoader classLoader, int i) {
        String str2 = "ۛۦۧۘۥۚۡۘ۠ۦۘۢۗۜ۟ۥۙ۫ۡۘۗۦۡۛۦ۠ۥۡۨۘ۫ۜ۟۫ۥ۟ۤ۠ۘ۬ۛۥۨۜۚ۬۟۫ۚۨۨۢۦۡۘۥۜۥۘ۫۬ۛۖۨۧۘۥۢ۟ۦۖۦۘۤۛۧۖۤ۟۫ۧۜۘۛۡۘۥۘ";
        ClassLoader classLoader2 = null;
        ClassLoader classLoader3 = null;
        while (true) {
            switch ((((((((str2.hashCode() ^ 591) ^ 246) ^ 352) ^ 178) ^ 630) ^ 146) ^ 506) ^ 862408987) {
                case -2126549410:
                    classLoader2 = C0292l3.f938;
                    str2 = "ۢۤ۟۬ۢۜ۬ۘۡۙۡۖۘۤۛ۫۠ۧۙۜۚۡۧ۫ۗۥۦۙۤ۠ۚۦۙۙۘۛۨۘ۬۟ۡۘۧۡۖ۠۫ۥ۟ۡۘۤۦۜۜۢۖۘ";
                    continue;
                case -1914094215:
                    String str3 = "ۚ۠ۦۙ۠۠ۛ۟ۤۛۙۗۢۘۢ۬ۡۘۜۤۡۨۦۗۥۨۙۗۧۚۤۤۦۘۢ۫ۖۘۘۙ۟ۖۦۧۥۦۘ";
                    while (true) {
                        switch (str3.hashCode() ^ (-762446911)) {
                            case -1706043547:
                                String str4 = "ۘۨۥۘۦۗۘۙۤۨۘۥۥۡ۟ۗۤۥۥۛ۬ۚۚ۬ۢۥۘ۬ۦۥۘۚۡۦۛۜۨۛۤۧۘۘۢۘۧۘۦۦۜۘۜۗۜۘۦۧۨۡۤۡۘ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-191677528)) {
                                        case -1549384946:
                                            str3 = "ۘ۠ۗۚۛۡۘۖۡۜۗۚۖ۬۫ۖۢۡۘۜ۫ۦۘۧۜۙۧ۟۬ۖۤۧۨۘۜۘ۬۟ۨۗۤۦ۬ۦۛۨ۠ۥۘۜ۬ۨۘۥ۫ۜۘ۫ۨ۠ۗۦۜۦ۫ۤۖۥۘ۠ۨۡۚ۬ۜۖۢۨۘ۠ۦۜۘ۠۬ۦۘۖ۟ۜۘ";
                                            break;
                                        case -1357148682:
                                            str3 = "ۗ۬ۢ۟ۨۙۖۥۥۘ۠ۘۤۨ۟۫ۡۤۦۘۡ۟۠ۙۢ۟ۛۘۗۢۧ۬ۘۦۘۥۘۛۖۦۘۥۗۜۘۜۢۨۛۖ۫ۡۨ۫ۙۘۘۖۚۤۖ۫ۙ۠۫ۦ۫ۚ۟ۘۜۗ۫۠ۡۘ";
                                            break;
                                        case -757157430:
                                            String str5 = "۬ۜۨۘۙۜۘۘۘ۫ۥ۬ۦۦۘ۫ۨۡۘۤۥۥۘۧۦۜ۟ۖۗۛۡۘۚۘ۬ۙۡۖۘۖۚ۫ۜۘۖۦۘۘۘۡۛۢۨ۬۟ۘۘۘ۬۬۬۫ۦۨۘۛۥۨ۠ۜۙ۫ۛۤۡۧۖ۠ۥۘۙۖۦۘۡۤۡۘۖۘ۠";
                                            while (true) {
                                                switch (str5.hashCode() ^ 981686383) {
                                                    case -1863139953:
                                                        str5 = (i & 1) != 0 ? "ۨۚۦۘۛۗۜ۫ۥۧۨ۬ۡ۟۬ۧۡۗۗۥۡ۫۬ۤۛۧ۟ۛۜۡۘۨۛۘۗۛۦۘۦ۟ۙۖۢۤۖۛ۫۠ۦۚۤ۬" : "ۘۤۡۘۖۡۧۘ۫۟۠ۗۖۜۖ۫۟ۙ۫ۙۙ۫۟ۦۨۜۘۧۡۛۨ۫ۘۘ۠۫ۛۚۨۧۚۧۜۘ۬ۜۘۡ۬ۤۚ۫ۙۤۥ۫۠ۦۛۥۖۛۧۗۛۘ۠ۘ";
                                                        break;
                                                    case -1382353699:
                                                        str5 = "ۚۤۘۘۜ۠ۜۖۥۘۘۚۥۥۙ۟۟ۜ۬ۨۡۛۚۡۢۤۗۦۖۢۘۘۜ۟ۧۨۘۧۦۡ۫۬۬ۖۦۥۗ۟۟ۗۤۖۘۜۛۚ";
                                                        break;
                                                    case 314247624:
                                                        str4 = "ۢۙۙۧۗۡ۟۫ۤۥۢۚۢ۬ۜۧ۠ۛۤۚۥۛۡۘۡۚۙۛ۫ۛۚۡۘۤۗۘۘۤۤ۠۟ۨۨۘ۟ۖۤۙۙۘ۠ۦۖۘۚۜۘۡۡۡۦۛ۫ۤۛۦۘۜۛۢۗۥۨۘۢۧۖ";
                                                        break;
                                                    case 1669591626:
                                                        str4 = "۟ۨۢۨۢ۟ۜ۫ۤۤۛۦۘۧۛۨۘۡ۫۫ۧ۠ۖ۬ۛۧۦۛۜ۬ۖ۫ۚۗۙۡۘۚ۠ۥۡۢۥۘۘۡۤۡۤۙۨۖۘۚۙۧ۫۫ۡۘۥ۫ۥۘۦ۬ۘۢۖ۬۟ۨۛۡۜۧ۬ۘۜۘۡۨۙ۬۬۟";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -305039166:
                                            str4 = "۫ۧۨۘ۫ۡۥۥۘۥۖۦۖۨۚۙۗۚۢۙۘۧۘۗۜ۟۫ۨ۬ۥ۫ۖۘۗۤۨۘۤۜۡۘ۫ۜۙۚۥۥۘۤ۫ۢۧۡۨۘ۬ۖۥۡۤۘۦۘۡۘۤۢۚۚ۬ۧۢ۠ۖۘ۬ۥۡۘ۫۬۟ۗۥۢ۬ۖۙ";
                                            break;
                                    }
                                }
                                break;
                            case -1435697690:
                                str3 = "ۖۦۖۘۛۖۤۡۤۚۗۜ۠ۤۦ۬۟ۜۛۖۧۦۘۥۡۦۢۘۘۥۧ۫ۡۗۛۦۧ۠ۦۤۢۥۨۘۗۗۡ";
                                break;
                            case 1260582575:
                                break;
                            case 1491725174:
                                str2 = "۬ۖۥۘۡ۟ۧۚۚۢۖۛۚ۬ۙۙۨۗۤۘۤۨ۬ۜۛۢۢۜۘۖۦۨۘ۠۟ۚ۫ۜۡۘ۫ۦ۠ۚۜۤ۫۟ۙۥ۬ۥۘ۫ۡۥ۫ۡ۠ۚ۬ۙۛۡ۫ۧۥۗ۫ۧۚۨۗۘۘۡۚۨ";
                                break;
                        }
                    }
                    break;
                case -1521588752:
                    break;
                case -957604579:
                    str2 = "۬ۘۡۘۚۘۜۙۚۦۘۢۗۛ۫۠ۖۦۤۖۘۦۤ۫۫ۦۜۘۖۙۙۡۧۥۘۧۙۜۘۤۢۥۘ۫ۚۧۛ۠ۙۚ۬ۖۦۗۥۘۨۖۜۘ۬ۧۤۤۙۥۘ۠ۚۜۘۧۡ۫";
                    continue;
                case -394324797:
                    str2 = "ۛ۫۫ۘ۟ۥ۠ۖۙۤۚۖۘۧۗۘۘۥۥۖۘۡۗۖۘۧۛ۬ۡ۟۠۠ۤۢ۟ۤۦۘۡ۟ۛ۬ۘ۠ۘۡۥۘ۫ۥۦۘۤۧۧۥۖۡۖۧ۟۟ۨۘۤۥۡۘ۟ۡۛۢ۠۫ۦۗۜۧۢۜ";
                    classLoader3 = classLoader;
                    continue;
                case -284681070:
                    throw null;
                case 595661741:
                    String str6 = "۫۫ۙۜ۬ۛۚۢۨۡ۟ۖ۫۫۠ۛ۠ۙۢۙۡۢ۫ۜۢۖۘۨۧۗ۠ۚۤ۬ۦۘۤۨۙۢۘۘۚۤۦۤۡۦۘۘۗ۟ۖۙۦۦ۬ۜۘۛ۟۬ۧۘۚۜۛۡۜۦۖۜۥۖ";
                    while (true) {
                        switch (str6.hashCode() ^ 575295124) {
                            case -540889702:
                                String str7 = "ۥۨۡۘۤۘ۬ۘۦۡ۟ۜۦۘۡ۬ۙ۫ۦۖۘۦۛۧ۫۬ۜۘۡۖۘ۬ۙۙۛۜۘۜۧ۟۠ۙۗۧۤۢۗۜۘۗ۠۠۟ۖ۬۟ۦۜۘۥۚۢۦۨۢ۠ۧۙۨۥۡۧ۠ۦ۠ۖ۫";
                                while (true) {
                                    switch (str7.hashCode() ^ 1901194140) {
                                        case -2079671308:
                                            str6 = "ۥ۟ۚ۠۟ۘۘۢۡ۟ۨۤۚۛ۫ۨۘۙۢۢۥۧۘۘۧ۟ۦۘۢۦۥ۟ۥ۬۠ۚۛۤۖ۬۠ۖۜۗۛۤ۫۫ۖۘۘۨۜۨۡۤ۬ۧۥۘ۫ۡۢۛۗۗۡۥۡۦ۟ۧ۟ۗۗۜۘ۫۫ۤۡۘ۠ۢۘ۠ۨۜۘ";
                                            break;
                                        case -753588112:
                                            String str8 = "ۥۨۨۘۗۖۦ۟ۗۛ۬ۘۨۘۜۨۚۡۛۢۛ۟۬ۖ۬ۨۘۖۘ۠ۤۡ۫ۥۖ۬ۜۦ۠ۙۘۖۢۗ۟ۦۘۘۗ۬ۧ۫ۧۨۧۢۧ۠ۤۖ۬۟ۨۚۙۖۢۡۦۘۛ۠ۘۥۖۥ۬ۖۨۘ۬ۥ۫ۧ۫۬";
                                            while (true) {
                                                switch (str8.hashCode() ^ 486875188) {
                                                    case -974883265:
                                                        str7 = "۫ۖۥۚۚۤۡۙۘۘۗۢ۬ۜۡۘۧۨۥۘۜۗۢۧۦۘۖۘۚۡۢۚۦۘۡۘۗۨۤۗۧ۟ۖ۬ۜ۟ۥۖۡۘۖۢۘۥۡۡۘۚۛ۬ۙ۟ۢۡۥ۠";
                                                        break;
                                                    case -754076009:
                                                        str8 = classLoader2 != null ? "ۙۡ۠ۡۤ۠ۜۜۧۗ۫۫ۙۜۘۡۦۖۘۗ۬ۥۘۙۥۙۢۘۤ۫ۜۨۘۥۛۜۘۧۜ۟ۙۙۨۙۦۖۖۘۘ۠۫ۧۙۢۧۗۧۦۙۙۨ۠ۧ۫ۗۡ۠ۗۢۥۘۧۨۗۢۚۨۘ" : "۬ۛۗۚۦۧۘۥۤۡ۟ۦۢ۫ۛۤۜۤ۟ۚۦ۠۫ۨۧۡۖۘ۟ۤۡۘۙ۫ۗ۬ۤۦۛۢۨ۟ۘ۫۠ۦۙۢۢۜ۠ۜۘۙ۟ۢۘ۬ۧۧۧۦۘۖۙۘۘ";
                                                        break;
                                                    case -221419479:
                                                        str7 = "ۙۡۙۛ۬ۜۖۥۘۛۖۦۢۖۦۘۖۛۜۘۦۖۨۚۡۦۘ۠ۗۖۘۛ۫۟ۧ۠ۘۜۚۨۤۜۘۢۛۘۘۤۡۖۚۜۨۘۗۖ۠ۡ۫ۨۥۖۤۗۡۘۛۨۗۥۧۘۦۢۢۘۘۥۙۗ۬ۤۢۡۛۦ";
                                                        break;
                                                    case 246339576:
                                                        str8 = "ۤۛۚ۟ۨۛ۠ۥۧۢۥۧۘۜ۠ۦۘ۫ۨ۠ۙۚۤۘۚ۠۬ۖۢۤۨۦۙۢۦۡۤۚۥۤۘۘ۟ۛۥۚۡۗ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 681011693:
                                            str6 = "ۛۦۜۘۛۛۢۗۦۧۘۢۨ۬۬ۡۥۘۙۗۘۤ۬ۤ۬ۧۥۦۤۥۘۘ۬ۥۙۧ۫ۗۛۢۧۡۗۦۥۡۧۡۘۡ۟ۥۡۧۖۦۗۨ";
                                            break;
                                        case 1200319825:
                                            str7 = "ۚ۟ۚۢۙ۠ۙۧۘۚۛۢۤۡۜۨۗ۫۫ۦۙۖۨۘۖۡۨۢۗۙۚۢ۠ۢۚۧۦۥۥۘۢۚۢۙۙۘۘۚۨۖۡ۬ۛۨۡۥ۫ۡۧۚۖ۫۬ۥۖۘۤۧ۬ۡۙۢۚۤۡ۬ۡۤۚۤۧۘۘ";
                                            break;
                                    }
                                }
                                break;
                            case 987046056:
                                str2 = "ۜۦۘۘۨۚۦۘ۫۫ۡ۟ۜۘ۟ۖۙ۟۟ۨۤۦۦۘۧۢۥۛ۠ۡۘۗۚۦۘۙۦۡۘۚۛۤۛۧۜۥۡۥۘۧ۬ۘۘۜۤۗۘۥۥۘۚۢۤ";
                                continue;
                                continue;
                            case 1671397717:
                                str6 = "ۛۧۢ۠۬۠ۡۘۨۘۚ۠ۡۘ۬ۙۗ۬ۡۘۙۖۜۘ۠ۥۛ۟ۡۦۘۖۤۜۗۗۗۢۢ۫۟۠ۨۘۜۦۛۖۥ۟";
                                break;
                            case 1843559615:
                                str2 = "ۧۢۡۘۦۤ۠ۚۧ۬ۧۜۨ۬۠۫ۗ۬ۡ۫۠ۨۘۜۡۘۦۚ۠ۜۧۦۘۚۡۦ۟ۚۚۛۦ۟ۜۘۧۡۢۥۦۢۖۘۢ۠۟ۛۖۤۚۤۥۦۢۚ۟ۧۦۚۚۤۚ۬ۨۘۚۖۢۚۜۨۘۤۘۦۡۢۜۘ";
                                continue;
                        }
                    }
                    break;
                case 765995525:
                    str2 = "ۧۧۘۚۡۜۘۥۙۚۢۨ۟ۥۨۘۗۘ۠ۜۙۖۘۤۨۥۙۖ۟ۖۖۘۨۛۘۘۙۙۨۛۧۨۧۛۨۦۨۙۛ۠ۡۘۦۘ۫ۘۚۨۘ۫ۗۛ۠ۗۡۘ۫ۘۗ۟ۥۡ۬ۗۙۤۢۜ۟ۖ۬۬ۖۘ۠ۨۘ";
                    classLoader3 = classLoader2;
                    continue;
                case 827990538:
                    str2 = "۟ۛ۫ۧۚ۟۬ۙۖۘۙۥۚۦۜ۟۫ۢۜۘۧ۫ۦۦۚۧۦ۬ۛ۫ۜۗۦۦ۠ۛۧۥۘۦ۠ۡۗ۠ۥۜۘۙۘۧۜۘۚۗۨۧۥۚۡۖۥۘۢۡ۬ۥۘ";
                    continue;
                case 1679107929:
                    str2 = "ۨ۬ۛۙۥۘ۠ۢۛۗ۬ۡ۟ۥۘۛۨۙۥ۬۫ۜۥ۬ۨۤۢ۟ۥۡ۫ۗۘ۟ۘۨۘ۫۠ۙۚۘۦۖ۬ۥۘۖ۫۬ۢۚۘۘ۟ۧ۠ۙۡۨۘۨ۟ۡۢۦۦۘ";
                    continue;
                case 1725379857:
                    return m1198(str, classLoader3, false);
                case 1745661615:
                    C0237h4.m1092(C0341oa.m915(new byte[]{-78, 10}, new byte[]{-47, 102, 55, 90, 4, -54}));
                    str2 = "۠ۢۘۛۡ۬ۨۖۨۘۗۤۙۛۖ۬ۖۘۜۤۜۘۙۢۡۘۗۢۖۘ۬ۨۢۢۜۤۡۧۛۚۖۜۘۙۢۗۨ۫ۙۛۧۘۘۛۤۜۘۜۗۜ۬ۛ۬ۡۖۢۤۤۤ۠ۨۚ۬۫ۨۘۨ۠ۦۘ";
                    continue;
            }
            str2 = "ۚ۫ۘۘۧۘ۠ۛ۬ۛۦۥۙۘۗۚۚ۟ۦۘ۠ۥۥۘۧۤۧۧۜۤۖۨۢ۟ۧۨۨۘۥۘۙۖۢۨۥۢ۬ۡۨ";
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۢ, reason: contains not printable characters */
    public static Class m1200(String str) {
        String str2 = "ۤۘۤۥ۟ۗۗۥۦۥۢۚۨۗۥۜ۟ۦ۟۬ۜۘۗۧۢۥۜ۟ۗۘ۠ۘۧۡۦۛ۠ۛ۟ۗۙۧۨۘۧۤۖۢۘۡۘ۫ۡۡۤۥ۟ۚۦۗۤۨۜۢ۠ۨۘ";
        ClassLoader classLoader = null;
        while (true) {
            switch ((((((((str2.hashCode() ^ 334) ^ 870) ^ 378) ^ 896) ^ 865) ^ 542) ^ 360) ^ 1695587061) {
                case -2023338530:
                    return m1198(str, classLoader, true);
                case 12250345:
                    C0341oa.m915(new byte[]{-119, 99}, new byte[]{-22, 15, -112, 67, 50, 12});
                    str2 = "۠۠ۡۡ۫ۜۢۥ۬ۢۙۛۛۘۘۦ۠ۜۘۖ۫ۦ۫ۢۛۘۤۡ۟ۙۨۛۛۢۛۤۥۘۗ۟ۨۛۡ۫۬ۡۨۜۛۚۦ۬ۖۡۗۖۘ";
                    break;
                case 472912173:
                    str2 = "ۛۥۜۤۥۨۘۥۚۤۘۧۤ۬۫۠ۨۨۙۨۛ۠ۢۤۨۧۚۜۚۜۘۙۨۖ۫ۨ۟ۙۢۢ۟ۨۘۙۧۢ";
                    break;
                case 537226289:
                    throw null;
                case 605496463:
                    C0237h4.m1092(C0341oa.m915(new byte[]{-78, 10}, new byte[]{-47, 102, 55, 90, 4, -54}));
                    str2 = "۠ۧۖۜۡۗۗۛۘۘۡۧۧۙۚۘۥ۠ۘۘۘۜۡۥۚۨۘۧۢۡۘۜۨۜۨۦۦۘۙۢۤۗ۠ۚۙۗۧۚۤۖۘۨۢۖۘۢۙۧۗۜۘۘۘۨۙ۬۬ۤۤۙۙ۟ۦ۠ۗۨۦۘۨۘ";
                    break;
                case 611990316:
                    classLoader = C0292l3.f938;
                    str2 = "۬ۛۜ۟ۛۗۥ۠ۜۘۚۘۧۖۤۙۗۗ۟ۘۖۧۘۦۗۜۦۘۥۙۘۚۖۡۡۢۦۙ۠ۘۘ۟ۦۤۙۖ۫ۡۢۙۚۘۗۡۛ۠ۗۧۧۙۜۧ۬ۘۘ";
                    break;
                case 1616959056:
                    String str3 = "ۤ۟ۧۦۧ۫ۦۧۛۥۗۘۘۙۙۜۘۖۨۤۘۦ۠ۥۘۥۗۥۨ۟۠ۥۨۘۛۧۦۘ۟۠۟ۘ۠ۘۙۜۜۥۢۥۛۨۢۡ۟ۘۘۢ۫ۨۘۧۧۜۦۦۦۘ";
                    while (true) {
                        switch (str3.hashCode() ^ 1830515175) {
                            case -658645604:
                                str2 = "ۡۥۡۘۜۨۦۘۜۤۛ۬۟ۢ۬ۥۘۘ۠ۥۡۡۨۙۤ۬ۦۘ۬ۗۡۘۛۛۢ۬ۘۘۖۚۜۘ۫ۡۘۙۢۗۧۗ۠ۜۙۘ۠ۜۘۜۦۦۘۚۛۦۘۘۧۚۤ۠ۙ۫ۦ۫۟۬ۜۡۛۜۘ";
                                continue;
                            case -225351878:
                                str2 = "ۧۖ۠ۡۨۨۘۦ۠ۢۤۜۖۨۧۥۘ۬ۚ۬۟۬ۥ۠۠ۧ۫ۘۦۛۢۜۘۖ۫ۗۜۖۘۘۤۘۖۘۖۡۘ۫ۛ۫۠ۦۘۥۘۥۤۗ۫ۘۧۘۖ۫ۤ۫۟ۖۘ۠۬ۤۨۢ۬ۛۙۖۗ۬ۖ۟ۖ۬ۦۦ";
                                continue;
                            case 103304900:
                                String str4 = "ۚۦۧۛۚۡۘۡۥۚۚۚ۫ۧۖ۟۬ۜۨ۬ۘۚۥ۟ۖۘۜۡۡۡۜۜ۠ۢۨۦۡ۫ۘ۫ۜۘۢ۬ۢ۠ۜۨ۫ۗۧۙۛۤۙۙۘۘ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1596349157)) {
                                        case 1143835525:
                                            str3 = "ۖۦۧ۬ۧۙۖ۬ۨۡۡۨۘۢۥۨۘۙۢۛ۠ۤۨۘۖۤۥۘۥۤۧۛۥۖۘۦۜۦۘ۠ۢ۠ۛ۬۬ۢۥۙۖۘۤ۠ۧۢۢ۫ۦ۫ۘۘۗۢۤۦ۫ۘۘۢۡۤۖۥۙۘۜۦۘۥۜۚ۫ۧۚۖۨۥ۟ۦۛ";
                                            break;
                                        case 1357867660:
                                            str3 = "ۤۛۨۘۨ۫ۤۧ۬ۘۘ۬۟ۖۘۥ۠ۦۦۘۘۚۥۧۘۘۖۚۡۧ۟ۘۗۙۧۥۙۘ۠ۜۚ۬ۦۛۥۘۖۚۥۘ۬ۜۗ۬۫ۨۘۤۥۘ";
                                            break;
                                        case 1901865422:
                                            String str5 = "ۡۢ۠ۢ۟ۥۦۘۘۥۘۢۙۢۚۜ۫ۙۙۗۖ۠ۚ۠۫ۧ۠ۙۗۨۦۥۥۙۖۨۘۚۖۨۘۡۛۜۘۜۚۨۘۨۗۡۛ۫ۙۘ۬";
                                            while (true) {
                                                switch (str5.hashCode() ^ (-760870808)) {
                                                    case 313745928:
                                                        str5 = "ۢۛۦ۬۟ۘۡ۬ۗۦۢۢۜۡۚۙۘ۟ۘۥۖ۟ۧ۟ۜۨۧۦۧۖۖۙۦۖۦۘۚۖۜۥۚۘۤۙ۟ۥ۬۫۟ۥ۬ۥۘۙۦۜ۬۫ۖۥۘ۫۬ۦۘۥ۫ۗ۠ۥۛ۫ۦ";
                                                        break;
                                                    case 557576808:
                                                        str4 = "ۜۚۥۘ۠ۥۘۢۙۦۘۖ۫ۤۡۜۨۗۙۖۘۘۧۘۧ۟ۖۘۡۧۨ۟ۖۘۘۧۧۧۧۖۧۘۘۜۗ۠ۢۦۨ";
                                                        break;
                                                    case 858191060:
                                                        str4 = "ۖۘۖۖ۬ۘۦۘۚۢ۟ۗۗۥۖۢۜۥۘۥۧ۫ۧ۟ۨۚ۠ۛۜۨ۟۟ۛۙۥۡۢ۫۫ۨۖۡۡۜ۠ۙۜ۠ۖۘۗ۬ۦۜۦۖۖۗۚۗۤۙۛۘۖۘ";
                                                        break;
                                                    case 980733543:
                                                        str5 = classLoader != null ? "۟ۘۥۚۡ۟ۖۜ۟ۥۘۜۢۨۨۨۘۛ۠ۖۘ۠ۡۨۘۤ۫ۖۘۧۙۥۘۙۚۚۥۢ۫ۥۦۥ۟۠ۘۘۗۘۧۘۛ۠۫ۛ۠ۗ۫ۤۖۛۡۘۘۤۗ۬ۧۨۗۛۜۘۡۙۨۙۢۖۡ۫ۘۘۤ۟ۚۢۗۜۘ" : "ۗۥۜۘۦ۟ۥۨۚۥۘۤۡۖۘۢۡۛۜۙۖۘۚۚۗ۫۬ۢۛۖۘۘۥ۫ۤۚۦ۬ۙۘۙۙۖۧۢۙۥ۟ۧۙ۟ۧۜۛۢۛۙۗۧۙۖۢۚۛۥۖ۫ۢۤۜ۬ۥۡۢۧۙ۟ۤۨۘۗۗۖۧۚ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1902473256:
                                            str4 = "ۥۥۨ۫ۜۥۘۗۥۥۘ۬۬ۦۘۨۜۖۘۘۢۡۘۧۗۥۘ۠ۥۥ۬۠ۢۖۚۙ۬ۡۙۨۥۙۗۛ۬ۙ۬ۦۘۗۡۥۘۥ۬ۦۨ۫۬ۢ۫ۨۜۤ۫۟۫ۥۘۗۗۧۢۡۘۘۘۗۛ۬۬ۡۘ";
                                            break;
                                    }
                                }
                                break;
                            case 472769791:
                                str3 = "ۗۥۦۢۘۜۘۘۡۧۘ۟۫ۦۘۢۗۚۛۤۦۢ۫ۘۙ۬ۥۘۙۥۚۖۡۙۛۖۥۘۛۜۧۘ۫ۦ۟ۘۜۡۘۨۤۦۘۧۛۙ۠ۥۧۥۛ۠";
                                break;
                        }
                    }
                    break;
                case 1829408705:
                    C0341oa.m915(new byte[]{124, 108, -23, 68, 67, 24}, new byte[]{64, 24, -127, 45, 48, 38});
                    str2 = "ۤ۠ۖۢ۠ۘۘۡۛۜۡۗۨۖۢۨۤۖۧ۬ۖۧۘۚۥ۫ۚ۟۟ۨ۟۠ۗۨۡۙ۬ۧۙۡۜ۫ۦۙ۟ۗ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥۣ۟, reason: contains not printable characters */
    public static Boolean m1201(Object obj, String str) {
        C0341oa.m915(new byte[]{66, 20, 104, -22, 32, 119}, new byte[]{126, 96, 0, -125, 83, 73});
        try {
            return Boolean.valueOf(XposedHelpers.getBooleanField(obj, str));
        } catch (Throwable th) {
            StringBuilder sb = AbstractC0149b0.f695;
            AbstractC0149b0.a.m817(th);
            return null;
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۤ, reason: contains not printable characters */
    public static final Object m1202(Object obj, String str, boolean z) {
        C0237h4.m1090(C0341oa.m915(new byte[]{-89, 68, 22, 64, 122, -11}, new byte[]{-101, 48, 126, 41, 9, -53}), obj);
        try {
            return XposedHelpers.getObjectField(obj, str);
        } catch (Throwable th) {
            String str2 = "ۜ۠ۖ۠۠ۜ۫ۥۨۘ۬ۤۤ۬ۜۛۢۗۜۘۥۗۘۘ۟ۛۦۘ۫۟ۧۗۨۧۘۤۖۥۘۙۚ۫۫ۖۥۘ۫ۜۥۙۘۙۘۦ۠ۚۨۖۘ۫ۨ۟ۡۦۧۢۦۡۤۙۨۜ۬۠ۤ۬ۧۘۡۘۚۜۤۛۤۡۜ۠";
            while (true) {
                switch (str2.hashCode() ^ (-289809772)) {
                    case -2043098450:
                        String str3 = "ۤۦۡۤۧۥۘۖ۫ۛۚۜ۫۫۟ۙۥۛۜۨۛۖۘۛۛۧۗۢۖۖۖۨۡۨۘۗۨ۟ۚ۠ۢۗۧۖۘۗۗۥۖۖۛۧۙۨۘۥۧۧۦۙۡۘ۠۠۫۟۬۬";
                        while (true) {
                            switch (str3.hashCode() ^ 1948227054) {
                                case 493355634:
                                    str3 = "۟ۡۥۙۡۘ۫ۢ۫ۖۛۡۢۥۘ۠ۙ۬ۚۦۖۧۧۢۧۜۛۙۦۥۘۖۘۤۗۚۜ۠ۡ۬۫ۡۖۦۗۛۘۛۜۘۢۦۡۘۚۜۗ۟ۤۦۘۗۢۦۗۤۧۛۘ۬ۦ۠ۦ۠ۙۨ";
                                    break;
                                case 1762461322:
                                    str2 = "ۧۗۘۘۛ۫ۜۘۜۧۗ۟ۢۨۘۧۙۡۦۥۨ۟ۘۜۤۨۢ۟ۗۘۘۨ۬ۦۘۨۖۙۧۦۦۙۦۖۤ۟ۥۘۘۨۢۦۨۘۜۙ۫۫ۖۗۧۖۦۥۜۖۘۨۦۜۘ";
                                    continue;
                                    continue;
                                case 2012951774:
                                    String str4 = "ۧۡ۬ۨۙ۫۬ۖۢ۠۠ۦۙۧۙ۟ۛۖۖۧۘۢۛۡۥۚۦۧۘۢۛۡ۟۠ۛ۟۟ۚۥ۬ۗ۟ۨۨۦۧۧ۟۠۠ۖۚۢ۠ۤۡۗ۫ۜ۟ۜۧ۫ۥۤۜۡۘۘۛۖۘ";
                                    while (true) {
                                        switch (str4.hashCode() ^ (-2069381582)) {
                                            case -2139603055:
                                                str4 = !z ? "ۛۥۛۙۧۥۢ۠۬۟ۦۢۙۧ۬ۡ۫۠۠ۚۦۦۙۢۛ۟ۦۘۢۗۖۤۙ۫ۡ۠ۚۦۙۜۡۦۘۘ۫ۨ" : "۟ۧۤۘۘۧۘۨۢۘۡۘ۫ۖۥ۫ۙۡۘۨۢۜۘۤ۬ۚۛۙۥۘ۫ۦۚۨۗۡۘۜ۟ۥۜۤۢۨۛۥۘۦ۬ۦۘۛ۟ۦ۟ۚۚۤۢۘ";
                                                break;
                                            case -1714928389:
                                                str4 = "ۛۢۖۘ۬ۥۡۘۦۚۘۘۚۦۘ۫۬ۦۘۖ۟ۧۡۙ۠ۨ۫۠ۢ۫ۖۧ۟ۡۘۜۧۘۘۙ۫۫۠ۗۤۙۖۨۘۧۚۨۘۚۦۦۘ۬۫ۨ۟ۢۧ۟ۤۤۤۚ۬ۢۨۜۘۚ۠ۗۥۘۜۗۙۢ۬ۥۙ۟ۖۘۥ۟ۢ";
                                                break;
                                            case -1551322198:
                                                str3 = "۠ۘۡۘۙۥۨۜۘۘۘ۫۫ۦۢۨۦۘ۬۟۫ۥ۠ۦۘۖ۟ۥۗ۠ۥۡۙۤۜۜۘۦۨ۟۠ۨۡۙۘۗ۟۫ۤ";
                                                break;
                                            case 226722665:
                                                str3 = "۫۠ۖۙۛۦۘۢۛۖۘۗۚ۟۫ۨ۠ۧۘ۫۬ۥ۫ۨ۬۠ۗۙۢۧۤۥۘ۬ۥۧۘ۫۬ۡۘۖۡۢۡۗۦۜۨۦۘ";
                                                break;
                                        }
                                    }
                                    break;
                                case 2140123574:
                                    str2 = "ۥۙۤۙۡۜۡۧۡۧۥۥ۟ۜۨۘۧۛ۠ۙۡۤ۬ۖۡۘۥۛۜۘۦۢۖۥۧۡۡۢۗۙۥۦۘۗۨۖ۠ۨۜۥۛۢۛۚۧۜۗۨۘ";
                                    continue;
                            }
                        }
                        break;
                    case -910727049:
                        StringBuilder sb = AbstractC0149b0.f695;
                        AbstractC0149b0.a.m817(th);
                        break;
                    case -608964975:
                        break;
                    case -510748793:
                        str2 = "ۦ۬ۤۥۤ۟ۛۛۦۘۡ۫ۛ۟ۤ۠ۖۙۡۘ۬ۚۢۘۥۖ۠ۥۗ۠۬ۥۥۙۥۘۧۖۤۙۧ۫ۥۥۨۙۗۧۖۤ۠۟ۤۜۙۘ۫";
                        continue;
                }
            }
            return null;
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۥ, reason: contains not printable characters */
    public static /* synthetic */ Object m1203(Object obj, String str) {
        String str2 = "ۗۧۘۘۙۨۧۤۥۧۜۚ۟ۢۦۘۘۢۙۧۥۘۛۧۡۘۚۚۢۛۗۖۘۦۡۨۘ۠ۚۢۨۚۖۘۦۗ۟ۚۖۤۛ۠ۛۤۙۘۘۦۜ۬ۗ۬ۛۜۡۥۘۥ۬ۨۘۙۨۛ۠ۥۜ";
        while (true) {
            switch ((((((((str2.hashCode() ^ 473) ^ 416) ^ 820) ^ 797) ^ 498) ^ 303) ^ 293) ^ (-1519613555)) {
                case -935488786:
                    str2 = "ۧۜۡۚۙۦۘ۟ۖۥۘۛۤ۟۟ۖۦۜۧۢ۠ۜۥۗۦۨ۟ۖۘ۬ۤۜۘ۠ۙۚۤ۟۠ۛ۟ۜۘ۟ۨۥ۠۫ۘۚۚۢۤۦۨۥۡۚۢ۫ۗ۫ۧ۠ۘۡۦۘۨۧۨۨۖۜۘۙۤۘۜۧۜۚۨ۬ۚۤ۫";
                    break;
                case 1326178282:
                    return m1202(obj, str, false);
                case 1553739991:
                    str2 = "ۥۘۦۘۥۤۖۢۛۜۘۦۖۘۙۚۤۥۤۢۦ۬ۚۖۜۖۤ۟ۥۚۖ۫ۖۥۘۘۢۛۘۜۡۧۧ۟ۦۚۦۘۘۨۜ۬ۜ۬ۚ۠ۥۦۘ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۦ, reason: contains not printable characters */
    public static Object m1204(Object obj, String str) {
        String str2 = "۫ۤ۫ۘۥۖۘۥ۫ۡۘۨۧۛۢۚۨۘۢۡۧۘۘۗۗۖۚ۫ۨۙ۫ۧۗۖۜۧۜۨ۟۟۟ۚ۬۟ۨۘۡۖۥۘۤۡۜۦۚۜۗۖۥۘۚ۟۫۬ۡ۬ۖۙۚ";
        Object obj2 = null;
        Object objM1202 = null;
        while (true) {
            switch ((((((((str2.hashCode() ^ 154) ^ 829) ^ 941) ^ 314) ^ 387) ^ 108) ^ 35) ^ 716028851) {
                case -1546591478:
                    String str3 = "۫ۘۡ۟ۡ۟ۢۘۚۛ۠ۗۖۜۗ۟ۥۨۘۨ۠ۜۙۙ۫ۨ۬ۚۘۙۤۧۤ۟ۡ۬۠ۦۡۡ۟ۤۥۘۙۖۤۤۥۖۛۗۚ۟ۙۥۨ۬ۨۨۦۙۦۘۡۘۦۦۜۘ۠۟ۚۙۦۨۘ";
                    while (true) {
                        switch (str3.hashCode() ^ 42436976) {
                            case -1859423489:
                                str3 = "ۡ۫۬۫ۦۘۘۦ۫۟۫ۙ۬ۡۥۚ۟ۖۘۚۛۗۖۙ۫ۦۥ۫ۙۨۧۙۥۛۡۚۜۤۗۜۖۤۖ۠۟ۛ۟ۖ۬ۧ۠ۖ۟۫ۧ";
                                break;
                            case 274860548:
                                str2 = "ۨۧۜۘۦۢۦ۟ۗ۠ۖۢۢۤۢۦۘۨۧۚۤۘۨۘۡۛۧۤۢۧۛۘۥۘۙۥ۠ۜۚۗ۟۠ۡ۫ۥۗ۠۟ۘۢۜۘۥۚۨۥۙۘۘ۟۠ۥۧ۫ۥۘۖ۠ۘۘ";
                                continue;
                            case 688750698:
                                String str4 = "ۧ۫۟ۘۘ۟۟ۘۗۖۚ۠ۤۜ۟ۧ۫ۨ۟ۛۨۘۨۢ۬ۘۢۚ۠ۜۘۘۦ۠ۧۙۢۡۘ۬۟ۤۡۨۖۖۢ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-349665038)) {
                                        case -1753893951:
                                            str4 = "ۤۤۖ۠ۤۗۡۗۙۤۘۗۦ۫ۘۜ۠ۨۜۨۧۘۗۖۥۘۧۘۘۗ۬ۦۨۧ۟ۡۙۧۘۦۜۘ۠ۙۦۘۢۡۦ۫ۙۡۦۨۘۖ۫ۨۘۙۗۨۘۗۦ۟۬ۖۦۦۗ۟ۡۙ۬ۘۢ۬";
                                            break;
                                        case -927349812:
                                            str3 = "ۖۢۨ۟ۙۥۘ۫ۡۥۘۗۖۦ۠ۜ۟ۨۢۤۛ۠۠ۥۘۧۘۡۙۨۦۢۨۘۖۨۢۙۤۦۘۧۡۜۘ۟ۜ۫ۙۜۖ";
                                            break;
                                        case 211124719:
                                            str3 = "ۗۘۦ۬ۢۦ۠ۗۡۖۘۡ۟ۦۗۨۚۢۗۦۜۘۧۘۘۘۖ۬ۜۘۖۚۢۛۥۡۙ۬ۛۙۢۥۚۧۡۘۧۡۨۘۧۚۥۧۦۤۗۡۥ";
                                            break;
                                        case 1899999712:
                                            String str5 = "ۧۘۚۘۧۨۥۤۨۜ۠ۤۘ۟ۘۘۛۡۙۗۘۜ۬ۧۧۗۜۜۢۥۡۜۖ۟ۡۛۙۢۛۥۘۖ۟ۡۗۙ";
                                            while (true) {
                                                switch (str5.hashCode() ^ 1053771338) {
                                                    case -1558632579:
                                                        str5 = objM1202 == null ? "ۚ۟ۘۢۙۦۘۦۛۗۜۨۖۜۧۥۦۛ۟ۙۧ۟ۗۘۤۤۙۚ۬ۡۤۙۤۨ۟ۥۘ۠ۨۤۙۖۗۛ" : "۬ۜۥۘۡۚ۠ۙۦۘۘ۬ۨۦۘۧۤۖۘ۫ۦۤۦۧۚۘۦۡۚۖۛۡۧۡۘۦۛۜۛۖۢ۟ۜۦۘۛۖۡۘ۫ۚ۬ۛۙۡۤۦۘۤ۠ۡ۟ۗ۫۬ۛۦۘۨ۠ۜۘ";
                                                        break;
                                                    case 801975985:
                                                        str4 = "ۛۧ۫ۥ۠ۥۘ۬ۜ۫۟۠۠۠۬ۖۖۗۜۘۤ۟ۨ۠ۧۜۘۜۛۚ۠ۤۚۘۘۘۘۨ۬ۘ۫ۖۥۘۛ۠ۖۗ۠ۘۘ";
                                                        break;
                                                    case 966588117:
                                                        str4 = "ۜۧۧۥۖۛ۬ۢۛۤۦۛۦۥۘۗۜۦۨۚۧ۫ۖۘۧۙۥۜۨۦۘ۠۠ۘۧۛۜ۟۫ۖۘ۠۫ۨۡ۟ۡ";
                                                        break;
                                                    case 2085864146:
                                                        str5 = "ۘۙۦۦۢۜۚ۠ۜۡۥۦۘ۠ۡ۠ۤۤ۫ۗۤۛ۠ۘۡۘۛۚۥۛ۠ۙ۫ۚۦۘۧۘۦۘۚۜۧۥۥۦ۬ۢ۠ۚۡۢۖۧۦۘ۫ۧۜۛۙۖۢ۬ۙۦۢۥۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 1955171599:
                                str2 = "ۛ۟ۘ۠ۨ۟ۘ۠ۗۥۦۜۖۗۘۚۜۘۧۙۜۤۚۛۢۡۜۘۚ۠ۡۜۚ۬ۗ۫ۚۜۡۘۢۛۡۘۖۢ۫ۘۨۘۘۢ۬ۜۤ۟ۤ۠ۧۜۘۖۦۥ۬ۙ۠۠۠۬ۤ۫ۧۛۚ";
                                continue;
                        }
                    }
                    break;
                case -1415120778:
                    C0237h4.m1090(C0341oa.m915(new byte[]{-46, 28, 25, 78, 123, 27}, new byte[]{-18, 104, 113, 39, 8, 37}), obj);
                    str2 = "ۙۥۨۦۗۚۥۚۤۢۤۖۘۢ۟ۘۙۘۖ۠ۙۡۘۦۖۛۘۜۗۗۤۛۙۛۢۥۘۖ۠ۨۛۘۜۙۧۢۥۘۧۢۚۛ۫ۜۘۗۛۢۤۚۡۘۖۙۨۘۡ۫ۨۘۢۛۥۘۧۥۥۛۡۧۘۙۚۜۢ۬ۢ۫ۙۘۘ";
                    break;
                case -1210868922:
                    objM1202 = m1202(obj, str, false);
                    str2 = "ۖۤۘۙۡۚۙۘۗ۬ۧۘۘ۬۫ۥۘۤۢۤۥۧۛۧۚ۟ۚۢۛۨۘۗۛ۟۟ۤۗ۟ۗ۠۫۠ۖۘۤۦۧ";
                    break;
                case -1030666359:
                    return obj2;
                case -994045877:
                    str2 = "ۘۧ۬ۛ۫ۧۨ۠ۤۤۖۨۛۛۛۜۖۤۡۘۘ۠ۧۡۘۘۘۥۘۨ۟ۦۢۥۚۨۢۨۚۙۜۖ۟ۡۘ۠ۡۥۘۖۙۤۙۜۤۖ۫ۡ۫۬ۦۦۦۗۡۥۨۘۧۤ۬۟ۡ۫ۙۙۧ";
                    obj2 = objM1202;
                    break;
                case -402255950:
                    str2 = "ۡ۠ۖ۠ۢۨۗۛۤۢۧۜۘۡ۫ۚۧۗۡۗۧۢۢۦ۠ۡۨۜ۟۫۫ۥۖۥۡۜۡ۬ۨ۟ۤۤۚ۫ۦۚۢۥۨ۟ۛ۬۟ۘۘۢۘۜۘۖۥ۬ۙ۫ۡۜۧۤۚۡۦۘۤۖۘ";
                    break;
                case -263338936:
                    str2 = "ۛ۟ۘ۠ۨ۟ۘ۠ۗۥۦۜۖۗۘۚۜۘۧۙۜۤۚۛۢۡۜۘۚ۠ۡۜۚ۬ۗ۫ۚۜۡۘۢۛۡۘۖۢ۫ۘۨۘۘۢ۬ۜۤ۟ۤ۠ۧۜۘۖۦۥ۬ۙ۠۠۠۬ۤ۫ۧۛۚ";
                    obj2 = null;
                    break;
                case 321000812:
                    str2 = "ۥۢۧۥۡ۫ۡۖۦ۫۟ۗۦۖۧۘۚۧ۬ۧۨۘۥ۬ۜۘۤۡۨۚۡ۫ۤ۫ۥ۬ۢۖۡۜۦۘۛۚۢۖۚۘۤۡۧ۫ۧۥۘۘۛۖۘۧۘ۠۠ۡۙ۟ۘۘ۠ۧ۬ۜۛۡۘۗۖ۫۠ۤۖۘۚۘۗۨۤۡ";
                    break;
                case 1778329234:
                    str2 = "۫ۨۢۘۙۛۢۦۘۙ۬ۢۧ۟۬ۜۜ۫۫ۢۢۚۥۛۗۧۢۙۛۨۘۛۘۜۖۚ۠ۤۧۖ۠ۜۘۘۘۘۛۢ۫ۨۘۦ۟ۡۘۖۤۖۜۡۘۘۘۧ۟ۖ۬ۘۘۨۛ۠ۗۙ۠ۘۛۦۤۥۗۢۚۘۤۤ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۧ, reason: contains not printable characters */
    public static Integer m1205(Class cls, String str) {
        C0341oa.m915(new byte[]{-92, 111, 87, 18, -126, -25}, new byte[]{-104, 27, 63, 123, -15, -39});
        try {
            return Integer.valueOf(XposedHelpers.getStaticIntField(cls, str));
        } catch (Throwable th) {
            StringBuilder sb = AbstractC0149b0.f695;
            AbstractC0149b0.a.m817(th);
            return null;
        }
    }

    /* JADX INFO: renamed from: ۥ۟ۨ, reason: contains not printable characters */
    public static Integer m1206(String str, String str2) {
        String str3 = "ۘۚۤۡ۬ۥۘۤۨۙۤۙۘۘۥۤۘۘۥۗۢۜۛۨ۬ۜۨۙۘۡۛۡۛ۟ۧۖۥ۫ۥۢۥۘۡ۫۟ۡۖ۠۬ۨۦۙ۬ۘ";
        Integer numM1205 = null;
        Integer num = null;
        Class clsM1199 = null;
        ClassLoader classLoader = null;
        while (true) {
            switch ((((((((str3.hashCode() ^ 971) ^ 864) ^ 114) ^ 504) ^ 174) ^ 395) ^ 129) ^ (-1048431058)) {
                case -1846353113:
                    str3 = "ۢۛۨۨۧۘۘۖۚ۬ۦ۫ۨۤ۫ۨۘۛۙۥۘ۟ۥۨۘۡۚۛ۟ۥۘۘۤۛۖۥۜۥۘۙۥۙۘۧۘۘ۫۟ۖۘۜۛۖۖۢۨۘۢ۫۟ۖۘ۟ۢۥۦۢۛ۫ۢ۬ۗۦۚۖۘ۠۬ۘ۫ۥۧ";
                    break;
                case -1646877935:
                    C0341oa.m915(new byte[]{-76, -78}, new byte[]{-41, -34, -79, 58, 100, 28});
                    str3 = "ۗۥۖۙۥۜۡۤۙۘۚۥۜۢۖۘۚۢ۫ۜۘۘۜۚۗۨۛۥۦۧۦۥ۟ۛۚۖۜۘۚۥۦۘۗۜۦۘۤۗۢ۠ۡۥۦۡۘۢۖ۠ۨ۟ۨۨ۬ۗۜ۬۫ۨۨۘۡۦۜۢۥۖۘۗۢۦۚۗۚۧ۟ۗ";
                    break;
                case -1359866910:
                    String str4 = "ۥۨ۠ۢ۠ۚ۫ۘۧۘۤ۟ۦۘۨ۫ۙ۠۟۟ۚ۠ۖۘ۬ۧۚ۠ۘۗۤۘۗۢۦۡۘ۟ۥۢۧۖ۫۠ۚۘ۬ۙۘۘۥۙۜۘۚۚۥۘۢ۟ۥۘۜۖ۫ۧۤ۠ۥۘ";
                    while (true) {
                        switch (str4.hashCode() ^ 1558079627) {
                            case -948252079:
                                str4 = "ۖۜۧۘۤۢۙۚۢۘۚۙ۠ۢۨۘۦ۟ۦ۠ۨۖۥۖ۟ۤۦۜۘۚۗۥۘۜۤۛۥۧۙۦ۟ۢۛۤۡۥۢۘۧۤۢۧۤۥۛۨۥۘۘ۫۠ۘۘۚۤۡ";
                                break;
                            case -833174084:
                                str3 = "۬ۙۦۘۙۨۖۢۜۙۜۨۘ۠ۧۗۜۚۥۦۧۧۘۙۛۗۥۘۜۜۧۘۗۚۜۘۙۗۥۦ۟۟ۡۥۧۘۢۦۛۧۦۘۧۘۖۢۤ۫۠ۡۛۥۤ۠ۤۨۦۘۛۡۡۘ۟ۗ۟ۛ۠ۜۘ";
                                continue;
                            case 933276583:
                                str3 = "۠ۙۙۧ۟ۛۛ۠ۖۤۘۡۘۘۙ۫ۛ۠ۚۚۖۜۘۙۡۥۘۨۛۥ۠ۖۛۡۥۦۙۙۨۛۤۡ۬ۤۚۡۨۘ۬ۡۧۚۧ۫ۘ۬ۘۧۖۦۘۧ۫۟ۗۤۦ";
                                continue;
                            case 1368591722:
                                String str5 = "ۖۢۨۦۘ۬ۡۛۙۚۦۘۘۚۦۘۗۙۜۘۚ۠ۙۘ۠ۜۘۚۤۦۖۘۜۘۖۘۛۛۦۛۜ۠ۙ۫ۢۚۡۗۜۤۖۘۢۦۢۜۜۥۦۡ۬ۜۥۘۧۨۘ";
                                while (true) {
                                    switch (str5.hashCode() ^ 1976921921) {
                                        case -1844151780:
                                            str4 = "ۘ۟ۦۘۖ۠ۗۨۢۛ۬ۚ۟ۙ۠ۡۤۙۤۛۥۜۗۡۨۘۢۤۜۘۖۥۦۘۡۥۦۘۧۢۥ۬ۨۥۦۘۢۨۖۚ۬ۥۙۧۦۡۘۛۚۛۙۚۖۘۧۗ۫ۦۗۖۗۧۖۘ۠ۜۨۡۦۗۤ۫۬ۛۘۡۦۙۚ";
                                            break;
                                        case -1258303060:
                                            String str6 = "ۘۢ۠۬ۨۡۙۢۤۖۥۥۡ۟ۡۙۧۘۘۢ۟ۚۤ۫ۤ۠۫ۥۘۚ۠۬۟ۙۛۨۘۙۙ۬ۚ۠ۗۘ۫ۛۦۡۗۤ۫ۛۘۨۘ۬";
                                            while (true) {
                                                switch (str6.hashCode() ^ (-963965663)) {
                                                    case -1566640622:
                                                        str5 = "ۖۗ۬۬۠ۚ۟ۜۜۖۢۥۘۧ۟ۦۘۗۖۜۘۜۜۧۘۜ۟ۦ۬ۧۥۘۧۡۛۙ۫ۡۜۨۧۘۨۙۜۢۘ۟ۚۖۥۘۗۙۥۙ۬۠۬۬ۘۘ۬ۛۦۘۢۘۜۛ۫ۛ۬ۥۤۤۗۤۥ۠ۛ۠۠ۛۘۚۤۛۦۤ";
                                                        break;
                                                    case -163527215:
                                                        str6 = "۫ۗۡ۬ۨ۫ۢۖۙ۬ۢۘ۫ۧۖۘۙۤ۫ۙ۫ۡۘۦۧۚ۟ۢۘۘ۬ۛ۫۠ۜۦۦۖۙۘ۬۫ۡۜ۬ۛۛۘۛۧۤۥ۬ۤ۠ۗۨۘۢ۫۬ۚۤۙۡ۬ۢ۟ۤۖۦۥۘۥ۬۫";
                                                        break;
                                                    case 458654158:
                                                        str6 = classLoader != null ? "۫۬ۨ۠ۗۦۘۗۢۨ۠ۛۖۘۛۖۧۘۧۗۚۗ۫ۥۧۙۥۘۤ۫۫ۨ۠۫۬۬ۨۖۢۛۚۚۥۜۤۘۘ۬ۡۦ۟ۚۙۡۜۧۘ۟ۨۧ" : "۟ۢۘ۠ۖۜۘ۬ۙ۟ۢۛ۬ۢ۫ۨۘۥ۫ۖۘۡ۫ۜۘۤ۟ۤ۫ۚۡۘ۬۫ۡۚۙۡۥ۟ۛۖۤۡۘ۟ۡۥ۬ۨۤۤ۬ۗ۬ۢۡۘۤ";
                                                        break;
                                                    case 1031244681:
                                                        str5 = "ۚۗۤۖۦ۫ۜۨۡۘۤۛ۫۫ۘۦۘ۬ۦۧۦۦۡۘۘ۟ۦۧۢۨۥۡ۠ۛۦۜۘۢ۟ۡۘۗۚۦۥۖۜۘۡۗۡ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1458445689:
                                            str4 = "ۢۤۜ۠۫ۛۘۗ۟۠۟۟۠۫ۚ۫ۚۖۘۧۥ۟ۜۥۛۤۛۗۙۛۜۘۚۘۚۦ۫ۗۦۡ۠ۚۤۨ۬ۚ۬";
                                            break;
                                        case 1505412325:
                                            str5 = "۠ۛۨۘۡۘۖۗۜۙۤۦۤ۟ۦۜۘۖۥۘۘ۠ۦۜۘۘ۬ۥۧ۬ۖۙۧ۫ۦۥۦۥۡ۫ۚۙۙۜۦۡۘ۬ۨۢۢ۫ۘۘۛۗۨۘ۟ۡۨۘۧ۫ۢۥۤ۫ۥ۬ۧۗ۠ۜۘۨۤۥۘۧ۟ۥۖۥۖۘۧ۫";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -1128284716:
                    throw null;
                case -952345840:
                    clsM1199 = m1199(str, classLoader, 2);
                    str3 = "ۜۜ۟ۤۡۘۜۗۡۡ۬ۢۧۜۨۥۤۜۤۙۡۧۘۧۘۙۘۜۤۧۦ۫ۡۧۘۚۗۡۘۨۖۢ۠ۧۘۘۙ۠۟۠ۡۘۘ۫ۡۜ۬ۗۢۦۚ۟ۚۢ۬۠ۖۘۤ۠ۨۘ۫ۥۨۘۥۗۗ";
                    break;
                case -945981465:
                    numM1205 = m1205(clsM1199, str2);
                    str3 = "ۘ۟ۜۘۤۤۡ۫ۦۥۘ۠ۦۢۦ۬ۖۘۚۖۦۘۦۚۚۡ۠۠ۛۜۚۙۡۤۡۖۚۨ۟ۗۜۨۚۛۘۙ۫ۥۛۤۙ۬ۥ۬۬۫ۙ۫";
                    break;
                case -267885488:
                    str3 = "ۧ۠ۢۜۘۥۘۨۧۦۘۧۘۨۘ۫ۢۛۢۦ۫ۤۡ۬ۛۢۛۤۦۢ۬ۖۧۤۦۗۨۤۛۘۗۚۙ۟ۢۙ۠۟ۜۗۙۘ۫ۦۧۘ۟ۡۢ۟ۛۦۘۘ۠ۢۤ۟۫۫ۨۘ۬ۢۤۘۖۘۡۨ۠ۥۥ";
                    num = numM1205;
                    break;
                case 185832767:
                    classLoader = C0292l3.f938;
                    str3 = "ۤۛۘۘۥ۫ۤ۠۟ۥۘۚۚۥۘۡۙ۬۫ۦۙۤۢۢ۟ۤۧۘۛ۟ۖۨۘۦ۟ۥۘۖۚۖۖۧۗۚۙۥ۫ۗۧۘ۠ۘۘ۬۫ۜۘۡۚۨۘۦ۟ۥۘۖ۬۠۬ۛۨۘۡۤۨۘ۫ۦۖۘۜۚ۟ۙ۠ۗۚۥۚۡۦۜ";
                    break;
                case 351459278:
                    str3 = "ۥۚۥۖ۠ۚ۠ۖۦۡۦۗۘۧۘۤۖۡۛۛۨۛ۬ۜۨۡۥۨۗۘ۫ۖۡۜۨۤۥۖۜۙۡۘۘۡۜۡ۠ۘۤۛۘۘۥ۫ۖۘ۟ۖۗۤۖۡۨ۟۠ۦۚۙ۠ۤۖۗۗۧ";
                    break;
                case 392335848:
                    String str7 = "۠۠ۤ۬۠ۛۘۜۙۘۡۧۘ۫ۖۛۢۚۧۦۡۡۘۤۗۤ۟۠ۤۗۨۥۥۨۡۘۜ۬ۢۚ۫۟ۘۢ۠ۤۘۛ۬۟ۖ۫ۛۢ۟۟ۡۘ";
                    while (true) {
                        switch (str7.hashCode() ^ 1274506684) {
                            case -1701067276:
                                str3 = "ۨ۬ۙۙۘۜۘۦ۟ۤۚ۬ۤ۠ۚۨۢۤۥۘۘ۟۟۬ۥۘۡۛ۬ۨۦۖ۬۫ۚۨۥۙ۠ۢۚۢۥۛۤۖۘ";
                                continue;
                            case 2065753:
                                str7 = "ۥۘۜ۠ۖ۫ۘۗۘۘۥۥۛۦۘۖۘ۫ۙۜۘۛۛ۟ۥۧۘ۟ۜۘۗۥۛۤۡۦۘ۠ۚۖۤۘۦۘۛ۬ۧ۟ۘۢ۠ۖ۬۫ۗۙۛۚ۬ۨۡۥۛ۠ۘۘۨۤۨۨۛۘۘۘۙۦ۫ۘۥ";
                                break;
                            case 82734542:
                                String str8 = "ۧ۬ۗۖۗۛۚۥۚۡۡۖۘۢۤۦۘۘۚۤۢۦۘۘۨ۠ۡ۠۬ۜ۫ۧۖ۫ۢۥۛۤ۬ۢۢۗۘۡۡۘۦۧۨۘۖۘ۠ۙۘۜۨۨۘۘۜۧۘۛۗۢ";
                                while (true) {
                                    switch (str8.hashCode() ^ (-495256943)) {
                                        case -2116498409:
                                            str8 = "ۧۧۛۤ۠ۨۜۨ۠ۚ۫ۙ۟ۢۙۖۗۥۘ۬۟ۦۛۛۧ۟ۜۤۘۘۛۖ۟ۛۛۛۜۘ۟ۧۡۗۤۨۢۡ";
                                            break;
                                        case -683233421:
                                            str7 = "ۗ۠ۗۤۜۖۘۜۛۢۙۙۚۖۖۧۦۧۢۙ۬ۖۘۗ۫ۙۚ۫۠ۢۦۙۘ۫ۘۗ۠ۡۘ۫ۥۖۘۧ۟ۦ۬ۧ۠ۧۖۚ۟ۡۤۦۨۙ";
                                            break;
                                        case 135380496:
                                            String str9 = "ۚۖۨۚۗۨۙۛۘۘ۠ۧۢ۟ۡۙ۟ۙۨۘۙۦۙۘۤۚۦۙۥۚۦۨۘۘ۟ۥۘ۬۠ۗۚۖۥۦۗۖۤۡۡۘۨۧۥۘ۫ۨۖۘۦ۬ۥۘ";
                                            while (true) {
                                                switch (str9.hashCode() ^ 1153042832) {
                                                    case -1988757120:
                                                        str8 = "ۥۛۥۧۥۨۦۙۖۢۧۘۘۥۦ۠ۡۦۥ۟ۙۨۦۚۡۘۨۛ۫۟ۘ۠ۜۤۙۗۢۜۥۘۦۘۚ۠ۖۘۤۤۤ";
                                                        break;
                                                    case -1177260070:
                                                        str8 = "ۜۨۖ۬ۦۖۘۥۧۥۗۧۙۢۦۜۘۡۖۧ۫ۨ۟۬ۢۥۘۧۡۙۙ۠ۖۘۦۖۢۖۘۤ۫ۦۨۖۜۦۘۙۜۧۘ";
                                                        break;
                                                    case 1246591598:
                                                        str9 = clsM1199 != null ? "ۢۧ۫ۘۗۦۘۗۦ۫ۢۢۨۘۛۖۦۘۢۙۛۧ۠ۘۘۖۛۥۢۜ۠ۗۚۗ۫ۦۘۜ۟ۦۨ۬ۖۨ۠ۖۚ۫ۛ۠۠۠ۙ۬ۦۘ۫ۗۥۘ۟ۘۜۨۖۜۘۜۜۥ" : "۠۟۫ۥ۠۬۠ۢۨۥۖۜۘۖۜ۟ۚۧ۠ۜۡۚ۠ۥۖۙۘۘۘ۠۟ۦۥۨ۫ۛۥ۠۠ۥۘۦۦۜۘۗۧۥۙۖۡۧۡۧ۠ۧۖ۫۬ۡ۟ۥۤۜۘۘ";
                                                        break;
                                                    case 1655302631:
                                                        str9 = "ۚ۟ۘۧۛۙ۫۫ۦۘۚۧۢۘۛۥۘ۬ۦۚۚۗۜۘۢ۠ۖۛۖ۠ۧۤ۬ۘۜۡۗۡۚ۟۫ۜۥ۫ۙ۟ۥۦۘۡۡۨۘ۫ۥۖۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 775525708:
                                            str7 = "ۨۨ۟ۘۚۦۙۧۡۤۛۨۛ۬ۜۛۖ۫ۧۘۥۘۗۗۢۜۘۖۘ۟۟ۚۗ۫ۡۗۚۖۥۛ۟ۜۘۛۨۗ۬ۧ۟ۨۚۧۗۘۨۘ";
                                            break;
                                    }
                                }
                                break;
                            case 247532879:
                                str3 = "ۧ۠ۢۜۘۥۘۨۧۦۘۧۘۨۘ۫ۢۛۢۦ۫ۤۡ۬ۛۢۛۤۦۢ۬ۖۧۤۦۗۨۤۛۘۗۚۙ۟ۢۙ۠۟ۜۗۙۘ۫ۦۧۘ۟ۡۢ۟ۛۦۘۘ۠ۢۤ۟۫۫ۨۘ۬ۢۤۘۖۘۡۨ۠ۥۥ";
                                continue;
                        }
                    }
                    break;
                case 546162137:
                    return num;
                case 764789350:
                    str3 = "ۦۧۜۘۛۨۗۢۗۥۘ۠ۤۨ۟ۢ۟ۜۧۧۦ۬ۤۡۤۘۜۘۥۘۥۡۚ۫ۘۦۨۜۛ۬ۗۗۧۗۦۚۚۘۘۗۥۘ۫ۛۡ۟ۢۚۛۥۦۘۗ۬ۡۙۤۨۘۘۛ۠ۖۨۘۡۤۡۘۢۜۨۘ۬ۚۜ۠۬ۦۘ";
                    num = null;
                    break;
                case 1210265934:
                    str3 = "ۘ۠ۖ۟ۥۖۘۦۚ۟۟ۢۘۡ۠ۡۖۡۥۗۨ۬ۜۜۖۘۧۦۘۖۙۥۘۙ۬۬ۜۢۛۨۚۥ۟ۙۢۦۡ۫ۛۧۥۘۛۡۜۘ۬ۡۜۡۘۤۙۢ۠ۗ۠۬۠ۤ۫ۚۦ۫ۙۥۡۦۡۨۧۚۖۘۤۚ۬";
                    break;
                case 1495789681:
                    C0341oa.m915(new byte[]{83, 7, 21, 5, -30, -56}, new byte[]{111, 115, 125, 108, -111, -10});
                    str3 = "ۢ۠ۧ۟ۥۡۘۦ۬ۚۙۥۥۜۘۥۖۦۘۢۗۡۥۢۥۘۧ۠ۖۡ۬ۤۗۢ۫۫ۗۛۜ۬ۦۘ۟ۧۛۖۡۤۖ۬ۜۨۦۜۘۤۖۨۘۚۤ۫ۜ۫ۧ۟ۥ";
                    break;
                case 1706227115:
                    C0237h4.m1092(C0341oa.m915(new byte[]{-78, 10}, new byte[]{-47, 102, 55, 90, 4, -54}));
                    str3 = "ۗ۬ۚۚۜۘۘۢۗۤۗ۠ۡۢ۟ۥۘۥۦۚۡۧۦ۟ۧۨۡۖۘ۫ۨ۟۬۫ۥۘ۟ۦۢۧۦۚۧۤ۫ۥۘۙۥۤۢۘ۫ۙۧۖۤۚۛ۬ۤۜۘۖ۠ۡۡۙۡۨۧۙۙۢۥۘ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۠ */
    public static Object m928(String str, String str2) {
        ClassLoader classLoaderM1137 = C0292l3.m1137();
        C0341oa.m915(new byte[]{43, 106, -24, -29, -13, 68}, new byte[]{23, 30, -128, -118, -128, 122});
        C0341oa.m915(new byte[]{-27, -29}, new byte[]{-122, -113, -114, -36, 33, 112});
        Class clsM1199 = m1199(str, classLoaderM1137, 2);
        String str3 = "ۙۜۤۨۚۡۡۗۧۖۚۙۧۖۡ۟ۡۘۦۙۦۘۖۚۢۨۖۘۧۦۥ۫ۡۖۨۤۘۦۚۘۢۡۖۘ۫ۦۧۖۢۥۢۗ۟ۛۗ۠ۜۥۧۡۨۖۙۦ۬";
        while (true) {
            switch (str3.hashCode() ^ (-969168236)) {
                case -1878303548:
                    return null;
                case 361220457:
                    String str4 = "۫ۧۖۥۦۤ۫ۜۙ۠۟ۗ۫ۙۤ۬ۥ۟۟۟ۚۗۥۡ۫ۜۘۢۦۗۚۧۜۚۧ۠ۨۥۘۢ۫ۖۘۡۦۚۨۦۡۙۗۥ۬ۘۖۧ۟ۢۗۡۨۗۖۜۤۜۘۛۥۨۘۗ۬ۧۖۥۖۥۥۦۘۤۛۖ";
                    while (true) {
                        switch (str4.hashCode() ^ 2108086716) {
                            case -1458998275:
                                str4 = "ۢۛۧۚۜۦۤۦۘۘ۬ۜ۟ۙۥۘۢۢۘۘۛ۬ۜۘۗۥۧ۫ۨۥۘۥۜۦۘۘۛۤۘ۠ۘۚۘۘۘۧۘ۟ۥۢ۠ۦۥۗۘۥ۠ۘۚۤۗۦۛ۬ۘۗۧۖ۬";
                                break;
                            case -446755106:
                                String str5 = "۫ۡۨۘۦۥۜۘۘ۠ۧۙۚ۟۬ۖۜۘۢۙۚۨ۠ۖۘۖۡ۫۫ۙۜۛۡۦۙۢۦۜۛۛ۬۠ۚۜۡۖۛۙ۟ۨۢۧ۟ۤۨۚۤۡۘ";
                                while (true) {
                                    switch (str5.hashCode() ^ 884264167) {
                                        case -651063502:
                                            str4 = "۠ۚۘۗۦۘۨ۫ۘۤۗۧۙۘ۫۬ۦۢۥۘۦۘۖۖۧۘۗ۟ۜۘۧ۫ۡ۬ۗ۫ۙ۟ۢۘۛۦۘۖۖۥۘۦۚۖ";
                                            break;
                                        case -621325635:
                                            str5 = "ۥۥۢۘ۠ۢۧۘ۠ۨۧۨۥۛۚۥۨۧ۟ۢۥۙۦۘۘ۫۠ۘۚۘۖۙۜۘۘۜ۫ۛۨۡۥۘ۠۫ۜ۫ۥۘۖ۫۫ۧ۫ۥ۬ۡۘۘ۟۫ۛۥ۠ۨۚۛ۬ۛۖۘ۠ۛۘ۫ۥۤ۠ۚۘۘۧۘۦۘۗ۫ۜۘ";
                                            break;
                                        case -369884547:
                                            str4 = "ۢۚ۫۫ۘۖۗ۠ۗ۟ۖۡۡۡۘۗۤۖۢۜۡۛ۫۠۟ۙۛۖۚۨۘۢۛۧۖۧۖۘۢۖۖۧۛۗ۬ۤ۬ۙۚۦۘۗۨۘۧ۟ۨۘ";
                                            break;
                                        case 2111088276:
                                            str5 = clsM1199 != null ? "ۙۢ۟ۛۛۘ۫۫ۢۖۡۘۘۜۧۦۘۧۧۡۘۤ۬ۛۙۧۙۤۚ۟ۜۧ۠ۚۥۧۘ۫ۖۗۢ۟ۤۤ۫۠۠ۜۘۙ۟۠۟ۦۘۜۢ" : "ۤۧۦ۫ۙۨۘۜ۬۬ۥ۠ۘۚۡ۫ۦۢۡۘۛۚۛۚ۬ۦۘۗ۠ۢۤۦۨۘۧۥۛ۬۠ۡۜۡۡ۬ۜۘ۬۬۟ۗۦ۟ۜۜۧ۫ۙۗۚۙۗۜۘۚۘۦۘۖ۟ۥۘۗ۠۠ۦۖۚ۟ۧۜۦ۫ۛۚۘۧۘ";
                                            break;
                                    }
                                }
                                break;
                            case 675380413:
                                str3 = "ۢ۟ۦ۟۟ۖۖۜۢۜۛۘۨۧۜۘۚۨۖۘۚ۬ۥۧۨۧۘۘۛۨۘۙۚ۠ۖۥۡۘۢ۬ۥۘۘ۫ۚ۫ۘۘۦۢۛۛ۠۫ۨۘۥۘۤ۠ۤۧۛ۬ۖۛۖ۫۠ۖ۟ۛ۟۬ۗۥ۫ۢ۫";
                                continue;
                            case 1938573493:
                                str3 = "ۖۧۧۛ۬ۦۘۦۢۘ۠ۦۜۘۦۜۘۥۚۖۘ۫ۘۧ۫ۜ۠ۚۗۘۛۢ۠ۖۙۖۥۛۥۘۤۜۘۤۘۚۖۛ۠۟ۜۘۜۙۤۘ۟ۖۘ";
                                continue;
                        }
                    }
                    break;
                case 580569601:
                    str3 = "ۚۦۚۥ۠۬۫ۦۘۧۦ۟ۥ۫ۚ۫ۛۡۥۨۡۘۚۢۖۘۘ۠ۜۘۦۚۛۛ۠ۥۙۦۜۘۢۛۖۘۘۚۦۤۙۢۙۦۡ۠ۚۖۙۚۥۥۦۖۘۚ۫ۤۡ۠ۜ";
                    break;
                case 901182540:
                    C0341oa.m915(new byte[]{108, -12, 47, -109, 99, 14}, new byte[]{80, -128, 71, -6, 16, 48});
                    try {
                        return XposedHelpers.getStaticObjectField(clsM1199, str2);
                    } catch (Throwable th) {
                        StringBuilder sb = AbstractC0149b0.f695;
                        AbstractC0149b0.a.m817(th);
                        return null;
                    }
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۠۟, reason: contains not printable characters */
    public static final XC_MethodHook.Unhook m1207(Class cls, String str, Object[] objArr) {
        boolean z;
        C0183d6 c0183d6 = C0183d6.f755;
        C0341oa.m915(new byte[]{5, 65, -41, -62, 60, 5}, new byte[]{57, 53, -65, -85, 79, 59});
        C0341oa.m915(new byte[]{122, 18, 74, 2}, new byte[]{27, 96, 45, 113, -58, 75});
        C0341oa.m915(new byte[]{-117, -121, 102, -31, -47, 74}, new byte[]{-29, -24, 9, -118, -76, 56});
        Object[] objArrCopyOf = Arrays.copyOf(objArr, objArr.length);
        String str2 = "ۥۧۤۨۧۥ۠ۢۧۨ۫ۨۘ۬ۤۤۙۛۗۙۡۧۧۛۢۜۨۢۛۗ۬ۙۜۖۡۤۖۖ۠۠۫۠۬ۜۙ۟ۦۦۘۡ۫ۧ۫۫ۦۨ۟ۜۖ۬ۖۘۘ۟ۦۘۤۖۢۜۨۛۨۢۨۘ";
        while (true) {
            switch (str2.hashCode() ^ 1353290750) {
                case -2066352589:
                    break;
                case -921359495:
                    str2 = "ۙۛۦۡۥۘ۫۬ۥۗ۠ۢ۠ۦۢ۫ۜۚۦۦۗ۠ۜ۫ۚۨۗۖۙۦۘۘۙۖۚۤۦۤۧۧۛ۬ۙۚ۟ۚۛۙۘ۬ۤۡ۫۠ۙۚۡۘۛۦۢۤ۬ۛۥۢۡۘۙۥ۠ۥۘۥۢ۠ۘ۠۟ۘۘۢ۬ۚ";
                    break;
                case 462383017:
                    String str3 = "ۢۜ۠ۧ۟ۨۘۗۨۘۘ۫۟ۛۙۚۜۧۛ۬ۗۡۦۘ۫ۚۡۘ۬۬۫ۛ۠ۡۘۥ۟۟۫۟ۡۤ۠ۜۘۙۧۚۖۗۥۘۨۗۙ۫ۧۘۥۚۢۜۥۘۘۙۦۛۚ۟";
                    while (true) {
                        try {
                            switch (str3.hashCode() ^ (-1098085682)) {
                                case -1011823005:
                                    break;
                                case -547944327:
                                    z = false;
                                    break;
                                case -329380095:
                                    String str4 = "ۨۚۤۛ۫ۘۥۥۗۖۢۘۘ۫۬ۛۦۨۧۛۜۡۖ۟۟ۡۙۢ۫ۗۡۘ۠ۙۖ۬ۨۢۡ۬ۦۛۤ۠ۘ۟ۦۤۥ۟ۜۘۛۥۢ۟ۤۤۚۨ۠۫ۛۘۘ";
                                    while (true) {
                                        switch (str4.hashCode() ^ 2088463028) {
                                            case -1947329008:
                                                str3 = "ۥ۟ۦ۫ۖۦۘۦۧۡۘۢۦۜۖۜ۟۟ۨۘۤۡۧۘۚۡۥۘۖۖۦۤ۫ۘۦۙۨۖۛۥۘۗۘ۟ۖۧۘۘۜۡۜۛۚۥۘۥۗۙۢۙۛۢۤ۫ۤ۟ۘۘۢۗۡ۠ۢۖ۠ۧۨۖۨ۬ۘۡۡۘ۠ۚۘۘۘۤۧ";
                                                continue;
                                            case -957434872:
                                                String str5 = "ۚۨۨۘۛ۠ۘۤۢ۬۠ۧۜۖ۫۟ۥۦۨۗ۬ۦۘۤۧ۟ۜۨۨۜۖ۟ۗۡۘۙۜۗ۬ۜۘۘۧۛۤ۫ۜۢۛۥۤۧۛ۫۫ۙۜۘ";
                                                while (true) {
                                                    switch (str5.hashCode() ^ 1826823682) {
                                                        case -1703790219:
                                                            str4 = "ۦۤۡۥۡۙ۠۫ۜۤۘۡۢ۬ۥۘۥ۫ۙ۠ۜۘۘۢۥۤۚۦۘۢۡ۫ۦۘ۫۟۬ۤۘ۫ۡۘ۬ۦ۟ۘۨۤ۬ۤۡۘۡۧۖۘۨۡۡ";
                                                            break;
                                                        case -1448859743:
                                                            str5 = str.length() == 0 ? "ۧ۟ۙۨ۫ۨۡۥۥۛۚۡۘۚۤۙۛۡ۬ۨۢۘۘۡۘۢ۠ۜۤۜۗۡ۬ۧۚۢۨۘۢ۠ۡۘۤۘۖۘۡ۟ۘۡۡۜۤۛ۠ۤۘۘۘ" : "۬ۛۚۛۤ۫۟ۘ۫۟ۛ۠ۘۡۥۘ۬ۘ۬ۙۗۗۦۗۢۧۘۜۘۜۘۙۨۚ۠ۦۧۤۚۧۡ۫ۙ۟ۖۡ۟۠ۖۧۘ۫ۡۤۚ۠ۥۘۤۡۦۘۚۥۧۘۢۙ۬";
                                                            break;
                                                        case 299375930:
                                                            str5 = "ۘۨۨ۫ۜۧۗۗۚۤ۠ۥ۠ۥۘ۠ۘۜۘۨ۬ۨۡ۫ۙۡۧۚ۫ۥۘ۫ۗۦۘۨۜۨۤۥۡۘۗۛۨۘۛۚۘۜ۫ۙۚۡۘ۟ۢۖۘۖۨۦۚۥۗ۠ۙۚ";
                                                            break;
                                                        case 989173613:
                                                            str4 = "ۥۚۖۘۚۜۛۗ۟ۘۘۢ۠ۤۜ۫ۧۦ۫ۤ۟ۖۘۤۡۨۘۗ۬ۗۥ۫ۛۦۤۥ۬ۜۗۤۜۖۖ۫ۜۨۘۘ";
                                                            break;
                                                    }
                                                }
                                                break;
                                            case -384333919:
                                                str4 = "ۙۗۦۜۖۥ۠ۤۡۘۘۧۖۗۦۢ۠ۨۘۙۡ۠۠۫۬ۙۙۜ۫۫ۥ۫ۧۜۘۤ۟ۜۧۥۚ۠ۨۢۡۢۡۙۗ۟۠ۛ۠ۢۡۘ";
                                                break;
                                            case 591017109:
                                                str3 = "ۗۜۥ۟ۥۙۧۛۡۘۗ۠ۜۘۘۚۜۘۨۧۦۘۛۘۘۘ۟ۨۦۘۥۖۦۗۨۛۦۙۡۘۗ۟ۘۨۢۜۘۦۡ۫ۘۗۖۢۙۗۧۗۘۘ۬ۤۚۡ۫۠۫ۜ۫ۥۛۙۚۙ۟۠ۥۥۘۢۛ۟";
                                                continue;
                                        }
                                    }
                                    break;
                                case 1991736398:
                                    str3 = "ۗۧۤۦ۠ۢۧۦۧ۬ۜۨۘ۫۠ۡۘۙ۠ۜۘ۬۟ۖۛۧۦۚۛۦۘ۠ۡۥۘۢۨۥۘۙۗۦ۟ۢۨۘ۫ۚۙۡۥ";
                                    break;
                            }
                        } catch (Throwable th) {
                            StringBuilder sb = AbstractC0149b0.f695;
                            AbstractC0149b0.a.m817(th);
                            return null;
                        }
                    }
                    break;
                case 1714630375:
                    String str6 = "۬ۗۜۘۧ۠ۙۢۧۧۘۥۙۜۙ۫ۥ۫ۘۦۙۥۙۤۗ۫ۨۧۘ۫ۖۨۘۤ۬۠ۘۙۢۛۘۤۘۧۤۜ۟ۛۜۜ۬۟ۚۛۚ۬";
                    while (true) {
                        switch (str6.hashCode() ^ (-247647204)) {
                            case -865715227:
                                str6 = "ۛۢۤ۫ۡۡۘۖۗۡۘۨۛۘۨۥۤۜۘۤۧۥۥۛۜۘۥۥۧۘ۟ۨۧۛ۫ۥۤۡۧۢ۠ۘۗۙ۟۠ۜۨۧۡۖۤۘ۠ۙۜۡۘ";
                                break;
                            case -754503996:
                                str2 = "۫ۥۙۛۙۛ۟ۤۢۡ۟ۖۘۖۥۨۘۢۜۦۖ۬ۨۘ۫ۛۢ۬۠۬ۡۥۜۜۢۥۘۨۢۥۡ۟۫ۨۛۦۡۘۘۘ۠ۚۡۚۘۡۢۖۛۗۚ۠ۘۤ۟ۙۧۨۨۘۚۚۗۛۧۖ";
                                continue;
                            case 728388409:
                                str2 = "۟ۜۜۘۜۦ۟۟ۧۡۙۤۨۘۧۦۨ۟ۙۛ۟ۢۦ۫ۥۖۘ۬ۨ۠ۤ۠۫ۜۙ۬ۧۛۥۘۨۙۨ۠۠ۖۘۚۧۢۖۡۘ۬ۜۘ۟ۜۜۘۛۨ۠ۗۗۖۡ۟ۗۘۗۤ۬ۛۛۛۢۨۘۥۧ۬۟ۨۛۧۧۡۘ";
                                continue;
                            case 789763233:
                                String str7 = "ۧ۫ۦۘۘ۫۬۠ۥۨ۬ۘۡۗۘۧۙۨۥۘۚۥ۠ۖۥۧۘۚ۫ۤ۫ۛۘۘۜۢۡۖۨۥۦۖۧۙۛۜ۠ۛۤۖۖۘۢۙۘۘۢۛۨۘۜۥۨۘۨۚۘۦۖۘۗۥۤۘۘۤۘۤۗۖۧۘۘ۬ۦ۬۬۫";
                                while (true) {
                                    switch (str7.hashCode() ^ 434344048) {
                                        case -1864448039:
                                            str7 = str != null ? "ۖۙۨۘۧۥۤۛۛۦ۟ۥۖ۟۫۫ۚۛۗۙۜۜ۠ۧ۠ۥۘۦۘۜ۟۠ۧۤۥۡۗۜۡ۬ۗۚۡۤ۠۠ۚۘۦۘۗۗۨۘۚۙۨۘۘۗۥۘۖۡۙۤۨۨۘۖۗۨۛۤۘۘۦۖۚ" : "۟ۛۙۨۡ۠ۖ۟ۡۘۛ۠ۖۘ۠ۜ۬ۖۡۜۥۖۘۘۢۧۥۗۨۦۧۦ۠ۦۧۘۢۦۦۘ۟ۨۥ۬۫۠ۡۤۛۙۨۡۘ۟ۚۥۤۦۜۘ";
                                            break;
                                        case -632087208:
                                            str7 = "ۛۥۛۗۨۙۥ۠۫ۘۚ۟ۙۜۘ۠ۜۗ۫ۧۖۘۗۦ۠۫ۢۘۘۥۧۜۘ۟ۚ۬ۨۥۖۘۡۚ۬ۜۤ۠ۘۨۘۘ۫ۧۛۙۛ۟ۜۦۘۘ";
                                            break;
                                        case 669759811:
                                            str6 = "ۥۡۥ۠۠۠۬ۖۘۡ۟ۚ۠۬ۢۛۦۘۚۨۢۧۢۨۘۤۦۚۦۜۦۘ۟۬ۛۚۤ۠ۙۡ۠ۙۗۢۙۥۧۘۖ۠ۖۘۛۙۢۗۤۗ۠ۛۜ۟ۜ۫ۘۡ۫ۛۦۘۗۚۧ۬ۡۙ";
                                            break;
                                        case 1118871999:
                                            str6 = "ۖۖۢۦۜۦ۟ۡۧۨۦۦ۬ۦۨۘۚۘۛۜۦۡۘۢۧ۬ۜ۫۠ۥۧۡۢۗۤ۟ۢ۟۫ۨۜۘۢۜۥ۟۟ۖۘۨۥۜ۠ۜۥۢۜۖۥۧۜ۠ۚۖۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
            }
        }
        z = true;
        String str8 = "ۧۤۡۘۥ۫ۤ۠ۗۥۘ۠ۡۘۘۨۡۤۛۖۢۦۥۥۧۤۖۖۥۙۦ۠ۦۛۜۚۥۥۙۜ۫ۚ۟۬ۗ۬ۢۨۢۡۙ۠ۗۨۛۥۘ";
        while (true) {
            switch (str8.hashCode() ^ 839897215) {
                case -1778931115:
                    String str9 = "ۘۧۘۖۖۖ۟ۗ۫ۦۚۤ۠ۥۨۘۚۤۨ۬ۗۖۘ۬۫ۥۘۤۗۦ۟ۡۘۘۤ۠ۖۘۛۘۥۡ۟ۖۘ۠ۤۚۛ۬ۘ۠ۚۜۢۖۦۘ۠ۧۖۘ";
                    while (true) {
                        switch (str9.hashCode() ^ 966400001) {
                            case -1394915092:
                                String str10 = "ۡۘۘۘۧۢۙۙ۠ۥ۟ۙۡ۫ۛ۬ۡۡۘ۠ۘ۟۠ۧۛۖۗۖۘۡ۫ۜۘۤۧۢۥۡۥۢۡۘۖۜۡۖۥۗۥۚۗۖۢۦۘۧۨۧۘۙۘۥۘۤۧۘۘ۬ۤۖ";
                                while (true) {
                                    switch (str10.hashCode() ^ (-412280152)) {
                                        case -1935778471:
                                            str10 = z ? "ۙۙۖۘۨۗۛ۬۟۠ۙۜۗ۠ۗۖۘۘۙۨ۠۫ۡۜۚۚۗۧ۠ۨۘۛۡ۟ۖۡۘۘۗۜۥۜۧۖۛۢۧۢۖۘۛۢۖۢۤۖۘۖ۠ۘۘۛۚۡۢۤۥۘ" : "ۤۦۘۘۨ۟ۗۦۤۡۘۦۡ۫۫ۗۤۥ۫ۤ۬ۢۖۚ۟ۦۙ۟ۙۨ۠ۨۡ۫۟ۖۢۧۥۘ۫ۥۤۧۨۜۘ";
                                            break;
                                        case -1288559835:
                                            str9 = "ۥۙۡۘۖۡۗۨۧۘۘ۟ۦۨۘۨۨۥۘۖۡۨ۬۫۬۬ۢۘۛۧ۬ۖۜۚۜ۬۫ۜۢۧۙ۟ۨۘ۟ۥۜۦۘۚ۫ۡۘۥۡۤۡۨۦۜۤۘۜۢۨۘۥ۬ۡۘۛۚۜ۟ۦۖۘۘۛۜۘ۠ۢۡۦ۬ۚۙۜۥۘ";
                                            break;
                                        case -723752456:
                                            str10 = "ۡۨۚ۫۟ۦۗ۠ۡۘۙۨۘۘۧۡۡۘۤ۠ۗۦۥۥۘۙۢۤۡۧۦۚ۫ۡۘۢۤ۟ۚۘۘ۬ۤۘۘ۠ۥ۟ۛۨۦۤۖ۠ۙ۠ۡۥۛۢۡۜ۬ۡۘۘۧۧۙۖۙۦۘۚۥ۬۫ۖۘ";
                                            break;
                                        case -191732911:
                                            str9 = "ۤۛۜ۫ۚۚۙۧۥۘۥۘۙۛۥ۟ۡۚۧۥۡۖۧۦۜۚۧۛ۬ۙۘۘۛۖۘ۬ۥۦ۫ۧۗۚۧۖۘۧ۬ۢۢۗۘۗۖۘ۟۫ۖۘ";
                                            break;
                                    }
                                }
                                break;
                            case -1144852840:
                                str8 = "ۘۗ۫ۥۤۙۜۛۦۜۙۘۘۘۤۜۙۛۥ۠۫ۛۨۨۖۗۗۖۡۥۥۘ۫۠ۘۘ۟ۗۢۗۛۚ۟ۢۨۘۚۛۖۨۖۧۦ۠ۦۘۜۦۥۘ";
                                continue;
                            case -794770298:
                                str9 = "ۚ۫۫ۤ۟ۚۘ۬ۢۛۛ۫ۛۢ۫ۥۦۜۤۧۢۡۦۜۘ۟ۚۥ۫ۜۧۚۡ۟ۦۛۥ۫ۡۦۘۤۤ۬";
                                break;
                            case 1829821946:
                                str8 = "ۤۤۗۛۧۜۤۖۘۘ۠۠ۡۤۖۨۚ۬ۘۙ۬ۜۘۛۥ۟ۗۥۢ۠ۤۨۢ۬ۤۜۘۡ۫ۢ۠۬ۙۖۘۛۢۨۘۢۨۦ۬ۢۢ۟ۦۘ۬۫ۨۥۥۛ۠۟ۨۙۧ۬ۤۙۘ۠۠ۖۘ۟۫ۨۥۙۖۘۛۘۘۘ";
                                continue;
                        }
                    }
                    break;
                case -785798243:
                    Method methodFindMethodExact = XposedHelpers.findMethodExact(cls, str, Arrays.copyOf(objArrCopyOf, objArrCopyOf.length));
                    C0237h4.m1089(C0341oa.m915(new byte[]{-20, 49, 80, 103, -98, -1, -2, 48, 81, 103, -106, -30, -21, 59, 74, 43, -3, -76, -92, 113}, new byte[]{-118, 88, 62, 3, -45, -102}), methodFindMethodExact);
                    try {
                        C0315mc c0315mc = new C0315mc(0);
                        c0315mc.m900(c0183d6);
                        return m1212(methodFindMethodExact, c0315mc);
                    } catch (Throwable th2) {
                        StringBuilder sb2 = AbstractC0149b0.f695;
                        AbstractC0149b0.a.m817(th2);
                        return null;
                    }
                case 1164657600:
                    str8 = "ۡۦۗ۟ۥۘۘۗۘۥ۬ۨۘۡۧ۠۟۟ۙۙۨ۬ۚ۬ۢۚۘۤۖۜۨۙۧۦۘ۬ۙۤۡ۫ۛۡۧۜۗۖۤ";
                    break;
                case 1464140344:
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۠۠, reason: contains not printable characters */
    public static void m1208(String str, String str2, Object[] objArr, InterfaceC0222g3 interfaceC0222g3) {
        String str3 = "ۤ۬ۜۜۢۘ۠ۢۚۥ۬ۢۚۛۥ۠ۗ۠ۖ۫ۘۤۜۦۘۢۥۚۨۖۛ۠ۜۤۖ۫ۥۧۤۘۦۨۢۖۘۦۧۨۘۛ۫۬۫ۡ۫ۦۥ۟ۡۧ۟ۚۛۡ۬ۘۨۘۚۢۢ۫ۘۙ";
        ClassLoader classLoader = null;
        while (true) {
            switch ((((((((str3.hashCode() ^ 181) ^ 998) ^ 283) ^ 522) ^ 861) ^ 563) ^ 63) ^ (-1047308434)) {
                case -1908975045:
                    String str4 = "ۘ۬۫ۢ۠۬ۗۖۚۧۥۛ۟ۤۦ۟۠ۡۢۢۢۤۜۡۘ۬۬۬ۡ۠ۗ۬۠ۖۛ۫ۥۧۗۚۘۙۛ۠ۘۘ۠ۡۢ۠ۨۘۘۜ۠ۦۨۡۧ۫ۜۜۘۘ۟";
                    while (true) {
                        switch (str4.hashCode() ^ (-965913054)) {
                            case 287334400:
                                str3 = "ۢۥۖۘۥۛۦۘۖۚۧۜۢ۟ۛۡۚۡۢۘۘۥۖۜ۠۟ۡۡۚۡۧۧۙۡۙۙۤ۟ۖۘۡۘۜۘۡۨۘۘ۟ۨۘۙۤ۟ۖۥۦۘۦ۬ۦ";
                                continue;
                            case 550450489:
                                str4 = "ۜۦۘۘۥۙۜۘۧۨ۟ۙۗۡۘ۠ۦۨۘۖۖۜۘۗۦۘ۫۟ۖۘۖۢۤۦ۬ۙۦۡۡۘۡۗۨۚۢۥۙۗۘۘ۬۫ۦۙۡۥۚۦۘ۟ۡۢۘۥۘۘ۫ۦۚۢ۬۫ۙۧۧ۬ۚ۬۫ۛۦۨۗۖ۫ۢۥۘۧۙۗ";
                                break;
                            case 783592723:
                                String str5 = "ۢۘ۫ۛۦ۠۟ۘۦۘۦ۟ۜۘۥۥۢ۟ۤۜۘ۫ۗ۬ۘۡۦۘ۟ۖ۫ۡۢۘۡۙۢۦۜۘۘۡۨۨۥ۫ۦۙۗۘۗۧۥۘۜۢۖۘۦۧۤۙ۬ۢۙۗۥۘۥۘۥۚۗۡۥۜۧۗۚۖۥۦ۫۟ۜۙۗ۟";
                                while (true) {
                                    switch (str5.hashCode() ^ 1616619784) {
                                        case -1975757435:
                                            String str6 = "ۜۚۤۢۜۖۘ۫ۦۥۥۦ۬ۤۙۖۢۥۗۤۚ۟ۘۘۤۖۦۡۘۢۡۦ۫ۗ۠ۡۛۨۨ۫ۨ۬ۚۡۘۤ۠ۢۚۡۧۘۚۗۡۘۤۥۚۛ۠۟ۥۧۢۛۦۢۖۛۡۘۡۥۖ۬۠ۧ۬ۙۡ۫ۛ۟ۛۥ۫";
                                            while (true) {
                                                switch (str6.hashCode() ^ (-536295471)) {
                                                    case -853877381:
                                                        str5 = "ۗۦۡۗۡۨۖۘۗۦۗۢۗ۬۫۫ۢ۟ۧۡۜۘ۠ۦ۬۟ۦۦۡ۟ۖۘۤۙۦۙۚ۟ۡۖۨۙ۠۬ۥۙۖۤ۫ۡۚۗۜۘۢ۠۬۬ۡۘ۠ۨ۫ۥۙۜۘ";
                                                        break;
                                                    case -744653135:
                                                        str6 = classLoader != null ? "ۙۙۧۚۢۜۘ۬ۘۥۘۦۖۧۘۥۨۚۨۘۦ۬۠ۤۘۤۗۥ۫ۙۚ۠ۡۘۚۤۢۧۖۤۖۦۨۘۨۛۘۘۧ۠۬۟ۤ۟۬ۡ۬ۛ۫ۜۦۚۗ۟۟ۥۚۜۚ۬ۜۨۘۗۦۘۘ۟ۖۥۘ" : "ۧۥۘۘ۬ۖۧۦ۫۟۫ۤۙ۠ۘۜۘ۠ۖۢ۟ۧ۠۠ۥۤۧۦۗ۠ۢۥۙ۟ۜۨۘۙۘۖۘۜۨۗۥۧۜۨۜ۬ۖ۟ۧ۟۬ۧ";
                                                        break;
                                                    case 277848905:
                                                        str6 = "ۥۥ۟ۤۦۙۤۛۡۘۡۥۥۢۚۚۖۖۜۙۨۛۚۢ۟ۙۤۥۧۙۦۘۗۥۥۘۘۧۛۚۜۜۗۛ۬ۡۘۖۗ۫ۦۘ۟۬ۘۘۦۢۥۘ۫۠۫ۨۤۨۡۧۜۘ۠ۡۨۘۦ۬۫۠ۡۨۦۥۚۖ۬ۤۦۚۦۘ";
                                                        break;
                                                    case 1578970546:
                                                        str5 = "ۗۜۛۦۘۧۘۧۥۥۦۗۜ۟۟ۖۘۜۜ۬ۙۨۧ۫ۨۛۨۢ۟ۤ۟۠ۡۤۗ۟ۥۘۧۡۚۢۡۘۗۙ۬ۜۧۖ۟ۡۛۖۛۧۖۚۜۛۙۢۤۚ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 13261502:
                                            str4 = "ۡۤۦۘ۬ۨۦۘۜ۠ۖۜ۬ۖۘۘ۟۠۠ۤۥۘ۫ۛۦۘۤۤۦۧ۠ۗۧۚۥۘۤۜ۫ۨۢۖۘ۫ۧۡۥۤۦۖۡۨۘ";
                                            break;
                                        case 1118948461:
                                            str5 = "ۤۢۡۘۖ۬۟ۘۦ۫ۛۧۡۛۧۗۖۘۘۨۧۦۘۖۢۤۛ۟۬ۗۖۖۖۗۘۜۢۡۘ۫ۙۦۘ۫ۚۥۘۡ";
                                            break;
                                        case 1453356226:
                                            str4 = "۫ۚۢۤۗ۬ۗۘۦۘۛ۫۟ۨۢ۫ۤ۠ۧۘۦۧۚۨۡۘ۫ۡۥۘ۬ۚۛۢۨۘۘۜۢۜۥۡۘۗ۫ۨۘۨۢۡۥۗۥۜۤ۟ۦ۟ۙ";
                                            break;
                                    }
                                }
                                break;
                            case 1977726623:
                                str3 = "ۦ۫۫ۥ۠ۡۘ۫ۖۛۡۦۥۘۙۘۘۘۢۡۘۖۘۚۙۛۡۘۚۗۢۜۜ۬ۧ۬ۥۘۖۙ۟ۧۜۡۢۘ۟ۘۘ";
                                continue;
                        }
                    }
                    break;
                case -1687743359:
                    C0341oa.m915(new byte[]{-114, -45, -71, 39, 89, -20}, new byte[]{-26, -68, -42, 76, 60, -98});
                    str3 = "ۜ۟ۨۦۤۦۘۧۘۖۘۨۘۜۘ۟ۤۗۡۖۘۤۙۥۘ۟ۨۧۧۨۦۘۖ۬ۡۘ۬ۢۖۙۡۨۤۡۚۙۥۡۤ";
                    break;
                case -1376490734:
                    classLoader = C0292l3.f938;
                    str3 = "ۗۥۛۢ۬ۘۘۥۡۜۘۙۛۖۘ۫۬ۦۘۥۚۧ۟۠ۥۗۜۤۦۘۘۘ۠ۙۡۨۤۧۥۦۨۘ۠۫ۧۗ۫ۨۘۧۗ۫ۜۜ۠ۘۧۨۘۗۦۖۘۢۧۚ۠۟ۧ۟ۚۨۘ";
                    break;
                case -1144749786:
                    return;
                case -1023382547:
                    C0341oa.m915(new byte[]{123, 30, -32, -26}, new byte[]{26, 108, -121, -107, 92, 127});
                    str3 = "۠ۦۨۘۨ۬ۜۗ۫ۦۘۦۜۤۛۘ۫ۦ۫ۛۗ۫ۤۥۢۨۘ۫ۖۗ۫ۘۘۘO۠ۨۦۘۡۖۘۢ۠ۖۡۚۜۘۘۥۨۘۨۗۥۘۘۧۜۛۦۙۗ۬ۥۘ۫ۜۜۘۖ۠ۚۦۛ۫۠ۡۘۦۡ۬۫ۡۘۢۢ۟";
                    break;
                case -906204222:
                    str3 = "ۤۗۦۘۘ۬ۧ۫ۡۛۘ۬۠۟۬ۘۘۡ۫ۙ۬۠ۚۛ۠ۙ۬ۧۗۙۤۘۘۨۧۧۧۜ۬ۜ۫ۥۥۗۨۘۖ۠ۗۖۘ۠ۖۗۨۘۨۛۧۡۙۢۦۢۡۘۜ۫ۜۘۦۧۗۗۢۛۛ۬ۚۥ۬ۖۘۙ۠ۢ۠ۢ۠";
                    break;
                case -411771506:
                    C0237h4.m1092(C0341oa.m915(new byte[]{-78, 10}, new byte[]{-47, 102, 55, 90, 4, -54}));
                    str3 = "ۨۘۖۘۡۜۨۘ۬ۨۨۜۨۨ۬۬ۘۤۨۤۗ۫ۡۘۘۢۥۛۥۜۘۛۘۧۘ۠ۗۨۘۖۙۜۘ۬ۜۡۛ۠ۥۛۚۡۘۙۤۧۢۘۚ۫ۨۨۘۙ۠۬ۙۙۨۗۨۚۙۨۦۢۗۥۘ";
                    break;
                case -114993707:
                    throw null;
                case 831768422:
                    C0341oa.m915(new byte[]{24, -6}, new byte[]{123, -106, 125, 55, 69, -48});
                    str3 = "ۘۧۜۨ۫ۦۘ۟۬۟۟۫ۙ۬ۤۨۘۙۤۘۙۖ۫ۥ۟ۙۢ۬ۦۜۙۡۘ۟۟۠ۛۙۘۢۘۥۘۦۙۖۗۧۦۘۨۨۖۘۤۧ۟۠ۤ۫ۡ۠ۨۘۜۜ۬ۢۙۘ";
                    break;
                case 835068341:
                    str3 = "ۜ۠ۛۚۦۘۘۥۘۛۤۖۚۡ۬ۡۘۜ۬ۘۘۦۜۛۢ۠ۛۢۘۧۘۥۡۖۘۚۚۛۡ۬۬ۦۖۢۧۥۘۘ۫ۛۨ۟ۚۘۗۥۨ۫۬ۦۘۘۚۥۡۙۗۦۘ";
                    break;
                case 1312393443:
                    str3 = "ۖۧۚ۫۬ۨ۟ۚۦ۫ۘۤۜۖۘۥۛۡۘۜۧۢۥۜۡۗۧۡۖ۬ۘۘ۠۟ۧۡۜۢ۠ۨۖۘ۠ۧۘۡۜۘۘۤۖۧۤۖۤۚ۠ۖۘ";
                    break;
                case 1781004321:
                    C0341oa.m915(new byte[]{-112, -7, 17, -18, -17, 40}, new byte[]{-84, -115, 121, -121, -100, 22});
                    str3 = "ۥ۟ۧ۬ۨۖۡۖۧ۟ۥۜ۬ۦۥۘۨۛۛ۟ۚۛ۠ۛۦۦۨۘۖ۟ۡۘ۫ۗۦۘۢ۟ۡۘۨۚ۫۠ۜۛۥ۬ۨۘ";
                    break;
                case 1882839848:
                    str3 = "ۤ۟ۘۜۡۨ۟ۤۦۡ۬ۘ۬ۖۘۘۙۤۦۘۛۦۖۜۗۤۢۖ۬ۚۚۗۙ۫ۧۖ۫۟ۖۚۛۤۢۖۗۢۛۘۛۛۛۗۨۦۖۚ۬ۨۜۥ۬۬۫۫ۢۚۡۜۜۤۡ";
                    break;
                case 1990787750:
                    m1211(str, str2, Arrays.copyOf(objArr, objArr.length), classLoader, new C0347p3(interfaceC0222g3));
                    str3 = "۬ۡۡۘۖۥۚۢۡۧۘۥۨ۠۠ۚۛۡۛۙۦۦۧۘۤ۠ۧ۬ۙۗ۬ۚۦۘۘ۫ۙۘۘۛۚۙ۬ۙۧ۟ۘۥۧ۠ۥۜۘۥۗۡۘ۬ۤ۟ۤ۠ۛۘۖۗۛۘۘۘۡۘۜۧۢۢۜۛ۫";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۠ۡ, reason: contains not printable characters */
    public static final Set<XC_MethodHook.Unhook> m1209(Class<?> cls, String str, InterfaceC0222g3<? super C0315mc, C0433vb> interfaceC0222g3) {
        boolean z;
        C0341oa.m915(new byte[]{86, -51, 114, -36, 122, 41}, new byte[]{106, -71, 26, -75, 9, 23});
        C0341oa.m915(new byte[]{-107, -36, 88, 32, 51, -38}, new byte[]{-3, -77, 55, 75, 86, -88});
        XC_MethodHook c0315mc = new C0315mc(0);
        interfaceC0222g3.mo984(c0315mc);
        C0341oa.m915(new byte[]{65, -18, -89, 107, 72, 65}, new byte[]{125, -102, -49, 2, 59, 127});
        C0341oa.m915(new byte[]{-81, 69, -24, 60, 15, -43, -85, 70, -27, 54, 47, -33}, new byte[]{-57, 42, -121, 87, 76, -76});
        String str2 = "ۥ۟ۗ۫ۡۗۙ۫ۜۘۖۧۢۜۜۘۘۛ۠ۛۤۘۘ۬۠ۘ۫ۡۙۨۤۖۘۚۜۛ۫۬ۧ۠ۦۦۘ۟ۨۤۤۡۘ";
        while (true) {
            switch (str2.hashCode() ^ (-1534528351)) {
                case -1688902883:
                    break;
                case -51334008:
                    String str3 = "۫ۥۛۡۗۡۘۜۙۥۘۤۢۘۨۡۨۚۖ۫ۦۢۨۘۥۧ۬۫ۦۦۨۥ۠ۥۛۙۛۢۢ۠ۥ۟ۢۜۚۡۨۛۤۗۧۡۖۚ۬ۢۦۘۗۡۧ۫ۜۧ";
                    while (true) {
                        try {
                            switch (str3.hashCode() ^ 1525546934) {
                                case -2106935849:
                                    z = false;
                                    break;
                                case -780551561:
                                    break;
                                case 772104598:
                                    str3 = "ۥۚۚۛ۫ۤۤۡۖۥۡ۠ۧۧ۟ۢۡۖۘۨۘۜۧۤۨۛ۟۠ۛۗ۬ۤ۟۟۠ۗۘۘۦۤۛۖ۠ۜۘۙۦۥۘ";
                                    continue;
                                case 1832152248:
                                    String str4 = "ۦ۟ۘۘۛۙۡۖۚۖۢۤۢۖ۟ۡۡۘۦۜۛۖۧ۬ۡۥ۟ۤۦۘۘۧۢۨ۠ۚ۠۬ۤۖۘۖ۠ۛۦۗۡ۫ۥ۟ۦۜ۟ۤۦۜۘۡۨۧ۟۟۬ۘۙۥۘ";
                                    while (true) {
                                        switch (str4.hashCode() ^ 2027370542) {
                                            case -428628873:
                                                str4 = "ۧ۠ۘۚۚۖۘۡۢۡۘۢۙۥۜۨ۠ۤۗۡۚۡۥۤ۫ۜۘۧ۬ۖ۟ۘۚ۟ۚۧۘۚ۬ۜۡ۫ۛۚۛۘۢۘۧ۟ۡۘ۬ۘۖۛۥۛۨۥۘ۟ۖۜۙۢۛۡۢۦۘۡۚۘۘ۫ۨۤ";
                                                break;
                                            case -189555232:
                                                str3 = "۟ۧۨۘۘۚۛۤۚۥۘۥۜۥۘ۟ۘۧۘۗۤۨۘۢ۫ۤۧۥۗۤۚۦۘۨۡ۠ۖۚۖۜۖۘۖۗۜۘۤۤ۠ۨۗۗ۬۬ۦۘۙۢۨۘۤۧۜۘ";
                                                continue;
                                            case 203873258:
                                                String str5 = "ۖۡۦۘ۫ۥۘۘۤۧ۠ۛۙۘۛ۠ۙۚۨ۠ۗۗۤ۬۫ۥۘۗۤ۬ۦۚۛۢۙۡۘ۫۫۫ۖۧۢۦ۟۬ۢۜۗۦۘۤ۫۠ۧۥۚۨ";
                                                while (true) {
                                                    switch (str5.hashCode() ^ 1455937991) {
                                                        case -1780107689:
                                                            str4 = "ۗۧۜۘ۟ۦۤۜۛ۬۠۠ۨۘۚۡۤۗۨۧۨۖۜۡۨ۫ۢۥۘۛۡۡۦۗۥۘۗ۠ۚۧۗۖۘ۬۫۟۟ۖ";
                                                            break;
                                                        case -647463837:
                                                            str5 = "ۘۡۤۖۢۘۘۙۛۜۘ۬ۤۘۘۘۗۜۢۖۚۛۥۨۘ۟ۘ۬ۧ۫ۥۘۖۜۢ۠۫ۛۗۚۨۘۙۜۨۘۜۜۧۘۜۛۛۨۜۧ۠ۘۦۘۤۤۦ";
                                                            break;
                                                        case -607708754:
                                                            str5 = str.length() == 0 ? "ۤۤۨۘۙۜۛۙۡۦۘۖ۠۬ۗۤۨۖۡۥۘۧۗۥۘۚۥۘۗۚ۠ۖۥۘۨۧ۬ۦۜۡۚ۟ۚۡۦۘ۠ۜۙ" : "ۖۨۢۥۦۛۥۦۜۧۘۡۤۗۖۡۦۛۘۦۘۛۙۦۘ۬ۧۗ۠ۨۧۘۦۗۦۛ۠ۜۘۥۙۘۜۥۢۛ۫ۤۘۗۖۘۨ۫ۖۛ۫ۚۥ۫ۘۘ۠ۧ۟ۘۦۢۧۦۧۨۨۘۨۨۖۘۘۢۜۨۙۛۧۗۛ";
                                                            break;
                                                        case 663103606:
                                                            str4 = "ۤۘۖۘۦۦ۠ۦ۫ۖ۟ۛۢۥۙۥۤۙۨ۫ۗۦۙۡۘ۟ۜۧۘۨۢۜۘۘۨۦۘۚ۠ۚۜ۠ۡۘۨۖۧۤ۟ۢۘۢۚ۬ۚۛۜۡ۠۫ۚۜۘ۫۟ۨۘ۬ۖۥ";
                                                            break;
                                                    }
                                                }
                                                break;
                                            case 656808975:
                                                str3 = "ۛۡۖۖۥۦۙ۬۫ۨۢۦۥ۫ۖۡۜۚۜۗۖۨۥۢۗۙۜۘۚۡۘۘ۫۫ۨۘۚ۠ۜ۬ۗ۟۫۠ۧۘۘۤۥۚۧۜۛۨۧۧۛ۠ۘۗۘۦۢۨۧۘۚۥۘۘۙۘۡۤۖۙۗ۟ۗ۬ۦ";
                                                continue;
                                                continue;
                                        }
                                    }
                                    break;
                            }
                        } catch (Throwable th) {
                            StringBuilder sb = AbstractC0149b0.f695;
                            AbstractC0149b0.a.m817(th);
                            return C0207f2.f778;
                        }
                    }
                    break;
                case 1162059342:
                    String str6 = "ۦۘۢۖ۫۫ۥ۫ۨۘۘۢۥۘۖ۬ۘ۠ۧۘۘۡ۬ۖۘۥۜۘۘۥ۠ۥۘۡ۬ۜۘ۠ۘۡۘۚۛ۟ۚۗ۟ۥ۠ۨۥ۫";
                    while (true) {
                        switch (str6.hashCode() ^ (-2001111155)) {
                            case -1553037879:
                                str2 = "ۜ۫۫ۘۧ۟۟ۤۘۜۢ۟ۖۤۛۢۙ۬ۗۦۘۡۛۨۜۧۥۖۡ۟ۛ۟ۡۘۡۡۙۚۜۢۥۙۨۢۗۤۡۦۥۘۦۡۤۧۜۘ";
                                continue;
                            case -1353475545:
                                str6 = "ۖ۬ۥۘۨۚۥۘۗۡۧۘۨ۫ۥۘۥ۠ۡۘۧۨۨۢۡۚۧ۠۬ۘۧۦۘۖۦۦۘ۫ۢۜۘۘۡۧۘۨۖۧۖۨۘۨ۬۟۠ۙۙ۬ۚۖۘۤ۬ۜۘ";
                                break;
                            case 1525375811:
                                str2 = "ۢ۟ۥۘ۠۟ۗۙۤۛ۬ۘۤۧۖۘۤۚ۟ۛۛۥۘۨۙۤۧ۟ۤ۠ۖۤۙۤۤۜۥۖۘۥۗۜۛۜۜۘۥۙۚۖۚۛۤۨۦۘۚ۟ۘۡۖۧۧۙۘۘۧۥۧ";
                                continue;
                            case 1717021306:
                                String str7 = "۠ۚۡۘۥۧۥۘۧ۬ۛۤۢۜۘۤۤۗ۫۬ۘ۫ۤۦۢ۬ۖۖ۫ۡۛۡۥ۟ۢۥ۠ۜۘۙۜۥۘۢۛ۟ۤۙۤۜۛۚۖۧۥۘۤۛۤۨۛ۫ۢۧۘۘۢ۟ۡ";
                                while (true) {
                                    switch (str7.hashCode() ^ 86137229) {
                                        case -1554475449:
                                            str7 = str != null ? "ۤۦۛ۠ۘۗۙۧۥۜ۟ۜۦۜۧۦ۬ۦۚۖۤ۟ۗۜۘۚۥۦۦۙۥۘۘۜ۫ۤۙۜۘۨۤۙۥ۠ۧۙۦۗ" : "ۥۚ۬۠ۧۖۖۥۛۙ۬ۗۨۢۖۘۜۚۤۥۥ۬۬ۙۗۖۦۘ۬۬ۚ۠ۧۢۜۨۦۚۦۡ۟۬ۦۘۗۧۢۗۤۧۡۖۖۘۜۙۥۡۦۦۘ۬ۨۛۧۡۜۘ";
                                            break;
                                        case -1083791475:
                                            str6 = "۬ۜ۬ۙۢۨۧ۟ۖۘۖۗۙۙۧۡۤ۬ۖ۬ۤۨۘۥۘۡۧ۫ۦۖۡۜۛۨۥ۫۬ۜۜۧۖۡۖۙۥۘۨۙۨۘۙۧ۠ۙۢۖۘ";
                                            break;
                                        case 603031381:
                                            str6 = "ۡۤۥۘ۠ۥۖۧۙ۟ۥ۠۠ۜۖۙ۬ۦ۠ۤۨۨۦ۫ۙۤۥۘۨۨۚۦۥۨۨۜ۫ۦۢۙۘۘۡۖۚۡ۫ۛۤۖۛۥ۫ۘۜۤۧۢۡۙۥۘۤۚۥ";
                                            break;
                                        case 1786152370:
                                            str7 = "ۢۨۨۛۥۦۦۜۤ۟ۜ۫ۡۤۖ۠ۥۛۜ۫ۗۦۨۤۨۖۜۜۖ۠ۡۖۘۢ۠۬۫ۗ۬ۥۙ۫۬ۘۢۛ۟ۖۚۦۘۗۤۧۘۛۨۜۢۥۨۡ۫ۤۜۧۘۗۥۨۡۥ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1338005361:
                    str2 = "ۤۗۖۛۜۘ۠ۧۥ۬ۤ۟ۗۚ۬ۗ۟ۛۢۘۘۚۖۦۦۖۡۘۦۥۛۘۗۦۨۙ۟ۗۛۘۨ۠ۨۘ۬۫ۗ";
                    break;
            }
        }
        z = true;
        String str8 = "ۧۖۛ۬ۦۨۘ۠ۦۖۜۖۘۚۙۢ۫ۜۘ۟ۜۡۜۜۖۘۦ۬ۖۘۙ۠ۗۦۘۚۚۦۘ۠ۤ۟ۨۧۘۤ۟۟ۘ۟ۗ۬ۤۡۘۢ۫۬ۛۘۧ۫ۘۙۦۡۘ";
        while (true) {
            switch (str8.hashCode() ^ 300677355) {
                case -2092389420:
                    String str9 = "۠ۥ۠ۢۥ۫ۖۥۦۦۦۘ۫ۧۘۘ۠ۗۥۤۛ۫ۥ۫ۘۘ۫ۥۡ۟۫ۗۛۚۛۚۗ۠ۙۥۘ۠ۙ۬ۜۘۧ";
                    while (true) {
                        switch (str9.hashCode() ^ (-242380849)) {
                            case -1918575948:
                                str8 = "۫۠ۥۘۦۚۗۥۢۡۛۚ۟ۙ۠ۢۙۤۥۘۡۡۡۘۨۦۚۜۖۥۘ۠ۜۥۘۚ۫ۤۗۧۜۘ۫ۡ۬ۢ۠ۤ۠ۦۢۗ۫ۘۡۘۗۖۧ";
                                continue;
                            case -1882495547:
                                str9 = "۬ۥۥۘۖۙۘۥ۫ۦ۬۟ۖۘۚۜۗۛۘۡۚ۫ۛۡۚ۬ۙ۟۟۫ۘۘۡ۟ۙۜۨۘۜ۠۫ۘۧ۠ۨ۠ۡۢۨۢۡۧۢۥۧۘ";
                                break;
                            case -1503516180:
                                String str10 = "ۜ۬۫ۨۜۚۛۛۜ۠ۤۨۘ۫۠ۚۛۢ۠ۛ۟۠ۤۡ۫ۗۚۚۗۥۡۖۚ۟۠ۖۢۜۚ۬ۘۧۜۙ۠۟ۚۖۘۗۙ۫ۙۗۜۡۧۘۘۤۜۙۛ۫ۜۘۤۦۘۚۢۨۚۤۢۤۨۧۜۚ۟ۦ۫";
                                while (true) {
                                    switch (str10.hashCode() ^ 1989612594) {
                                        case -207846840:
                                            str10 = z ? "ۚۗۢ۠۬ۘۘ۟ۚ۟۫۟ۗۨۚۧ۬ۙۨۘۜۦۘۘ۫ۢۧۖۘۨۘۤۦۘۦۙ۟ۡۛۦۜۜۢۙۚۨۢۢۛ۟۫ۡ۫ۘۡۘۨۘۨۖۡۧ۠ۙۨۤۚۡ۟ۘۙ۬ۧۘۘۘۚۤ" : "ۚ۬ۚ۠۠ۖۘۨۢ۫ۨ۟ۦۥۗ۠۫ۛ۬ۖ۠۠ۨ۫۫ۢۡۖۘۗۡۦۘۡۤۡۘۗۙۙۤ۫۫۠ۘۘۚۜ۠۠ۙۖۙۛۤۨۤۘۘۧۛۡۘۤ۬ۧۤۢ۠ۨ۟ۡۘۡۧۤۧۨۘۖۜ۟ۡۦۗۚۚ۟";
                                            break;
                                        case 651215476:
                                            str9 = "ۢۡۚ۫۠ۘۚۤۦۘۚۨ۟ۛۤۖۘۙۛۡۘۘۤۢۡۧۘ۬۬ۖۜۨۗۥ۬ۦۘۛ۠۟ۡۤۦۗۢۧۧۡۦۥ۬ۙۜۤ۫ۨۘۛۧۦۜۘ۫ۛ۬";
                                            break;
                                        case 842703059:
                                            str9 = "ۗۧۜۘۚۚۚۙۦۦ۬ۚۖۘۤۨۖۘۙۘۢۛۖۗ۬ۗۘۨۗۥۘۙ۫ۡ۠ۛۥۨۗۥۡۛۥۘ۫۟ۗۘۜ۬۬ۘۡۡۚ۫۬ۧۚ";
                                            break;
                                        case 909646808:
                                            str10 = "۫۟ۜۨۦۨۘۥۚۗۢ۫ۘۡۜۡۘۗۖۢۘۡۥۖۚۨۡۗۨۗۛۗۛۜۡ۫۠۫۟ۧۜۛۘۤۧۡۧۘۡ۠ۡۘۘۜۘۜۙۨۥ۬ۦۖۙۢ۫ۚۧۢ۟ۥۘۚۜ۠ۜ۬ۘۘۤ۫ۢۧۤۚۦۖۧۘ";
                                            break;
                                    }
                                }
                                break;
                            case 660099345:
                                str8 = "ۛۨۥۘۚۡۨۨۘ۬ۥۚۨۘۧۙۜۤۖۜۥۖۚۙ۬ۨۘۗ۟ۖ۫ۙۥۘۖۘۘۘۜ۠ۡۨۚۗۚ۫ۜۘ۟ۚۨ";
                                continue;
                        }
                    }
                    break;
                case -1748009704:
                    str8 = "ۛۤۧۥۥۖۘ۬ۥۨۘۚۖۥۘ۬۬ۘۘۡۢۥۨۘ۬ۗۙۥۘۨۦۡۘۨۜ۫ۘۧۛۦ۠ۥۘۢ۠ۖۖۚ۫۟۠ۛ";
                    break;
                case -337400814:
                    Set<XC_MethodHook.Unhook> setHookAllMethods = XposedBridge.hookAllMethods(cls, str, c0315mc);
                    C0237h4.m865(setHookAllMethods);
                    return setHookAllMethods;
                case -142313916:
                    return C0207f2.f778;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۠ۢ, reason: contains not printable characters */
    public static void m1210(String str, String str2, Object[] objArr, InterfaceC0222g3 interfaceC0222g3) {
        String str3 = "ۜۗۗ۬ۨۗۗ۠ۥۘ۫ۜۘ۠۬ۨۘ۟ۜۜۘ۠ۖۦ۟ۙۙۘۜۢۥۢۡۢۗ۬ۖۗۖ۬۬ۘۘۗۘۥۘۧ۫ۘۘ۬۫ۥۘۗۨۜ۟ۚۥۡ۫ۖۘۗۗ۬ۖۚۖ۠ۙۦۘۗۧۥۘ۟ۡۖۧۜۛۘۘۘۛ۠ۜۘ";
        ClassLoader classLoader = null;
        while (true) {
            switch ((((((((str3.hashCode() ^ 878) ^ 191) ^ 728) ^ 800) ^ 109) ^ 298) ^ 727) ^ (-1132777645)) {
                case -2103283881:
                    throw null;
                case -1802010821:
                    C0237h4.m1092(C0341oa.m915(new byte[]{-78, 10}, new byte[]{-47, 102, 55, 90, 4, -54}));
                    str3 = "ۗۢۧۙۛۚ۫ۨۘۖ۠ۡ۫ۘۨۙۖۘۘۖۙۡۜۥۡۛۦۥۘۗۤ۠ۥۥۜۡۚ۫ۡۛۘۨۗ۬ۖۗ۟۠۫ۡۢۛۡۘۗۦۗۡۨۨۘۤۗ۬ۙۙۨۘۛۚۨ۬ۧۡۢ۬ۧۡۚۥۡۖ۠";
                    break;
                case -1533119684:
                    m1211(str, str2, Arrays.copyOf(objArr, objArr.length), classLoader, new C0360q3(interfaceC0222g3));
                    str3 = "ۨ۫۠ۤۧۦۘۡۡۡۘ۫ۛۖ۫ۖۡ۠۫۫ۨۜۘۙ۟ۖۘۦۥۡۚۦۦۘۦۦ۫ۦ۟ۖۘۨۜۡۘۖۡۜۤۨ۟ۗۙۦۘۛۜۖۛۛۛ";
                    break;
                case -1516900615:
                    C0341oa.m915(new byte[]{-81, 96}, new byte[]{-52, 12, -126, -105, -19, -4});
                    str3 = "ۧۘۗ۬ۜۥۚۨۦۘ۬۫ۢۖۧ۟ۘۨ۫ۚۨۗۦۢۧۡۡ۫۠ۛۚ۟ۨ۫ۡۥۛۘۤۘۢۤۥۢۤۡۘ";
                    break;
                case -1466004700:
                    C0341oa.m915(new byte[]{121, 70, -121, -32}, new byte[]{24, 52, -32, -109, -61, 26});
                    str3 = "۠۬ۜۗ۬ۤۖۖۥۤۜۗۢۧۥۘۢۚۜۘۦۧۨۘۥۜۨۧ۬۟ۡۜۚۙ۬ۦۛۡ۬ۦۧۨۘۙۡۦۦۛ۫۟۟ۘۘۛۛۥۢۖۘۤۚۥۘۘۛۛۖۖۧ";
                    break;
                case -1401563530:
                    C0341oa.m915(new byte[]{48, -123, -90, 2, 25, -5}, new byte[]{88, -22, -55, 105, 124, -119});
                    str3 = "ۘۖۦ۟۬ۢۙۗۦۘۢۢۧۛۙۢۤۜۥۘ۫ۗۚۛ۟ۘۘ۫ۛ۠ۦۖۖۘۦۙۦۘۛۦۜۙ۟ۘۘۧۤۥۤۥۢ";
                    break;
                case -1074658064:
                    classLoader = C0292l3.f938;
                    str3 = "ۚۡۥۘۦۗ۫ۨۜۨۘۖۘۢۦۖۡۗ۬ۖۥۙۙ۠ۥۨۛۢۦۘۢۢۡۘۤ۫۫۟ۨ۬۬ۦۗ۬۬ۦۘۙۢۘۘۡ۠ۤۘۗۤۙۛۡۤ۬۟ۤۦۦۙۡۧ۠ۤۦۗۜۤۤۖۘۘۜۙۜۘۡ۠ۖۖۜۡ";
                    break;
                case -818968272:
                    str3 = "۫ۡۡۘۗۢۗۗۚۖۘۤۦ۟ۦۥۙ۟ۚۙۢۚۡۛۤۡ۠ۤۥۘۡۨۡۘۖۙۚۥۜۙۥۚ۟ۛۢ۠ۥۢۚ۠۬ۘۘ۬ۥۦۘۗۥۗۚ۟ۘۥۚۨۦۤ۫۫۬۫ۚۥۤۥۨ۟ۚ۟ۨۥۨ";
                    break;
                case -338198148:
                    str3 = "ۘۧ۫ۛۧۜۧۢۖۘۥۦۤۗۡۘۘۗۥۥۘۥۥۡۘۚۜۛۦۥۖۘۛۘۚۢۥۨۘۘۧۢۧۙۧۙۗۘۘۢۚ۠۠ۧۗۨۖۘۤ۟ۜۘۨۜۨۘۨۤۡۘۜۖ۬ۧۗۗ۬ۜۘ۟ۢۧ";
                    break;
                case 392898292:
                    String str4 = "ۢ۬ۗۧ۫۬ۘ۫۫ۤۥۦۧۜۦۘۡۡۘۥۜۖ۬ۜ۫ۖۛۜۥۛۖۘۨۦۨۘۜ۠ۥۘۨۖۧۘۜۤۢۙۢۥۘۥ۫ۖۘۘ۟ۖۘۤۖۘۘۨۦۢۦۧۢۜۡۦۜۧۛۙ۟ۨۘۜۖۨ";
                    while (true) {
                        switch (str4.hashCode() ^ (-1605763101)) {
                            case -1330914568:
                                str3 = "ۙۥۢ۠۬ۜۘۗۜۗۘۨۥ۟ۨۢۥۡۧۘ۫ۖۥۘ۟ۡۦ۠۫۫ۤ۫ۡۙۛۖۜۛۨۢۛۙۡۘۘ";
                                continue;
                            case 135508288:
                                str3 = "ۥ۟ۜ۬ۘۗۜ۟ۨۘۜۥۦۛۚۖۘۚۙۜۘ۟۫۬ۨۙۜۖۜۘ۟۠ۘۚۘۖۙ۬ۨۘۚۗۙۘۙۤۢ۫ۡۗۗۢۡۛۦۚۚ۫ۙۤ۟ۖ۫ۥ۬۬۬ۜ۟ۜۛۤۜۗۙۘۢۨ۟ۚۥۗ";
                                continue;
                            case 846638657:
                                str4 = "ۛۜ۫ۡۧۘۘۜۜۗ۟۬ۙۢۙۨۤۢۧۖۗۦ۫ۘۡ۠ۥۘۜۢۘۘ۟۬ۦۘۤۛۧ۟ۚۡۘ۠ۤ۫ۡۦۦۘۡ۟ۥ۠۫ۤ۫ۦۘ";
                                break;
                            case 1050363330:
                                String str5 = "ۧۘۢ۫۬ۜۘۤۥ۠۟ۛۖۤۘ۟ۛ۫ۘۤۥۢۘۖۖۘۗۛۗۤۚۗ۟ۘۨۥۗۢۗۤۥۨۚۛۗۘۙۙۨۘۨۤۗ۬ۜ۟ۜ۬ۗ۟ۘۙ۬ۤۘۘۨۤۧ۠۠ۘۥ۬۬ۖۜۜۘ۫۬۠ۧۙ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-2126733187)) {
                                        case -1852882736:
                                            str4 = "ۦۚۦ۠ۛ۟ۙۗۘۘۢ۟ۥ۟ۨۨۚۖۘۡ۬ۖۘۘ۬ۧ۟ۜۖۘۢۦۙ۬ۚۜ۫ۨۡۛۚۙ۟ۢۥۘ۬ۥۡۘ۟ۘۚ۬ۡۨۦۡۦۘ۠ۖۖۘۚۧۦۘۤۥۙۦۦۧۙۤ۠ۤۥۖۘۛۗۥۘ۟ۜۙۧۨۛ";
                                            break;
                                        case -1428714524:
                                            str5 = "ۡۚ۠ۗۜ۟ۚۨۧۡۜۡۘۛۛۨۘۘۤۡۜۦۜۘ۠ۦۨۘ۬ۧۘۗۗۦۘۗۖ۠ۢۢۥۘ۟۫ۨۘۗۥۧۨ۫ۡۘ";
                                            break;
                                        case -716185292:
                                            str4 = "ۚۖۨۘۚۥ۠۠۫ۛۘۖۘۗۡۥۘۚۧۜۜ۫ۜۘۗۘۥۧۖۧۘۧۙۧۖۜ۫ۚ۬۟ۦۖۨۘ۫۠ۖۘۖۦ۠ۡۡۧۘۘۦۦۘۨۖۗ";
                                            break;
                                        case 2059980565:
                                            String str6 = "۫۠ۥۗ۠ۖۧۚۦۜۨۧۘۡۗۥۘۘۖ۫ۨۢۤۖۗۖۘۥ۬ۗ۠۠۬۬ۧۗ۠ۙۗۙۙۨۢۖۚۗ۠ۖۘۥۛۘ۫ۥۢ۫ۙ۠ۧۗۙۦۛ۫۟ۙ۫ۚۤ۬۟ۨ۫ۙ۫۟ۢۨۘ۫ۛۨۙۦ۟";
                                            while (true) {
                                                switch (str6.hashCode() ^ (-1381928875)) {
                                                    case -519211503:
                                                        str6 = "ۘۧۙۗ۬۟ۥ۬ۨۘۧۦۧ۬ۜۥۥۡۥۘ۠ۛۗ۫ۛۦۘۤۢ۠ۦۖۗ۠۟ۧۘ۫ۧۡۖۧۨۙ۫ۢۙۙۡۖۘۤۡ۠ۖۢۘۘ";
                                                        break;
                                                    case 1086877087:
                                                        str5 = "۬ۗ۟ۦ۟ۖۧ۟ۙۦۘ۠ۡۧۘۡۖۦۘۨۚ۫۟ۧۜۢۨ۟۠۠ۥۘۗ۬ۘۘۦۦۜۘۦۨۗ۠۠ۘۦۘۡۘۗۢ۠۠ۗۤ۠ۥۧۘ";
                                                        break;
                                                    case 1406703418:
                                                        str5 = "ۖۘۜۘۘ۬ۥۘۜۜۡۥ۫ۥۘۨۡ۫ۤۛۢ۟۠ۛۖۗۘۡۤۥۥۛۦۦۡۘ۟ۥ۫ۧ۠ۧۧ۫ۙۢۢ۫ۘۙۦۡ۬ۜۜۦۦ";
                                                        break;
                                                    case 1933466351:
                                                        str6 = classLoader != null ? "ۧۖۧۘ۫ۦ۠ۖۦۥ۬ۘۘ۟ۖۦ۫ۙۜۗ۠ۨ۠ۦ۟۫ۘۦۘۙ۟ۢۗۚۡۡۙۦۛۦۚۤۡۧۘۚۜ۟ۢۗۘۘۛۥ۫ۤۨ۠ۙۨۘۚۧۚ۫۠ۚۢ۫ۨۘۘۘۜۦۖۤۘۛۨۘۧ۬ۢ۬ۧ۟" : "ۥۛۖۛۙۜۜۧۘ۬ۦۚۙۡ۠ۥۘۥۜۜۘۖۘۥۘۙۥ۬ۙۗۘ۠ۧۘۖۢۜۚۗۖۘۤۚۘۡۧ۬ۨۗۤ۠۫۠ۨۧۚۢۨۖ۟ۗۖ۫ۖۚۛۤ۠ۙۘۧۥۛۚ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 695828624:
                    return;
                case 1496724768:
                    str3 = "ۥۥۗۥۗۜۘ۬ۙۢۜۛۡۘ۬ۜۧۦۖ۬ۧۤۥ۟ۨۦۘۖۢۘۘۡ۫ۥۗۚۨۨۙۖۘ۫ۢۡۨۨۜۘ۬ۖۘۧ۬۫ۢۙۚۨۢۥۘۥۘۥۥۢۛۤۥۢۚۜۧ۬ۜۖ۫ۥ۠ۡ۟ۛۦ۟ۢۛۦ";
                    break;
                case 1685908509:
                    str3 = "ۢۨ۬ۚ۟ۤۙۜۖۘۜۖۦۘۢۘۖۨۦۙۜۨۖۘۨ۟ۥۜۤۡۧۛ۫ۛۥۘۛۖۘۚ۠ۡۘۡۙ۫ۜۙۙۨۘۘۘۥۚۖۘۥ۬ۧۚۜۥ۫ۢ۟ۤ۬ۜۛۡ۬ۧ۟ۜۤۢۦ۟۠ۧۙ۫ۜۤ";
                    break;
                case 2016666935:
                    C0341oa.m915(new byte[]{-56, -103, 70, 20, 118, -65}, new byte[]{-12, -19, 46, 125, 5, -127});
                    str3 = "ۚۗ۫ۖۚۜۘۛ۠ۢۘۜۧۘ۫۠ۛۦۢۧۤۖۘۗۦۘۦ۫ۦۥ۬ۙ۫ۦۨۘۤۥۨۘۥۡۦۘۡۧۖۢۤۖۘۚ۟ۨۘ۫ۖۦۘۛۥۗ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥۣ۠, reason: contains not printable characters */
    public static final XC_MethodHook.Unhook m1211(String str, String str2, Object[] objArr, ClassLoader classLoader, InterfaceC0222g3<? super C0315mc, C0433vb> interfaceC0222g3) {
        boolean z;
        boolean z2 = false;
        C0341oa.m915(new byte[]{48, 107, 50, -128, 126, -89}, new byte[]{12, 31, 90, -23, 13, -103});
        C0237h4.m1090(C0341oa.m915(new byte[]{121, -2, -5, -5}, new byte[]{24, -116, -100, -120, 71, 54}), objArr);
        C0341oa.m915(new byte[]{91, -85}, new byte[]{56, -57, -35, -7, -12, -101});
        C0341oa.m915(new byte[]{124, 111, -77, -122, 123, 76}, new byte[]{20, 0, -36, -19, 30, 62});
        String str3 = "ۙۨۚۜ۠ۧۥۙۗۘ۟ۚۜۛۘۘۤۘۢۗۢۘۛۧۦۘۢۨۤۡ۟ۘۘ۫ۚۦۘۢۤۖۤۖۚ۠۠۠ۛۖۚۨۡۢ۟ۦۨۘۖ۬ۘۜۛۥۘ۠۠ۘ";
        while (true) {
            try {
                switch (str3.hashCode() ^ (-1756947260)) {
                    case -148705956:
                        String str4 = "ۧۢۖۘۙۢ۬ۦۢ۠ۤۦۘ۠ۗۡۘۗۙۜ۠۟ۤۜۖۡۤۤۨۘۗۛۛۛ۬ۦۘ۫۬ۙۗۚۡۘۤ۟ۥۘ۟ۨۨ۬ۗۨۘۢۧۨۘۦۖۜۘۡۡۙۜ۫۫ۚۙۜۘ";
                        while (true) {
                            switch (str4.hashCode() ^ 1088269028) {
                                case -453090551:
                                    String str5 = "ۡۘۜۘ۬ۧۨۘ۬ۤۤۥۜۗۧۡۘۙۛۛۚ۟۬۬ۥۘۨۡۥۘۛۨۤۙۜۥۖۥۘ۫ۘۥ۟ۗ۬ۥۡ۬۫۟۬ۢۖۘۖۖۜۘۜۡۙۡۘۗۢ۟ۖۘۖۢ۟۟۫۟ۘۢۥ۬ۘۖۧۥۜۜۤۜ";
                                    while (true) {
                                        switch (str5.hashCode() ^ (-874094196)) {
                                            case -1662383880:
                                                str5 = "۟ۧۢۗ۟۠ۤۗۜۘۖۖۙۥۗۤۧۘۨۗۤۙۧۥۤۨۧ۟۫۠۠۟ۥ۠ۘۖۜۘۨۨۜ۟ۧ۠ۗۤۦ";
                                                break;
                                            case -1428208396:
                                                str4 = "۟ۙۖۘ۫ۚۨۗۦۡۧ۟ۤۛ۟ۚۘۗۨۚۧۢۥۤۦۘۦۤۤۥۖۖۦ۟۠۟ۛۗ۟ۜۨۡۧۧۥۖۖ";
                                                break;
                                            case -771679277:
                                                str5 = !C0406ta.m1245(str) ? "۬ۘ۬۬ۚۢۨ۫ۗۨۦ۟ۗۜۜۘۧۧۡۘۥۙ۫ۤۧۨ۬۟ۡۧ۠ۗۡۗ۬ۡۙۨۘۤۘۦۘۡ۟۫ۚۜۖۘۢ۠ۦۜۢۗۚۙۥ۠ۨۥۗ۬ۡۙۘۛ" : "ۤۤۧۤۥ۫۫ۨۖۘۗۛۜۘ۫۬ۨۘۜۨۤۦ۠ۦۘۡۚۥ۟۬۫ۚۧۨۘۖۘۛۛ۟ۗ۠ۦۚۧ۫ۛۗۡ۟";
                                                break;
                                            case 1840100435:
                                                str4 = "ۛ۟ۖ۟ۥۢۥۛۢۢۥۡۘ۫ۜۜۘۢۗۖۛ۬ۚۤۢۖۘ۟۟ۦۛۤۤۘۡۘۥۦۘۙۚۨۤۤۤۗۦ۫ۨۚ۟ۤۙۧ۠ۥۛۗۛۢۨۨۥ۠ۤۙۡۨۘۧۜ۟ۜ۠ۜۘۖۖ۠۫ۦ۠ۥۖۢ";
                                                break;
                                        }
                                    }
                                    break;
                                case 59213764:
                                    str3 = "ۢۘۦۘۤۥۦۘۧۘۖۢۥۘۘۘۙ۠۠۠ۢۦ۫۠ۡ۠ۘۘۙ۫ۜۘ۠۬ۛ۬۬ۦۘۨ۠ۘ۬ۘۡۘۚۢۤ۫ۤۛۢۖۥۨۜۘۦۜۗ";
                                    continue;
                                case 196811969:
                                    str4 = "ۢ۟ۥۘۥ۟ۨۘۤۘۦۘۨۜۚۤۥ۠ۛۥۥۧۚۦۧۨۚ۟ۛۛۥۚۦۘ۫ۢۚ۫ۜۡۘۘۛۦۦۜۚۡۢۢۤۛۦۙۧ۬ۤۨۙۤۡۜۘۜۨۧۘ۫ۨۙ";
                                    break;
                                case 284091031:
                                    str3 = "ۡۦۖۦۤۗۛۨۜۘ۟ۖۘۛ۠ۢۤۦۘ۠ۢۡۘ۬ۙۛۙۦ۬ۨ۬ۖۘۤۤۛۦۦۧۘۗۥۤ۠۟ۨ۫ۡۦۘۘۜ۠ۘۧ۟ۜۧۘۦۤۚ۬ۗۜۘۜۥۙ۟۠ۜۗۘۗۧۦۡۘ";
                                    continue;
                            }
                        }
                        break;
                    case 69416333:
                        str3 = "ۗۘۜۘۙۛۡ۫ۤۛۗۦۘ۟ۚ۟ۖۥۙۥۦۜۘ۫ۗ۬ۙۢۜۘۦۛۥۨ۠ۖۘ۬۫ۥۘۘۤۦۘ۫ۖ۟ۦۖۥۘ۟ۢۜۘۦۡ۬ۗۡۦۘۡ۬ۨۜۗۙۚ۠ۜ";
                        break;
                    case 393744857:
                        String str6 = "ۦ۫ۘۘ۟ۘۦۧۘۖۘ۫ۡۘ۠ۨ۬ۨۨۢۗ۫۠ۢۦ۫ۖۡ۬ۤۖۦۘۢۡۡۥۗۡۘۙۖۖ۠۫ۜۘۙۗ۬ۙۡۜۤۜۥۘۤۖۛۤۧۜ۟ۦۨۘۜۖ۫۫۟ۡۙۦۘۢۘۛ";
                        while (true) {
                            switch (str6.hashCode() ^ 8995404) {
                                case 27481508:
                                    String str7 = "۬۫ۨ۠ۙ۠ۘۨۘۧۙۛۖ۫ۦۘۢ۬ۙۗۘۦۜۥۜۘۚۖۧۘۘۗ۫ۖۨ۬ۛۤۡۘۧ۫۬۠۫ۙۢۡۚ";
                                    while (true) {
                                        switch (str7.hashCode() ^ (-952991582)) {
                                            case -1828951782:
                                                str6 = "ۦۛۘۜۜۖۘۧۙ۬ۦ۠ۘۖۘۘۥۖۘۖۛۘۦۤۦۚ۫ۥۥۛۘۡۖ۫ۤۡۘۡۡۖ۬ۦ۫۬ۖۗۜۨۦ۟۠ۛۘۜۥۤۘۦۢۖۨ";
                                                continue;
                                            case -250964477:
                                                str7 = "ۙۤ۫ۤۙۦۘۦ۬ۜۘ۬ۤ۬ۡ۠ۥۘۢۡۢۧۛ۠ۡۨۖ۬ۤۨۘ۠ۗۜۚۚۖۘۛۙۥۙۗۛۚۤۥ۫ۧۜۘۖۨۨۘۗۛۡۘۚۖ۟ۢ۠۟۬ۧ۬ۖۨۡ";
                                                break;
                                            case -40778309:
                                                String str8 = "ۤۦۥۦۗۗۤۨ۬ۗۨۘۨۙۚۗۤۥ۟۫۠ۨۛۥۥۨۡۘۦۗۤۥۜۗۨۥۜۦۖۘۘۢۤۜۘۧۗۥ";
                                                while (true) {
                                                    switch (str8.hashCode() ^ (-1257693471)) {
                                                        case -965175422:
                                                            str7 = "ۤۡ۬ۜ۫ۥۙ۟ۡۘۤۙۚ۟۠ۧۗۘۘۜ۫ۦۖ۟۬ۖۡۘ۬ۘۙۘۡۦۤ۬ۧۗۖۘۙۛۦ۬ۦ۫ۘۡۡۘۨۘۢ۟۫";
                                                            break;
                                                        case -328221875:
                                                            str7 = "۫ۦۗ۬ۚ۟۟ۨۡۧۘۘ۠ۢۡ۬۠ۘۨۘۦۖۤۥۗۥۘۦۜۥ۟۠۫ۢۘۘۘۗ۫ۨۜۨۢۡۥۘ";
                                                            break;
                                                        case 53429062:
                                                            str8 = "ۘۡ۟ۜۦۦۥ۟ۛۙ۠ۨۢ۠ۤۘۡۘۗۧۦۗ۠ۘۜۗۙۢۤ۬ۦۙۘۤ۠ۘۘۢۜۘۧۧۗۘ۫ۛۡ۫ۡۘ۫۠۠۟ۥۚ";
                                                            break;
                                                        case 1972056511:
                                                            str8 = str2 != null ? "ۛ۫ۙۥ۠ۙۙۦۘۧۘۗۧۦۥۜۙۛۖۜۜۘ۟ۖۖۘۢ۬۠ۥۢ۫۬ۚۘۛ۠ۧۖ۫ۜۦۙۨۘۜ۬ۢ۟ۘۗۥۧۥۡ۟ۦۥۖۧۢۦۖۨۢ۟ۨۜۘ۟ۥۡۘ۠ۗۨۘ" : "۠۟ۘۜۜۥۥۨۙۛۚ۫ۖۥ۬۫ۨۘۚۚۨۘۖۗۨۘ۬ۗۨۚۗۖۘۧۖۧۢۢ۬ۛۗ۠ۙۗۥۥۨۘ";
                                                            break;
                                                    }
                                                }
                                                break;
                                            case 709770018:
                                                str6 = "ۚۚۤۡۗۜۦ۫ۙ۬ۜۘۥۙۘۘۢۙۨۤۨۨۘۛۢ۬۠ۚۡۘۘۖۥۨۗۙۛۡۡۦۧۤۚۥۘ۠ۥۜۤۛۥۘۙ۠ۘۤ۠ۦۢۤۢۜۜۤۨ۟ۖۘۥۜۘۡۙ۠ۥ۫ۨ";
                                                continue;
                                        }
                                    }
                                    break;
                                case 382891807:
                                    break;
                                case 841279652:
                                    String str9 = "ۛۡۘۘۨۖۘۦۥۦۘۙ۟ۛ۬ۦۛۖۨۜۗ۟ۖۗ۠ۜۘۥ۬ۜۘ۟ۥۥۘ۟۬ۛۧۥۧۘۡۧۨۘ۬ۗۡۧۘۢۙۦۘۘۧۧۛۦ۠ۨۘ";
                                    while (true) {
                                        switch (str9.hashCode() ^ (-648930404)) {
                                            case -1930073140:
                                                String str10 = "ۗۗ۫ۘۜ۫۬ۙۜۖۥ۟ۚۧۘۗۘۖۘۙۧۘۘۢۧۜۘۨۜۖۘۥۥۘۘۥۨۗۗۡۨۘۖۗۛۛ۠ۡۗۢۦ";
                                                while (true) {
                                                    switch (str10.hashCode() ^ (-41180718)) {
                                                        case -1468508930:
                                                            str9 = "ۨۨۧۘۗۨۧ۫ۜۦۘۜ۟ۦۘۧۜ۠ۨۛ۠ۡ۬ۨۤۖۧۙۖۜۘۥۤۘۘ۠ۙۖۚۙۡ۫ۖۛۡۢ۟ۢۤۨ۫ۖۨۜۘ۫ۢ۟";
                                                            continue;
                                                        case 14600114:
                                                            str9 = "۠ۥۜۗ۟ۦۘۦ۫ۨۘۤۜۨۚۥۧۛۢۖۢۚۦۖۛۚۜۜ۟ۧۢۚۛۧۜۛ۠ۛۖۖۥۘۦۚۖۤۙۡ";
                                                            continue;
                                                        case 68325523:
                                                            String str11 = "ۚۧ۫ۘ۬ۥۘۛۗۧۦۚ۫ۤۧۜۜ۬ۜۘ۬۬ۥۘ۫ۤۖۦ۠ۜۘ۠ۢۙۦ۬ۥۘۘۙۢۨۚۖۘۗۡۖ۠ۘۘۚۜۙۨۖۨۤۘۦۘۘۛۚۖۗ۬۬ۢۥۘ";
                                                            while (true) {
                                                                switch (str11.hashCode() ^ (-579539870)) {
                                                                    case -1228668392:
                                                                        str10 = "ۙۨۖۘۚ۟ۡۘۥۧۘۘۤۦ۟ۥ۟ۙۧۤۛۨۢۡۘۜۜ۫ۘ۫ۖۢ۫ۨ۟ۦۡۘۛۤ۟ۤۧۡۘۢۘۚۤۢ۫ۧۙۚۥۢۡۜۢۙۘۧۧۖ۫ۧۤۥ";
                                                                        break;
                                                                    case -321392810:
                                                                        str10 = "ۛ۬ۖۘۦ۫ۤۢۖۜۗ۟ۖ۫ۧۥ۟۠۫۠ۧۘۦۙ۬ۥۙۖۢۚۨۨ۠ۥۘۛۡۜۘۚۘۜ۠ۥۜۨۘۙۨۦۘ۫۬ۡۘۜ۟ۦۤۘۘۘ۠ۖۘۛۘۧۖۢ۬۬ۜ۫ۨ۠ۥ۫ۨۥۘۧۦۧۘۛۗ۠";
                                                                        break;
                                                                    case 1235853417:
                                                                        str11 = C0406ta.m1245(str2) ^ true ? "ۛۙۗ۬ۖ۬ۗ۠ۦۘۘۖۡۥۘۧۜۖۧۙۥ۠۟۟ۘۗۤۥۗۢۦۖۘۧۡۧ۠ۦۚۧۘۧۘۡ۠ۚۛۗۗۛۤۗ۫ۖۨۘۖۡۡۘ۠۬ۙ۫۫ۦۗۡ۬ۘ۬۠۟ۡۧۢۛۡۘۖۢۡۘ۬ۛ۟" : "ۗۡ۬ۥ۬ۦۗۘۡۨۖۘۢۧۘۘ۬۬ۨۘۗۦۜۙۧۖۤۦۤۖۥۖۘۢۜۨ۠ۙۦۘۙ۫۟۬ۧۜ۫ۘۘ";
                                                                        break;
                                                                    case 1595621598:
                                                                        str11 = "ۖۨۜۘۗۨۗۡۙۚۦۨۘ۫۟ۙۖ۟ۖۤۤۗۘۖۨۦۗ۫ۖۥۘۘۤۨۛ۟۠ۡۘ۟ۧۚ۠۟ۖ۬ۚ۬۟ۗۗۦۙۖۥ۫ۖۘ۠ۥ۬ۖۧۖۘۤۚۧۜۙۨۛۚۥۘۦ۟ۜۘ۬۬ۢ۫ۛۗۜ";
                                                                        break;
                                                                }
                                                            }
                                                            break;
                                                        case 702456171:
                                                            str10 = "ۘۨۧۘۨ۬ۨۘۜ۟ۖۘۖۦۚ۠ۨۙۙۜۦۘۨۙۥ۠ۡۤۛ۠ۡۘۨ۫ۚ۬ۥۡۚ۠ۦۙۦۧۨ۠ۙ۫ۧ۟۫۬ۙۧۙ۫ۦۙۤ۠ۡۚ۬ۨ۟ۢۢ";
                                                            break;
                                                    }
                                                }
                                                break;
                                            case -1598891493:
                                                break;
                                            case 1020422479:
                                                str9 = "۬۬ۤۦۚۗۙۡۨۘۢۙۜۘۦۨۦۥۚۛۨۖۡۘۢۛۛ۟ۤۤۜۡۥ۟ۘۥۖۢ۫ۤ۠۬۟۫۟ۤۢۦ";
                                                break;
                                            case 2012998652:
                                                z = true;
                                                break;
                                        }
                                    }
                                    break;
                                case 1960656519:
                                    str6 = "۬ۙۜۢۥۙ۫ۨۧۘۗۨۜۛۦۦۘ۬۫۫ۜۜ۫ۙۜۤۘۧۨۙ۠ۤۡۘۛۜۦۘ۬ۚۘۘۜۧۘۤۚۨۘ";
                                    break;
                            }
                        }
                        z = false;
                        String str12 = "ۧۛ۟ۤۢۦۚ۬ۨۖۧۗۘ۟ۖۘ۟ۖ۬ۗۧۗۚۛۥۘۤۗ۬۟ۗۙ۠ۗۡۘۛۜ۬۟۬۠ۤۛۛۤۗۛۚۨۜۦۨۤۜۚ";
                        while (true) {
                            switch (str12.hashCode() ^ (-2020268202)) {
                                case -616649242:
                                    String str13 = "۫ۢۦۘ۠ۛۡۘۘ۬ۜۘۢۚۢۧ۟ۖ۟ۧ۫ۚۦۘۛ۟ۨۨ۬ۦ۬ۧ۬ۛۡۧۗۙۖۘ۠۬ۘۘۤۚ۬ۜۘ۠ۙۤۡۤۢۦۘۘۗۙ۬ۘۛۖۤۗۘۤۚۚ۟ۢۥۧ۠ۚ۟";
                                    while (true) {
                                        switch (str13.hashCode() ^ (-683584702)) {
                                            case -2024511324:
                                                str12 = "ۨ۠ۢۧۨۚۗۗۦ۬ۧۘۘۦۙۘۥۘۧۥۚۢۙۛۤۥۤ۬ۡۨۘۙۤۨۥ۫ۜۥ۬ۧۦ۠ۙ۫ۥۜۘ۫ۧ۫ۙۧۡۘۙۢۘ";
                                                continue;
                                            case -638168762:
                                                str12 = "ۨۚۦ۟ۗۨۘ۟ۤۚ۫ۚۖۦۙ۠ۥۖۜۢ۬ۙۖۚۖۧۦۚۥ۫ۘۖ۬ۙۧۥ۫۠ۙۧۗۥۢۧ۫ۛ۟ۗۖۘۜ۫ۦۢۜۗۥۢۛ۠۠ۜۘۚ۟ۚ";
                                                continue;
                                            case 1090920080:
                                                String str14 = "ۢۢۧۜ۟۟ۧ۫ۡۘۦۨۗۛۢۙۥۘ۬ۖۧۘۧۥۡۘ۟ۚ۬ۨۡۙۢۧۘ۟ۛۗۨ۠ۛۦۤ۠ۙ۬";
                                                while (true) {
                                                    switch (str14.hashCode() ^ (-385007686)) {
                                                        case -1251745058:
                                                            str13 = "ۨ۟ۡۦۨۘ۠۬ۨۡۙۜۘۥۧۙۚ۠۫ۤۥۧۘ۬ۨۖۥ۫ۦۘۨۦۗۢۢۥۘۗۘۤۖۦۘ۟ۥ۫ۛۡۧۦۛۢۖ۠ۢ۬۫۟ۨۦۖۗ۠ۦۘۥۡۡۖۧۤۨۧۢۢ۬۠ۥۘۧۘۢۡۥۘۤۧۨۘ";
                                                            break;
                                                        case -1178554109:
                                                            str14 = !z ? "ۤۨۡۘ۫ۢۖۧ۠ۦۙۢۨۦۤۘۗۥۚۧۙۡۡ۫ۗ۠ۥۜۜۡ۟ۙ۫ۗۡۧۘۘۖۧۘۘۢۚۙۥۦۡۨۘۛۜۥۛۧۛۛ۬ۢۨۥۡۦۥۨ" : "ۦۨۦۘۘۗۜۥ۫ۥۡۦ۫ۛۖۖ۠۫ۜۘۥ۫ۗ۟ۥۧۘۖۜۗۛۨۘۘۗۢۛۡۥۜۘۗۢۜۘۚۗۡۘۡ۠۫۟ۨۨۘ۫ۥۥۡۥۤۨۨۙ۟ۙۜۘۘۛۦۢۤۖۘۛۙۖۘ۫ۦۧۘ";
                                                            break;
                                                        case -756272383:
                                                            str13 = "ۛۥۚۙۛۦۤۗۙۥۨ۟ۨۨۨۡۙۚۧۜۘۛۜ۫ۙۤۦۗ۟ۤۖۧ۫ۛۛ۬ۗۤ۬۬ۧۗۜۖۦۗۡۡۘ۫ۚ۟ۛۘ۟";
                                                            break;
                                                        case 2141497203:
                                                            str14 = "ۚ۟ۦۘۗۖۛۢۨۖۘۖۘۥۘۖۧۗۘۚۖ۬۠۟ۡۖۗۖ۫ۥۜۚۗ۠۠ۥۗۚۛۗۧۖۘۢۤۧۦۚ";
                                                            break;
                                                    }
                                                }
                                                break;
                                            case 1979239653:
                                                str13 = "۬ۨۜۧۢۡۥۤۜۚۙۖۗ۠ۛۖۦۡۘ۠ۨۘۛ۫ۗۧۘۡۥۡ۫۬۫ۧۦۥۖۘۥۘ۫ۦۢۘۦۡ۟ۡۢۥۖۙۨۘ۟ۡۙ";
                                                break;
                                        }
                                    }
                                    break;
                                case -269099881:
                                    break;
                                case 124812117:
                                    str12 = "ۡۗۢۚۖۤ۫ۙۘۗۥ۠ۨۘ۫ۚۥۦۢ۫ۥۘۤ۫ۥ۫ۤۨۜۢۨۢۨۧۜ۟ۡۘ۟۫ۦۘۜۚۤۤۧ";
                                    break;
                                case 238016778:
                                    Class clsM1199 = m1199(str, classLoader, 2);
                                    String str15 = "ۛۦۘۘۧۡۨۘۡۨۧ۬ۜ۟ۧ۟ۜۘۛۚۗۗ۠ۦۘۚۗۨۘ۬۟ۧۦۚ۫ۘۤۨۡ۫ۤۨ۬ۧۡۧۜۘۦۦۡۘۖۢۥ۠۬ۥۤۢۖۘۖۘۧۘۥ۠ۦۘ۫ۧۛ";
                                    while (true) {
                                        switch (str15.hashCode() ^ (-504801150)) {
                                            case -1675467559:
                                                break;
                                            case -1134976210:
                                                String str16 = "ۜ۫۫ۙۜۡۘۡۢ۟ۢۥۧ۟ۛۤ۠ۨۦۘۘۤۧۢۘ۟ۡۡ۫ۤ۠۠ۨۥۨۥۤۨۘۥۚۙۧۧۨ۫۟ۨۥۖ۠ۗۙۡۥۤۗ";
                                                while (true) {
                                                    switch (str16.hashCode() ^ (-629300374)) {
                                                        case -2038043097:
                                                            str15 = "۫ۧۙۥ۠ۢۧۡۧۘۧۤۦۘۦۨۨۜۥۡ۟ۚۚ۫ۦ۫ۡ۬ۚۘۘۢۡۛۥۚۢۡۘۦۤ۟ۧۢۜ۬۫ۥۘۦۙۤ۠ۖ۠ۘۘ";
                                                            continue;
                                                        case -1448528433:
                                                            String str17 = "ۥۙۡ۠ۜ۟ۘۤۗۘۡۖۘۚۘۘۢۛۗۙۤۦۘۢۡۡۘۚۤۗۢۨۘۛۖۘۖۡۡۥۧۨۙۨۗۖۦۨۡۜۦۘۘ۫ۨۦۙۜۘ";
                                                            while (true) {
                                                                switch (str17.hashCode() ^ (-1398913402)) {
                                                                    case -422161902:
                                                                        str17 = "۟ۧۙۢۜۘۢۚۘۘۙ۫ۢۘۦۧ۠ۛۦۘ۬ۡۡۘۘۡۛۤ۟۫ۚۨۙ۟ۡ۫ۘۡۛۥۥۗۧۨۢۥۖۘ";
                                                                        break;
                                                                    case -85961680:
                                                                        str17 = clsM1199 != null ? "ۥ۬ۗۨۘۧۦ۫ۖۘ۫ۗۢۢۖۘۡ۟ۥۘۚۜۨۘ۠ۡۛۗۦۖۘۜۗۖ۟ۤۖ۠ۨۦۥۚۗۚۘۘۘۨۨۘۙۧۡۧۛۗۨۘۨ" : "ۨ۬ۜۗ۫۬ۡۡۥۥۤۥۢۙۤۘۧۢ۟ۙۡۢۡۢۘۡۧ۬ۜۘۨۡ۠ۨۨۛۗ۟ۢۤۢ۟۫ۥۦۡۥۡۘۥۤۦۚ۠۟۠ۥۘۜۢۨۛۨۧۖۜۥۘۦ۟ۢۗ۟ۜۛۥۚۜ۬ۖۛۨۡۘ";
                                                                        break;
                                                                    case 1132836990:
                                                                        str16 = "ۜ۫ۨ۠ۛۜۘۢۗ۫۠ۡۢۙۥۦۗۙۗۜ۬۬۬ۤۖۘۙۤ۫ۡ۠۟ۥۗۡۖۤۦۘۜۥۙ۟ۚۘۘۢۘۢۥۡۦۘۗۘ۟ۗۛۦۘۜ۬ۜۢۧۤۤۧۙ";
                                                                        break;
                                                                    case 2094899016:
                                                                        str16 = "۬ۥۚۢۚۡ۬۫۟ۧ۬ۚۖۘۦۘۢۨۘۙۡۗۥ۬ۧۙۨ۫ۨ۠ۡ۟۬ۖۦۖۨۘۨۖۨ۬ۗ۬ۧۖۥۘ۟ۙۦۘۜۦۨ۠ۗۗۗۨۖ۫ۛۗۚۦۘ۠ۥۡۘۜ۫ۦۨۚۗۤۡۘۨۘۜۗۢۡ";
                                                                        break;
                                                                }
                                                            }
                                                            break;
                                                        case -353544392:
                                                            str16 = "۫ۥۘۘ۬۠ۡۘۦۥۧۘۚۖۚ۬ۜۡ۠۬ۤۧۚۚۜۥۥۘۘۚۢ۟ۚ۬ۘۧۙۡۗ۠ۛۢۖۥۖۙ۬ۘۡۘ۠ۧۘۘ۫۟۟۟۟ۧۘۢۚ۟ۖۛ۫۬۫";
                                                            break;
                                                        case 136565337:
                                                            str15 = "ۗۙۥۤۥ۫ۗۨۗۦۤۨ۫ۚۢۙۖۧ۫۠ۙۦ۫ۥۨۗۜۨۧۨۗۗۛۙ۟ۤ۫۠ۢۘۘۖۦۨۦۤۡۗ۫ۙ۬ۥۘۦ۟ۜۖۢۚۥۙۜۚۡۚۛۚۙۥۘ";
                                                            continue;
                                                    }
                                                }
                                                break;
                                            case 1019356168:
                                                Object[] objArrCopyOf = Arrays.copyOf(objArr, objArr.length);
                                                String str18 = "۟ۤ۟۟ۚۗۜۜۖ۬ۤۚۢ۟۬۟ۥۘۖۚۚۧۛۧۘۖۘۚۢۙۗۤۧۖۢۗ۠ۥ۟ۙۦۘۘۡ۬ۘۘۜۗۛۢۙۨۧ۟ۦ۫۬ۥۘۚۧۜۨ۫ۙۖۨۚۙۧۖۚ";
                                                while (true) {
                                                    switch (str18.hashCode() ^ 2003784916) {
                                                        case -876154357:
                                                            break;
                                                        case -666829878:
                                                            String str19 = "ۦۙ۠ۦۧۛۙۨۜۥ۬ۗۡۘۡۖۘ۟۫ۨۧۘۛ۬ۨۘۦۨۦۧۗۧۦ۬ۦ۬۟۫ۙۧۨۘ۟ۘۦۤۦۖۘۗۥۘۖۛۥۧۛۡ۫ۥۦۚ۫ۛ۬ۙۥۖۖۙۘۤۡۘۦۨۦۘۖ۫ۤۤ۠۠۫ۦ";
                                                            while (true) {
                                                                switch (str19.hashCode() ^ 1813646223) {
                                                                    case -1462336051:
                                                                        str18 = "ۚۙۡۜۖۘۜۡۨۙۜۤۥۤۨ۠ۤۦۘۡ۫۫ۚۖۦۗۦۥۡۧۨۘۧۖۢۥۦۜۨ۫ۡ۬ۨۢۚۥۘ";
                                                                        continue;
                                                                    case 568009073:
                                                                        str18 = "ۡۖۨۗۙۘۘۧ۟ۨۘۦۢۢۖۗۦۘۛۨۗ۠ۡۧۦۗۧ۫ۥۜ۠ۢۚۜۘۤۧۘۘ۠ۗۛۜۧۡۘۛ۠ۧ۬ۨۥۘۤۢ۟ۘۧۛۚ۟ۘۧۢۖۚ۬۠۠ۘ۫۠۠ۖ۬ۙ۬";
                                                                        continue;
                                                                    case 928700913:
                                                                        str19 = "ۡۚۛۚۡۢۡ۟ۛ۬ۡۨ۟۠ۧ۠ۖۨۘۛۡۘۡۦ۟ۡۖۛۢۤۤۖۗۗ۫ۖۘ۠ۤۘۘۦۥ۟ۗۗۧۤۨۙۦۦۡۛ۟ۦۘ۟۬ۜۗۘۢۛ۫ۡۘ";
                                                                        break;
                                                                    case 2032824008:
                                                                        String str20 = "ۛۧۖۘۖۖۡۗۗۡۘۙۨۜۘۦۦۥۦۗۢۧۤۖۘۢۙۧۗ۠۠ۘۤۦۘۧۜۧۘ۫ۨۧۘۧۖ۠ۨۘۥۘ۫۫ۥۧۨۤۚۛۘۢۛۡۘ۠۠ۦ۠ۛ۟ۥۦۖۘۥۧۨۘۥۗۜۡۜۦۢ۠ۖ۬ۨۘۛۡۘ";
                                                                        while (true) {
                                                                            switch (str20.hashCode() ^ 640546427) {
                                                                                case -1846964377:
                                                                                    str20 = "ۜۘۗ۬ۙۨۧۖ۬ۖۜ۬ۤۢۖۘۥ۠ۚۙۢۤۧ۟ۥۘۜۖۖۘ۟۠ۖۘ۫ۗۧ۬ۚۙۢ۫ۡۘۢۖۧۘۛۘۘۘ";
                                                                                    break;
                                                                                case -1401567881:
                                                                                    str20 = str2 != null ? "ۨۤۦۘۜ۫ۜۘۨۤۢۖۜۘۗۜۗ۠ۥۡ۬ۡۜۘۨۙ۠ۜۧ۬ۧۨۜ۫ۛ۬ۤۗۖۡۜۛۦۢۘۢ۠ۤۚۢۘۚۙۦۘۡ۫ۙۘۛۥۗۤۨ۬۟ۜ۠ۙۢۥۖۘ۬۬ۛۘ۬ۡۘۡۜۦۖۚ۫" : "۟۠۠۫ۧۘ۟۫ۘ۫۠ۨۘۢ۠۬ۚۚۘۨ۬ۜۘ۠ۜۗ۠ۨۖۘۡۥۜۥۦۤۡۡۧۘۧۚۖۡۛۖۘۘۘ";
                                                                                    break;
                                                                                case -643626969:
                                                                                    str19 = "ۛۗ۫۟ۗ۬۫۫ۨۧۙۜۛۙۘۘۖۤ۫ۗ۫ۙ۬ۙ۬۫ۜۡۦ۫ۤۜۘۜ۫ۜۙۖۥۘۡۨۦۘۢۧ۟۟۫ۜۧۜ۠ۤ۬ۦ";
                                                                                    break;
                                                                                case 1694134202:
                                                                                    str19 = "ۜ۟ۤۖۘۜۢۗۡۤۢۢۥ۬ۢۡۨۘ۫ۚۜۘۥۧۦۧۢ۠ۧۜۦۦۗۛۛ۠ۥ۫ۨۘ۠ۡ۟ۙۘۖۘۗۨۘۛۚۚۡۧ۫ۖۨۢۙ۟ۘۤۧ";
                                                                                    break;
                                                                            }
                                                                        }
                                                                        break;
                                                                }
                                                            }
                                                            break;
                                                        case -589181397:
                                                            str18 = "۫ۡۦۘۗۙۖۗۧ۬ۜۘ۫۠ۖۥۘۜۦ۠ۜۤ۫ۜۘۜ۟ۖۤۙۙ۬ۛ۟۠ۧۚۨۖ۠ۡۖۧۥۜۘۥۤ۠۫ۢۨۘ۟ۜۙ";
                                                            break;
                                                        case 846774756:
                                                            String str21 = "ۛ۠ۢ۬ۧۡۛۨۜ۫ۤۗۛۦۗۜ۟ۛۚۘۚ۟ۡ۟ۚ۠ۘۛۦۨۘۛۛ۠ۢۚۜۘۗۛۙۛۡۤۛۙۨۘۖۦ۟ۜۘۨۚۙۘۜۦۘۥۛ۠ۢۚۙۙۨۨۦۖۦۨ۠ۦ";
                                                            while (true) {
                                                                try {
                                                                    switch (str21.hashCode() ^ (-1757535722)) {
                                                                        case -1318178665:
                                                                            break;
                                                                        case 185714035:
                                                                            String str22 = "ۤۙۖۘۗ۬ۘۘ۟ۡۢ۠ۧۜۘۧۘۖۘۛۛۨۘۨۨۤۘۨۗ۫ۘۤ۠ۢۨۘ۟ۢۜۘۗۙۧۜۛۜۚۙۢ۫۫ۡۘ۠ۧ۟ۗ۠ۥۧۙ۫";
                                                                            while (true) {
                                                                                switch (str22.hashCode() ^ (-553483042)) {
                                                                                    case -2112416285:
                                                                                        str21 = "۫ۜۥۡۖۛۧ۬ۚ۬۠ۖۘۗۘۡۡۜۘۘۘ۟۟۬ۥۡۘ۟ۙۡۖۧۘۘۤۥۜۛۧۖۘۗۖۘۛۚۛۛۥۥۦۨۛۤۧۦۢۥۨۘ۟۬ۗۥ۠ۛ۠ۤۥ۠ۤۙۗۥۖۘۗۛۧۘ۬ۘۙۙۦۨ۟ۥ";
                                                                                        continue;
                                                                                    case -1192433802:
                                                                                        str22 = "ۦۤۘۛۗۛۘۖۥۘۤۗۘۘۨۡۖ۫۬ۗۗ۬ۛ۟۠ۘۦ۠ۤۖۥۖۜۦۡۤۖۤۛ۟ۦ۫ۨۙ۟ۡ۬ۜۙۘۨ۫ۥۘۙۤ۫ۛۤۨ۫ۚۦۘ۠ۥۜۘۨۨۖۘ۠ۛۖۘۛۨۨۖۡۖۘۘ۬ۦۘۦ۬۠";
                                                                                        break;
                                                                                    case -81230784:
                                                                                        String str23 = "ۗۡۧۦۗۡ۬۠ۖۘۨۤۚۨۡۙۖۖۛۦۨۥۤ۟ۨۢۥۘۦۙۦ۫ۜۖۥۦۥۛۙۥۖۘ۟ۤ۫ۧۧۗ۬ۤۢ۫ۖۥۢۜۡ۟ۧۡۛۤ۠ۙۤۜۧۘۤۥۜۘۧ۫ۛ";
                                                                                        while (true) {
                                                                                            switch (str23.hashCode() ^ (-198512910)) {
                                                                                                case -2083477058:
                                                                                                    str23 = "ۨۡۡۘۘ۫ۧۙۛ۟ۥۡۛۘۗۦۙۖۨۨۛ۫ۜۦ۠ۡۘۖۘۢ۠ۡۙۙۘۢۗۘۛۖۧۘ۫ۚۙۦۗۨۘۨۖۘۛ۠۠ۤۘ۟ۧۚۜۜ۟";
                                                                                                    break;
                                                                                                case 485045368:
                                                                                                    str23 = str2.length() == 0 ? "ۗۦۘۘۢۚۜۘۨۥۨۘۙۛۡۢ۬ۡۘۦۥۢۡۦۧۘۧۘۤ۟۬ۗ۬ۖۘۦۙۚۢۢۙۡۢۘۘۖۗۙ۠ۧۘۘۖ۟ۨۘۧۧۚۡۨۖ" : "ۡۖ۟ۛۦۢ۬ۛۥۘ۬ۗۡۘۙۡۛۦۜۛۥۛۡ۠ۤۧ۠۫ۡۚۤۨۘۤۡ۟ۡۗۡۘۤۦۥۨۤ۠ۘۗۖۘۧۡۧۘۗۡۘۚۙۥ";
                                                                                                    break;
                                                                                                case 830145069:
                                                                                                    str22 = "ۢۢ۠ۚ۟ۘۘ۠۠ۖۘۘۦ۟ۘۦۦۘۥ۫۬ۦ۠ۘۙ۬ۥۘۗ۠۟۬ۡۡۘۙۗۡۘۧۘۡۘ۫ۢۗ۫ۚۗۢۢۛۜۡۘۘۧۚ۟۠ۥۘۘۢۥۨۘۘۡۗۥۧۨۘ";
                                                                                                    break;
                                                                                                case 1463859990:
                                                                                                    str22 = "۫ۧۨۜۙۨۘۢ۠ۖۨ۫ۖۗۗۥۜۧ۟ۧۦۨۘ۠۠ۜۘۗۚۙۧۢۖۙۡ۠ۜۜ۟۬۟ۜۨۤۨ۫ۙۜۘۙ۠ۚۗۗۜۘ۬ۧۧۦۙۡۘ۬ۖ۬ۙۗۛۤۡ۬۟ۚۥۘۘۢۥۘۗۚۚ۫ۦۖۦۧۦۘ";
                                                                                                    break;
                                                                                            }
                                                                                        }
                                                                                        break;
                                                                                    case 1763401702:
                                                                                        str21 = "ۡ۬ۚۦۖۨۤۗ۬ۗۙۙۘۗۥۦ۟ۤۥۧۦۘ۬ۤۘۨ۠ۜۘۚ۠ۡۥ۟ۖۘۛۘۦ۬ۘۡ۟ۛ۫ۤۧ۫ۜۙۚۛۙۖۘۦ۫ۡۘ۬۬ۨۢۥۖۢۙۖۘ";
                                                                                        continue;
                                                                                }
                                                                            }
                                                                            break;
                                                                        case 550920021:
                                                                            break;
                                                                        case 1642811683:
                                                                            str21 = "ۜۙۧ۬ۧۡۘ۟ۥۦۢ۬۫ۛۜۥۦۖۜۘۗۚ۟ۧۖۜۘۚۦۜۘ۫۫ۧۚۧۘۘۙۨۡ۠ۗ۟ۡۨۡۘۜ۟۠ۙۘۦۖۥۗ۬ۤۦۢۛۜۘۡۥۧ۟ۖ۬";
                                                                            break;
                                                                    }
                                                                } catch (Throwable th) {
                                                                    StringBuilder sb = AbstractC0149b0.f695;
                                                                    AbstractC0149b0.a.m817(th);
                                                                    return null;
                                                                }
                                                            }
                                                            break;
                                                    }
                                                }
                                                z2 = true;
                                                String str24 = "ۖۢۥۘۖۥۨۘۜۚ۬۠ۚۜۘۧ۠ۦۘ۟ۡۜۖۚۨۘۢ۫ۛۥ۬ۗۘۚۜۘ۟ۗۡۧۨۙۚۦۘۘۥۙۥۘۢۦۗ۬۠ۚۛۗۙۚ۠ۥ۬ۢۛۦ۬ۦ۟ۡۦۘ";
                                                while (true) {
                                                    switch (str24.hashCode() ^ 832014082) {
                                                        case -1767920226:
                                                            str24 = "۟ۘۛۤۙۥۘۖۦۘۘ۟ۤۙ۠ۧۥۤۢۥۡۗۥۙۚۖۘۛۡ۫ۡۥۡۡ۠ۨۗۦۖۤۦۖۦۨۙۡۙۛ";
                                                            break;
                                                        case -433742947:
                                                            String str25 = "ۤۨ۫ۜۢۘۥۡۡ۫ۜ۬ۤۚۚ۟ۗۜۨۘۖۨ۫۬ۧۛ۟۫ۨۧ۫ۥۘۖۥ۟ۥۥۥۥ۟ۖۚۘۘۖۢۙۘۢۨۘۥۖۡ۠ۗۢۙۡۥۦۢۘۘ۫۫ۖۘ۠ۦۙۡ۬ۥۜۤ۠۫ۤۗ۫ۖ";
                                                            while (true) {
                                                                switch (str25.hashCode() ^ 1070783873) {
                                                                    case -1934756570:
                                                                        str25 = "۟ۖۥۡۗۖۘ۠ۙۛۙۨۡۘۘ۠ۡۘۦۜۗۗۛ۬ۢۢۥ۠ۡۖۦۦۖۤ۬ۡۘۤ۫ۦ۠ۦۜۛۗۢۡۢۤ";
                                                                        break;
                                                                    case -1642855568:
                                                                        str24 = "ۧۤ۬ۦۢۛۙ۬ۨۛۡۖۧۥۛۤۘۘۤۖۢۛۖۧۘۙۘۧۘۦۧۨۘۗۡۧۘۙ۟ۡۘ۟۬ۘۘ۠ۨۢ۟ۦۖ۠ۙۥۘۘۚۜۘ۬ۧۦ";
                                                                        continue;
                                                                    case 1719699038:
                                                                        String str26 = "۫ۖۘۛۚۦۘۡۙۦۦۛ۠ۜ۬ۛۗۖۙۡۙۢ۠ۤ۠۟ۥۧۘۡ۫ۦۘۖ۠ۖۘۧۨۥۘۧۨۧۦۜۜۘۧۜۦۘۨۢ۫ۙۖۘۛۦۢ";
                                                                        while (true) {
                                                                            switch (str26.hashCode() ^ 733360324) {
                                                                                case -1635809984:
                                                                                    str26 = "ۖ۟ۡۢۙۨۤ۬ۙ۫ۚۦۘۗۤۧۡۙ۠ۘۨۧۘۜ۠ۚ۬ۜۦۘۗۘۦۛۚۡۡۢۘۘۚۚۜۘۙۤۖۛۥۤۜۖۡۛۧۙۛۡۢ۟ۜۚۛ۟۫ۥۜۘۤ۠ۥۖ۟ۦۘۘۙۜۙۙۦۘۨۤ۟ۤۖۘ";
                                                                                    break;
                                                                                case -1345087134:
                                                                                    str25 = "ۙۥۥۘۨۙۡ۫ۘۢۘۛۡۘ۟ۦۡ۬ۤۛۡۤۗ۫ۢۨۜۖۨ۬ۤۧۖۨۘۨۖۨۢۡۚۙۧۡۘۦۤۛۚۧۦ۬ۨۧۚ۬ۨۘۨۦۘ۫۬ۦۡۤ۫ۚۡۨۘۥۖۧ۬ۗۨۘ";
                                                                                    break;
                                                                                case 1077899342:
                                                                                    str25 = "ۧۦۛۜۘۘۘۤۚۘۘۤۨۙ۠ۢ۬ۚ۬ۥۛۡۘ۫۟ۙۗۖۡۤۡۡۘۙۘۜۘ۠ۦۘۘۗۦۨۜۥۘۘۤۡۛۗۖۥۘۖۡۥۚۙۤۜ۬ۛ۠ۜۜ۬ۘ";
                                                                                    break;
                                                                                case 1407736729:
                                                                                    str26 = z2 ? "۠ۛۖ۫۟ۨۙۦ۠ۦۛۢۧۗۜۦۖۤۜۛۦۘۜۖۘۘ۟ۛ۠ۡۘۘۧۤۘۙ۠ۗۦۨۘۜۡۨ۫ۢۦۘ۬ۛۧ۠ۚۥ۫ۗۡ۟ۨۘۡ۟ۨۥۜۥۙۘۡۘ۫ۦۘۥۥۜۘ" : "ۛۨۦ۬ۥۘۘۖۛۨۖۡ۟ۡۛ۬۬ۗۜۘۧۨۛۗۤۜ۠ۡۨۛۧۡۚۦ۫ۦۥۤ۠ۨۦۨۦۤۛ۫ۛۚۥۙۨۚۧۨۧ";
                                                                                    break;
                                                                            }
                                                                        }
                                                                        break;
                                                                    case 1928981295:
                                                                        str24 = "ۘۖۤۘۢۧۛۢۥۘۙۧۛ۟ۖۘۚۛ۟۟۬ۥۧۡۚ۬ۖ۟ۢۦۚۙۦۥ۟ۥۨۦۧۨۖۜۤۥۘۚۗۨ۫ۤۢ۠۠ۖۦۚۤ۟ۘۥۢ";
                                                                        continue;
                                                                }
                                                            }
                                                            break;
                                                        case 961969881:
                                                            break;
                                                        case 1626435910:
                                                            Method methodFindMethodExact = XposedHelpers.findMethodExact(clsM1199, str2, Arrays.copyOf(objArrCopyOf, objArrCopyOf.length));
                                                            C0237h4.m1089(C0341oa.m915(new byte[]{82, -43, -41, -61, -117, 99, 64, -44, -42, -61, -125, 126, 85, -33, -51, -113, -24, 40, 26, -107}, new byte[]{52, -68, -71, -89, -58, 6}), methodFindMethodExact);
                                                            try {
                                                                XC_MethodHook c0315mc = new C0315mc(0);
                                                                interfaceC0222g3.mo984(c0315mc);
                                                                return m1212(methodFindMethodExact, c0315mc);
                                                            } catch (Throwable th2) {
                                                                StringBuilder sb2 = AbstractC0149b0.f695;
                                                                AbstractC0149b0.a.m817(th2);
                                                                return null;
                                                            }
                                                    }
                                                }
                                                break;
                                            case 1988435488:
                                                str15 = "ۢ۫ۖۘۖ۟ۢ۟۬ۦۘۘۚۡۘ۫ۤۖ۠۠ۡۘ۠ۢۜۧۜ۬۫۟ۧ۫ۘۘۡ۟ۖۘۡۚۦۥۛۨۘۙۘۨۘۙۦۚۜ۟ۧۙۥۘ۠۬۬ۥۧ۫ۤۚۤۦۥۘ";
                                                break;
                                        }
                                    }
                                    break;
                            }
                        }
                        break;
                    case 1335317578:
                        break;
                }
            } catch (Throwable th3) {
                StringBuilder sb3 = AbstractC0149b0.f695;
                AbstractC0149b0.a.m817(th3);
                return null;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۠ۤ, reason: contains not printable characters */
    public static final XC_MethodHook.Unhook m1212(Method method, XC_MethodHook xC_MethodHook) {
        C0341oa.m915(new byte[]{-115, 3, 12, -50, 13, 19}, new byte[]{-79, 119, 100, -89, 126, 45});
        C0341oa.m915(new byte[]{-116, 53, 36, -16, -9, -102, -120, 54, 41, -6, -41, -112}, new byte[]{-28, 90, 75, -101, -76, -5});
        try {
            return XposedBridge.hookMethod(method, xC_MethodHook);
        } catch (Throwable th) {
            StringBuilder sb = AbstractC0149b0.f695;
            AbstractC0149b0.a.m817(th);
            return null;
        }
    }

    /* JADX INFO: renamed from: ۥ۠ۥ, reason: contains not printable characters */
    public static final Object m1213(XC_MethodHook.MethodHookParam methodHookParam) {
        String str = "ۡۢۜۨۧۘۘۖۥۘۤۤۡۘۥۥۡۨ۬ۦۘۗ۟ۘۜۢۧۘۘ۠ۛۜۥۖۡۜۚۥۥۘ۠ۧۨۘۛ۟ۧۨۦۢۘۙۜۖۥۦۢۘۘۢۖۢۧۤۨۘۚۨۨۘ";
        while (true) {
            switch ((((((((str.hashCode() ^ 524) ^ 901) ^ 868) ^ 994) ^ 508) ^ 809) ^ 302) ^ 65577916) {
                case -442471405:
                    return XposedBridge.invokeOriginalMethod(methodHookParam.method, methodHookParam.thisObject, methodHookParam.args);
                case -426419372:
                    C0237h4.m1090(C0341oa.m915(new byte[]{-99, 12, -65, -88, -94, -114}, new byte[]{-95, 120, -41, -63, -47, -80}), methodHookParam);
                    str = "ۦ۬۠ۧۨۜۙ۟ۘۘۤۢۙۘۘ۬ۙۦ۠ۢۦ۠ۥۜۛۘۢۡۦۡۧۜۢۜۧۛۥۢۗ۟ۢۧۜۙۜۘۚۗ۬ۛۖۜۖۙۥ";
                    break;
                case 962950716:
                    str = "ۙ۬ۘۘ۟ۛۨۘۨۖۖۘۢۜۧۗۗۢ۬ۚۖۘۗۤۤ۬ۧۥۘ۫ۤۧۤۙۤۤۛۖۚۢۨۘ۬۟ۡۘۜۛۢۗۨۘ۠ۗ۫ۛۚ۟۫ۘۡۗۘۥۗۗۦ۠ۥۘ";
                    break;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۠ۦ, reason: contains not printable characters */
    public static Object m1214(String str, Object[] objArr) {
        ClassLoader classLoaderM1137 = C0292l3.m1137();
        C0341oa.m915(new byte[]{-41, -18, -95, 74, 88, -4}, new byte[]{-21, -102, -55, 35, 43, -62});
        C0341oa.m915(new byte[]{-111, 67, -103, 37}, new byte[]{-16, 49, -2, 86, 95, -25});
        C0341oa.m915(new byte[]{100, -123}, new byte[]{7, -23, 95, -91, -42, -60});
        Class clsM1199 = m1199(str, classLoaderM1137, 2);
        String str2 = "ۜۘۚۦۚۢۡ۬۫ۡۘۡ۫ۙۖۢ۠ۖۘ۫ۤۥۘۘۛ۬ۨۖۢۧۧۛ۠ۙۘۚۡ۟ۙۘۖۥۖ۫ۚۨ۟ۜۤۗۖۜۢۧۗۨۤۥۘۙۡۚۖ۬ۗۙۢۤ۫ۛۤ۠ۨۘۨۡۧۨۥۨۘۚۧۜۘ";
        while (true) {
            switch (str2.hashCode() ^ (-1096686948)) {
                case -2082525947:
                    str2 = "ۗۖۦۘ۟ۡۨۨ۠ۖۘۚۥۦۙۡۘۘۚۘ۬ۧۨۢۗۚۨۡۥۧۘۛۢۜۘۜۛۢۦۘ۬ۧ۬ۛ۟ۖۘۛۘۦ";
                    break;
                case -1566331123:
                    Object[] objArrCopyOf = Arrays.copyOf(objArr, objArr.length);
                    C0341oa.m915(new byte[]{97, -50, -11, -80, -104, -101}, new byte[]{93, -70, -99, -39, -21, -91});
                    C0237h4.m1090(C0341oa.m915(new byte[]{-90, 30, 34, 33}, new byte[]{-57, 108, 69, 82, 37, -73}), objArrCopyOf);
                    try {
                        return XposedHelpers.newInstance(clsM1199, Arrays.copyOf(objArrCopyOf, objArrCopyOf.length));
                    } catch (Throwable th) {
                        StringBuilder sb = AbstractC0149b0.f695;
                        AbstractC0149b0.a.m817(th);
                        return null;
                    }
                case -208555845:
                    String str3 = "۫ۧۢۙۤ۟ۦۙۖۖۥۜۦۙۖ۬ۦۘۧۙۤۗۢۥۘۦۗۨۘۧۗ۟ۙۢ۬ۡۦۦۘۧ۬۬ۧ۠ۚۢ۫ۖ";
                    while (true) {
                        switch (str3.hashCode() ^ (-1081750677)) {
                            case -1594924542:
                                str2 = "۬ۦ۟ۧۨۗۜ۟ۦۘ۫ۗۨۘۥۥۦۥۖۤۧۖۜ۬ۥۢ۠ۥۥۜۥۘ۠۟ۖۛۖۨۗۖۤۘ۟ۥۢۡۘۥۡۖۢۘ۬ۢۥ۬ۗۙۚۢۖۘۢۗۤۙۥۡۗۛۜۤ۟۟ۖۤ۫۠ۥۨۨ۠";
                                continue;
                            case -1118313179:
                                str2 = "ۤۜۖۖۗۚۦ۠ۦۦۘۢۗۛۘ۟ۖۨۧۘۡۘۜۤۥۡۜۜۘ۟ۢ۟ۛۚۗۤۥ۟ۧۡۙ۠ۗۨۚۖۥۘۖۗ۟ۤۚۨۡۘۨۘۤۡۜۦ۬ۖۚۖۦۘ";
                                continue;
                            case 146768513:
                                String str4 = "۠ۛۥۛۘۗۢۨۜۘۚۖۖۨ۬ۡۘۡۨۥۘۘۤۘۧۤۡۨۘۧۖۘ۫ۦۗۥۧۢۗۛۚۚۨۤۨۚۡ۫ۨۧۘۗۨۡۘۨۥۗۡۥۧۤۚۦۘ۠ۡ۠";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1044815854)) {
                                        case -1999811942:
                                            str4 = "ۢۦۥۘۚ۟ۙۨۚۥۘۜۨۚ۠ۨۘ۟ۙۡۘۙۘ۟ۙۖۘۙ۫۫ۥ۠۫ۦۡۘ۬ۦۙۢۙۗۜۢۦۘۥۚۖۘۙۚۨۘ۫۫ۥۘ۠۬ۦۘ";
                                            break;
                                        case -1275033502:
                                            str3 = "ۢۤ۟ۖ۫ۤۖ۫ۖۘۚۗۚۙۛۨۨۚۤۦۘۜۡۦ۠ۤۜ۟ۡۗ۫ۜ۠ۡۧۢۦۘ۬ۙۖۗۘۗ۬ۤۨۗۖ۟ۘۖۜۛۤۛۗۖۗۗۥۥ۠۟۬ۘۖۧۘۡ۫ۙ";
                                            break;
                                        case -624029894:
                                            str3 = "۟۬ۚ۫ۜ۫ۚۗۥ۟ۨۘۢ۫ۗۧۥ۫ۤۤۦۖۧۛ۫ۛ۟ۢۖۚ۟ۤ۬ۗۡۘ۫ۛۘۘۛۜۛۙ۟ۢۦۡۖ۟ۧۚ۠ۦۡ۫۟ۖۘۜۢۖۘۥۡۨۘ";
                                            break;
                                        case -326210173:
                                            str4 = clsM1199 != null ? "ۙۖۧۘۛ۬ۜۘۦۜ۠ۚ۫ۨۘۘ۠۟۫ۖۦۘۘۤۜ۠۫ۨۥۖ۫ۜۨۥۘۥ۟ۥ۟۫ۘۘۦ۫ۧ۬ۡ۟ۘۜۡۘۖ۬ۖۘۨۤۡۘۗۦۜۘ" : "ۗ۠ۛۢۦۡۜۜ۟۫ۡۖۘۤۥۡۜۙۦۢۥ۠۠۠ۜۘ۠ۡ۫ۧۜۥۥۜۦۜۡ۠ۢ۫ۥۨ۠ۧۖۘۘۚۤۚۤۤۜۖۤۥۢۧۚۨۛ۟ۜۗ";
                                            break;
                                    }
                                }
                                break;
                            case 1941832332:
                                str3 = "ۡۥۡ۟ۧۦۗۨۘ۟۠ۡۘ۬۟ۨۘۜۜۖۨۨۗۡ۠ۥۘۘۢۗ۬۟ۘ۟ۛۦۘ۠ۚۢۧۗۜۘۤۦۛۚۜۖۦ۫ۘۘ۬۠ۡۘ۟ۡۤۤۤۤۚۗۥۘۡۡۙ۟ۙۥۘۙۜۘ۬ۛ۟ۤۘۚۜۤ۟ۘ۟۫";
                                break;
                        }
                    }
                    break;
                case 846212145:
                    return null;
            }
        }
    }

    /* JADX INFO: renamed from: ۥ۠ۧ, reason: contains not printable characters */
    public static final void m1215(Object obj, String str) {
        C0341oa.m915(new byte[]{-22, 22, -48, 0, 101, 12}, new byte[]{-42, 98, -72, 105, 22, 50});
        try {
            XposedHelpers.setBooleanField(obj, str, false);
        } catch (Throwable th) {
            StringBuilder sb = AbstractC0149b0.f695;
            AbstractC0149b0.a.m817(th);
        }
    }
}
