package p199;

import android.view.ViewGroup;
import java.util.Arrays;
import java.util.HashMap;

/* JADX INFO: renamed from: 飘花落叶言子苏兰世楪哲.飘花落叶言子楪苏哲兰世, reason: contains not printable characters */
/* JADX INFO: compiled from: r8-map-id-cb39a6809a634dd4ad3d163e22b2e3b526599fa3253f8854b17de2b335a1a776 */
/* JADX INFO: loaded from: classes.dex */
public final class C7869 {

    /* JADX INFO: renamed from: 飘花落叶言子楪世兰哲苏, reason: contains not printable characters */
    public HashMap f21641;

    /* JADX INFO: renamed from: 飘花落叶言子楪世兰苏哲, reason: contains not printable characters */
    public final C7858 f21642;

    /* JADX INFO: renamed from: 飘花落叶言子楪世哲兰苏, reason: contains not printable characters */
    public final C7866 f21643;

    /* JADX INFO: renamed from: 飘花落叶言子楪世哲苏兰, reason: contains not printable characters */
    public final C7867 f21644;

    /* JADX INFO: renamed from: 飘花落叶言子楪世苏兰哲, reason: contains not printable characters */
    public final C7859 f21645;

    /* JADX INFO: renamed from: 飘花落叶言子楪世苏哲兰, reason: contains not printable characters */
    public int f21646;

    public C7869() {
        C7859 c7859 = new C7859();
        c7859.f21521 = 0;
        c7859.f21520 = 0;
        c7859.f21519 = 1.0f;
        c7859.f21518 = Float.NaN;
        this.f21645 = c7859;
        C7867 c7867 = new C7867();
        c7867.f21625 = -1;
        c7867.f21624 = 0;
        c7867.f21623 = -1;
        c7867.f21622 = Float.NaN;
        c7867.f21621 = Float.NaN;
        c7867.f21620 = Float.NaN;
        c7867.f21627 = -1;
        c7867.f21626 = null;
        c7867.f21628 = -1;
        this.f21644 = c7867;
        C7866 c7866 = new C7866();
        c7866.f21581 = false;
        c7866.f21578 = -1;
        c7866.f21577 = -1;
        c7866.f21576 = -1.0f;
        c7866.f21595 = true;
        c7866.f21594 = -1;
        c7866.f21598 = -1;
        c7866.f21599 = -1;
        c7866.f21596 = -1;
        c7866.f21597 = -1;
        c7866.f21589 = -1;
        c7866.f21588 = -1;
        c7866.f21592 = -1;
        c7866.f21593 = -1;
        c7866.f21590 = -1;
        c7866.f21591 = -1;
        c7866.f21583 = -1;
        c7866.f21582 = -1;
        c7866.f21586 = -1;
        c7866.f21587 = -1;
        c7866.f21584 = 0.5f;
        c7866.f21585 = 0.5f;
        c7866.f21569 = null;
        c7866.f21568 = -1;
        c7866.f21567 = 0;
        c7866.f21566 = 0.0f;
        c7866.f21565 = -1;
        c7866.f21564 = -1;
        c7866.f21575 = -1;
        c7866.f21574 = 0;
        c7866.f21573 = 0;
        c7866.f21572 = 0;
        c7866.f21571 = 0;
        c7866.f21570 = 0;
        c7866.f21561 = 0;
        c7866.f21560 = 0;
        c7866.f21563 = Integer.MIN_VALUE;
        c7866.f21562 = Integer.MIN_VALUE;
        c7866.f21558 = Integer.MIN_VALUE;
        c7866.f21559 = Integer.MIN_VALUE;
        c7866.f21555 = Integer.MIN_VALUE;
        c7866.f21554 = Integer.MIN_VALUE;
        c7866.f21557 = Integer.MIN_VALUE;
        c7866.f21556 = -1.0f;
        c7866.f21552 = -1.0f;
        c7866.f21553 = 0;
        c7866.f21614 = 0;
        c7866.f21613 = 0;
        c7866.f21617 = 0;
        c7866.f21618 = 0;
        c7866.f21615 = 0;
        c7866.f21616 = 0;
        c7866.f21605 = 0;
        c7866.f21604 = 1.0f;
        c7866.f21603 = 1.0f;
        c7866.f21602 = -1;
        c7866.f21601 = 0;
        c7866.f21600 = -1;
        c7866.f21607 = false;
        c7866.f21610 = false;
        c7866.f21609 = true;
        c7866.f21606 = 0;
        this.f21643 = c7866;
        C7858 c7858 = new C7858();
        c7858.f21510 = 0.0f;
        c7858.f21509 = 0.0f;
        c7858.f21508 = 0.0f;
        c7858.f21507 = 1.0f;
        c7858.f21506 = 1.0f;
        c7858.f21505 = Float.NaN;
        c7858.f21513 = Float.NaN;
        c7858.f21512 = -1;
        c7858.f21516 = 0.0f;
        c7858.f21517 = 0.0f;
        c7858.f21514 = 0.0f;
        c7858.f21515 = false;
        c7858.f21511 = 0.0f;
        this.f21642 = c7858;
        this.f21641 = new HashMap();
    }

    public final Object clone() {
        C7869 c7869 = new C7869();
        C7866 c7866 = c7869.f21643;
        c7866.getClass();
        C7866 c78662 = this.f21643;
        c7866.f21581 = c78662.f21581;
        c7866.f21580 = c78662.f21580;
        c7866.f21579 = c78662.f21579;
        c7866.f21578 = c78662.f21578;
        c7866.f21577 = c78662.f21577;
        c7866.f21576 = c78662.f21576;
        c7866.f21595 = c78662.f21595;
        c7866.f21594 = c78662.f21594;
        c7866.f21598 = c78662.f21598;
        c7866.f21599 = c78662.f21599;
        c7866.f21596 = c78662.f21596;
        c7866.f21597 = c78662.f21597;
        c7866.f21589 = c78662.f21589;
        c7866.f21588 = c78662.f21588;
        c7866.f21592 = c78662.f21592;
        c7866.f21593 = c78662.f21593;
        c7866.f21590 = c78662.f21590;
        c7866.f21591 = c78662.f21591;
        c7866.f21583 = c78662.f21583;
        c7866.f21582 = c78662.f21582;
        c7866.f21586 = c78662.f21586;
        c7866.f21587 = c78662.f21587;
        c7866.f21584 = c78662.f21584;
        c7866.f21585 = c78662.f21585;
        c7866.f21569 = c78662.f21569;
        c7866.f21568 = c78662.f21568;
        c7866.f21567 = c78662.f21567;
        c7866.f21566 = c78662.f21566;
        c7866.f21565 = c78662.f21565;
        c7866.f21564 = c78662.f21564;
        c7866.f21575 = c78662.f21575;
        c7866.f21574 = c78662.f21574;
        c7866.f21573 = c78662.f21573;
        c7866.f21572 = c78662.f21572;
        c7866.f21571 = c78662.f21571;
        c7866.f21570 = c78662.f21570;
        c7866.f21561 = c78662.f21561;
        c7866.f21560 = c78662.f21560;
        c7866.f21563 = c78662.f21563;
        c7866.f21562 = c78662.f21562;
        c7866.f21558 = c78662.f21558;
        c7866.f21559 = c78662.f21559;
        c7866.f21555 = c78662.f21555;
        c7866.f21554 = c78662.f21554;
        c7866.f21557 = c78662.f21557;
        c7866.f21556 = c78662.f21556;
        c7866.f21552 = c78662.f21552;
        c7866.f21553 = c78662.f21553;
        c7866.f21614 = c78662.f21614;
        c7866.f21613 = c78662.f21613;
        c7866.f21617 = c78662.f21617;
        c7866.f21618 = c78662.f21618;
        c7866.f21615 = c78662.f21615;
        c7866.f21616 = c78662.f21616;
        c7866.f21605 = c78662.f21605;
        c7866.f21604 = c78662.f21604;
        c7866.f21603 = c78662.f21603;
        c7866.f21602 = c78662.f21602;
        c7866.f21601 = c78662.f21601;
        c7866.f21600 = c78662.f21600;
        c7866.f21608 = c78662.f21608;
        int[] iArr = c78662.f21611;
        if (iArr == null || c78662.f21612 != null) {
            c7866.f21611 = null;
        } else {
            c7866.f21611 = Arrays.copyOf(iArr, iArr.length);
        }
        c7866.f21612 = c78662.f21612;
        c7866.f21607 = c78662.f21607;
        c7866.f21610 = c78662.f21610;
        c7866.f21609 = c78662.f21609;
        c7866.f21606 = c78662.f21606;
        C7867 c7867 = c7869.f21644;
        c7867.getClass();
        C7867 c78672 = this.f21644;
        c78672.getClass();
        c7867.f21625 = c78672.f21625;
        c7867.f21623 = c78672.f21623;
        c7867.f21621 = c78672.f21621;
        c7867.f21622 = c78672.f21622;
        C7859 c7859 = this.f21645;
        int i = c7859.f21521;
        C7859 c78592 = c7869.f21645;
        c78592.f21521 = i;
        c78592.f21519 = c7859.f21519;
        c78592.f21518 = c7859.f21518;
        c78592.f21520 = c7859.f21520;
        C7858 c7858 = c7869.f21642;
        c7858.getClass();
        C7858 c78582 = this.f21642;
        c78582.getClass();
        c7858.f21510 = c78582.f21510;
        c7858.f21509 = c78582.f21509;
        c7858.f21508 = c78582.f21508;
        c7858.f21507 = c78582.f21507;
        c7858.f21506 = c78582.f21506;
        c7858.f21505 = c78582.f21505;
        c7858.f21513 = c78582.f21513;
        c7858.f21512 = c78582.f21512;
        c7858.f21516 = c78582.f21516;
        c7858.f21517 = c78582.f21517;
        c7858.f21514 = c78582.f21514;
        c7858.f21515 = c78582.f21515;
        c7858.f21511 = c78582.f21511;
        c7869.f21646 = this.f21646;
        return c7869;
    }

    /* JADX INFO: renamed from: 飘花落叶言子楪世苏哲兰, reason: contains not printable characters */
    public final void m13203(C7850 c7850) {
        C7866 c7866 = this.f21643;
        c7850.f21440 = c7866.f21594;
        c7850.f21439 = c7866.f21598;
        c7850.f21458 = c7866.f21599;
        c7850.f21457 = c7866.f21596;
        c7850.f21461 = c7866.f21597;
        c7850.f21462 = c7866.f21589;
        c7850.f21459 = c7866.f21588;
        c7850.f21460 = c7866.f21592;
        c7850.f21452 = c7866.f21593;
        c7850.f21451 = c7866.f21590;
        c7850.f21455 = c7866.f21591;
        c7850.f21446 = c7866.f21583;
        c7850.f21445 = c7866.f21582;
        c7850.f21449 = c7866.f21586;
        c7850.f21450 = c7866.f21587;
        ((ViewGroup.MarginLayoutParams) c7850).leftMargin = c7866.f21574;
        ((ViewGroup.MarginLayoutParams) c7850).rightMargin = c7866.f21573;
        ((ViewGroup.MarginLayoutParams) c7850).topMargin = c7866.f21572;
        ((ViewGroup.MarginLayoutParams) c7850).bottomMargin = c7866.f21571;
        c7850.f21430 = c7866.f21554;
        c7850.f21429 = c7866.f21555;
        c7850.f21448 = c7866.f21562;
        c7850.f21431 = c7866.f21559;
        c7850.f21438 = c7866.f21584;
        c7850.f21437 = c7866.f21585;
        c7850.f21456 = c7866.f21568;
        c7850.f21453 = c7866.f21567;
        c7850.f21454 = c7866.f21566;
        c7850.f21436 = c7866.f21569;
        c7850.f21419 = c7866.f21565;
        c7850.f21415 = c7866.f21564;
        c7850.f21434 = c7866.f21556;
        c7850.f21435 = c7866.f21552;
        c7850.f21424 = c7866.f21614;
        c7850.f21433 = c7866.f21553;
        c7850.f21478 = c7866.f21607;
        c7850.f21477 = c7866.f21610;
        c7850.f21423 = c7866.f21613;
        c7850.f21426 = c7866.f21617;
        c7850.f21422 = c7866.f21618;
        c7850.f21418 = c7866.f21615;
        c7850.f21425 = c7866.f21616;
        c7850.f21421 = c7866.f21605;
        c7850.f21417 = c7866.f21604;
        c7850.f21420 = c7866.f21603;
        c7850.f21416 = c7866.f21575;
        c7850.f21442 = c7866.f21576;
        c7850.f21444 = c7866.f21578;
        c7850.f21443 = c7866.f21577;
        ((ViewGroup.MarginLayoutParams) c7850).width = c7866.f21580;
        ((ViewGroup.MarginLayoutParams) c7850).height = c7866.f21579;
        String str = c7866.f21608;
        if (str != null) {
            c7850.f21481 = str;
        }
        c7850.f21482 = c7866.f21606;
        c7850.setMarginStart(c7866.f21561);
        c7850.setMarginEnd(c7866.f21570);
        c7850.m13174();
    }
}
