package p000;

/* JADX INFO: loaded from: classes.dex */
public abstract class kk1 {

    /* JADX INFO: renamed from: Α */
    public static final int[] f5962 = null;

    /* JADX INFO: renamed from: Β */
    public static final int[] f5963 = null;

    /* JADX INFO: renamed from: Γ */
    public static final int[] f5964 = null;

    /* JADX INFO: renamed from: Δ */
    public static final int[] f5965 = null;

    /* JADX INFO: renamed from: Ε */
    public static final int[] f5966 = null;

    /* JADX INFO: renamed from: α */
    public static final int[] f5967 = null;

    /* JADX INFO: renamed from: β */
    public static final int[] f5968 = null;

    /* JADX INFO: renamed from: γ */
    public static final int[] f5969 = null;

    /* JADX INFO: renamed from: δ */
    public static final int[] f5970 = null;

    /* JADX INFO: renamed from: ε */
    public static final int[] f5971 = null;

    /* JADX INFO: renamed from: ζ */
    public static final int[] f5972 = null;

    /* JADX INFO: renamed from: η */
    public static final int[] f5973 = null;

    /* JADX INFO: renamed from: θ */
    public static final int[] f5974 = null;

    /* JADX INFO: renamed from: ι */
    public static final int[] f5975 = null;

    /* JADX INFO: renamed from: κ */
    public static final int[] f5976 = null;

    /* JADX INFO: renamed from: λ */
    public static final int[] f5977 = null;

    /* JADX INFO: renamed from: μ */
    public static final int[] f5978 = null;

    /* JADX INFO: renamed from: ν */
    public static final int[] f5979 = null;

    /* JADX INFO: renamed from: ξ */
    public static final int[] f5980 = null;

    /* JADX INFO: renamed from: ο */
    public static final int[] f5981 = null;

    /* JADX INFO: renamed from: π */
    public static final int[] f5982 = null;

    /* JADX INFO: renamed from: ρ */
    public static final int[] f5983 = null;

    /* JADX INFO: renamed from: σ */
    public static final int[] f5984 = null;

    /* JADX INFO: renamed from: τ */
    public static final int[] f5985 = null;

    /* JADX INFO: renamed from: υ */
    public static final int[] f5986 = null;

    /* JADX INFO: renamed from: φ */
    public static final int[] f5987 = null;

    /* JADX INFO: renamed from: χ */
    public static final int[] f5988 = null;

    /* JADX INFO: renamed from: ψ */
    public static final int[] f5989 = null;

    /* JADX INFO: renamed from: ω */
    public static final int[] f5990 = null;

    static {
            r0 = 29
            int[] r0 = new int[r0]
            r0 = {x0156: FILL_ARRAY_DATA , data: [2130968631, 2130968632, 2130968633, 2130968674, 2130968675, 2130968676, 2130968677, 2130968678, 2130968679, 2130968681, 2130968686, 2130968687, 2130968708, 2130968738, 2130968739, 2130968740, 2130968741, 2130968742, 2130968747, 2130968751, 2130968772, 2130968780, 2130968793, 2130968797, 2130968798, 2130968843, 2130968846, 2130968875, 2130968884} // fill-array
            p000.kk1.f5967 = r0
            r0 = 16842931(0x10100b3, float:2.369406E-38)
            int[] r0 = new int[]{r0}
            p000.kk1.f5968 = r0
            r0 = 16843071(0x101013f, float:2.3694452E-38)
            int[] r0 = new int[]{r0}
            p000.kk1.f5969 = r0
            r0 = 6
            int[] r1 = new int[r0]
            r1 = {x0194: FILL_ARRAY_DATA , data: [2130968631, 2130968632, 2130968658, 2130968738, 2130968846, 2130968884} // fill-array
            p000.kk1.f5970 = r1
            r1 = 2130968713(0x7f040089, float:1.7546087E38)
            r2 = 2130968748(0x7f0400ac, float:1.7546158E38)
            int[] r1 = new int[]{r1, r2}
            p000.kk1.f5971 = r1
            r1 = 8
            int[] r1 = new int[r1]
            r1 = {x01a4: FILL_ARRAY_DATA , data: [16842994, 2130968645, 2130968646, 2130968761, 2130968762, 2130968777, 2130968820, 2130968821} // fill-array
            p000.kk1.f5972 = r1
            r1 = 2130968873(0x7f040129, float:1.7546412E38)
            r2 = 2130968874(0x7f04012a, float:1.7546414E38)
            r3 = 16843033(0x1010119, float:2.3694346E-38)
            r4 = 2130968837(0x7f040105, float:1.7546339E38)
            int[] r1 = new int[]{r3, r4, r1, r2}
            p000.kk1.f5973 = r1
            r1 = 2130968871(0x7f040127, float:1.7546408E38)
            r2 = 2130968872(0x7f040128, float:1.754641E38)
            r3 = 16843074(0x1010142, float:2.369446E-38)
            r4 = 2130968870(0x7f040126, float:1.7546406E38)
            int[] r1 = new int[]{r3, r4, r1, r2}
            p000.kk1.f5974 = r1
            r1 = 7
            int[] r1 = new int[r1]
            r1 = {x01b8: FILL_ARRAY_DATA , data: [16842804, 16843117, 16843118, 16843119, 16843120, 16843666, 16843667} // fill-array
            p000.kk1.f5975 = r1
            r1 = 22
            int[] r1 = new int[r1]
            r1 = {x01ca: FILL_ARRAY_DATA , data: [16842804, 2130968626, 2130968627, 2130968628, 2130968629, 2130968630, 2130968693, 2130968694, 2130968695, 2130968696, 2130968698, 2130968699, 2130968700, 2130968701, 2130968712, 2130968722, 2130968724, 2130968734, 2130968753, 2130968756, 2130968853, 2130968864} // fill-array
            p000.kk1.f5976 = r1
            r1 = 127(0x7f, float:1.78E-43)
            int[] r1 = new int[r1]
            r1 = {x01fa: FILL_ARRAY_DATA , data: [16842839, 16842926, 2130968576, 2130968577, 2130968578, 2130968579, 2130968580, 2130968581, 2130968582, 2130968583, 2130968584, 2130968585, 2130968586, 2130968587, 2130968588, 2130968590, 2130968591, 2130968592, 2130968593, 2130968594, 2130968595, 2130968596, 2130968597, 2130968598, 2130968599, 2130968600, 2130968601, 2130968602, 2130968603, 2130968604, 2130968605, 2130968606, 2130968607, 2130968608, 2130968612, 2130968614, 2130968615, 2130968616, 2130968617, 2130968625, 2130968637, 2130968638, 2130968639, 2130968640, 2130968641, 2130968642, 2130968647, 2130968648, 2130968654, 2130968655, 2130968662, 2130968663, 2130968664, 2130968665, 2130968666, 2130968667, 2130968668, 2130968669, 2130968670, 2130968671, 2130968680, 2130968683, 2130968684, 2130968685, 2130968688, 2130968690, 2130968703, 2130968704, 2130968705, 2130968706, 2130968707, 2130968740, 2130968746, 2130968757, 2130968758, 2130968759, 2130968760, 2130968763, 2130968764, 2130968765, 2130968766, 2130968767, 2130968768, 2130968769, 2130968770, 2130968771, 2130968788, 2130968789, 2130968790, 2130968792, 2130968794, 2130968802, 2130968803, 2130968804, 2130968805, 2130968810, 2130968813, 2130968814, 2130968815, 2130968824, 2130968825, 2130968850, 2130968854, 2130968855, 2130968856, 2130968857, 2130968858, 2130968859, 2130968860, 2130968861, 2130968862, 2130968863, 2130968885, 2130968886, 2130968887, 2130968888, 2130968894, 2130968896, 2130968897, 2130968898, 2130968899, 2130968900, 2130968901, 2130968902, 2130968903, 2130968904, 2130968905} // fill-array
            p000.kk1.f5977 = r1
            r1 = 2130968618(0x7f04002a, float:1.7545895E38)
            int[] r1 = new int[]{r1}
            p000.kk1.f5978 = r1
            r1 = 2130968652(0x7f04004c, float:1.7545964E38)
            r2 = 2130968653(0x7f04004d, float:1.7545966E38)
            r3 = 16843016(0x1010108, float:2.3694298E-38)
            r4 = 2130968651(0x7f04004b, float:1.7545962E38)
            int[] r1 = new int[]{r3, r4, r1, r2}
            p000.kk1.f5979 = r1
            r1 = 2130968649(0x7f040049, float:1.7545958E38)
            r2 = 2130968650(0x7f04004a, float:1.754596E38)
            r3 = 16843015(0x1010107, float:2.3694295E-38)
            r4 = 2130968643(0x7f040043, float:1.7545945E38)
            int[] r1 = new int[]{r3, r4, r1, r2}
            p000.kk1.f5980 = r1
            r1 = 9
            int[] r1 = new int[r1]
            r1 = {x02fc: FILL_ARRAY_DATA , data: [16842927, 16842948, 16843046, 16843047, 16843048, 2130968687, 2130968689, 2130968775, 2130968818} // fill-array
            p000.kk1.f5981 = r1
            r1 = 16843436(0x10102ac, float:2.3695475E-38)
            r2 = 16843437(0x10102ad, float:2.3695478E-38)
            int[] r1 = new int[]{r1, r2}
            p000.kk1.f5982 = r1
            int[] r0 = new int[r0]
            r0 = {x0312: FILL_ARRAY_DATA , data: [16842766, 16842960, 16843156, 16843230, 16843231, 16843232} // fill-array
            p000.kk1.f5983 = r0
            r0 = 23
            int[] r0 = new int[r0]
            r0 = {x0322: FILL_ARRAY_DATA , data: [16842754, 16842766, 16842960, 16843014, 16843156, 16843230, 16843231, 16843233, 16843234, 16843235, 16843236, 16843237, 16843375, 2130968589, 2130968609, 2130968610, 2130968620, 2130968673, 2130968743, 2130968744, 2130968782, 2130968817, 2130968889} // fill-array
            p000.kk1.f5984 = r0
            r0 = 9
            int[] r0 = new int[r0]
            r0 = {x0354: FILL_ARRAY_DATA , data: [16842926, 16843052, 16843053, 16843054, 16843055, 16843056, 16843057, 2130968795, 2130968841} // fill-array
            p000.kk1.f5985 = r0
            r0 = 16843465(0x10102c9, float:2.3695556E-38)
            r1 = 2130968783(0x7f0400cf, float:1.754623E38)
            r2 = 16843126(0x1010176, float:2.3694606E-38)
            int[] r0 = new int[]{r2, r0, r1}
            p000.kk1.f5986 = r0
            r0 = 2130968784(0x7f0400d0, float:1.7546231E38)
            r1 = 2130968787(0x7f0400d3, float:1.7546238E38)
            int[] r0 = new int[]{r0, r1}
            p000.kk1.f5987 = r0
            r0 = 17
            int[] r0 = new int[r0]
            r0 = {x036a: FILL_ARRAY_DATA , data: [16842970, 16843039, 16843296, 16843364, 2130968657, 2130968672, 2130968682, 2130968737, 2130968745, 2130968754, 2130968799, 2130968800, 2130968808, 2130968809, 2130968842, 2130968847, 2130968895} // fill-array
            p000.kk1.f5988 = r0
            r0 = 16843131(0x101017b, float:2.369462E-38)
            r1 = 16843362(0x1010262, float:2.3695268E-38)
            r3 = 16842930(0x10100b2, float:2.3694057E-38)
            r4 = 2130968793(0x7f0400d9, float:1.754625E38)
            int[] r0 = new int[]{r3, r2, r0, r1, r4}
            p000.kk1.f5989 = r0
            r0 = 14
            int[] r0 = new int[r0]
            r0 = {x0390: FILL_ARRAY_DATA , data: [16843044, 16843045, 16843074, 2130968819, 2130968836, 2130968848, 2130968849, 2130968851, 2130968867, 2130968868, 2130968869, 2130968890, 2130968891, 2130968892} // fill-array
            p000.kk1.f5990 = r0
            r0 = 16
            int[] r0 = new int[r0]
            r0 = {x03b0: FILL_ARRAY_DATA , data: [16842901, 16842902, 16842903, 16842904, 16842906, 16842907, 16843105, 16843106, 16843107, 16843108, 16843692, 16844165, 2130968724, 2130968734, 2130968853, 2130968864} // fill-array
            p000.kk1.f5962 = r0
            r0 = 30
            int[] r0 = new int[r0]
            r0 = {x03d4: FILL_ARRAY_DATA , data: [16842927, 16843072, 2130968644, 2130968659, 2130968660, 2130968674, 2130968675, 2130968676, 2130968677, 2130968678, 2130968679, 2130968772, 2130968773, 2130968774, 2130968776, 2130968778, 2130968779, 2130968793, 2130968843, 2130968844, 2130968845, 2130968875, 2130968876, 2130968877, 2130968878, 2130968879, 2130968880, 2130968881, 2130968882, 2130968883} // fill-array
            p000.kk1.f5963 = r0
            r0 = 2130968786(0x7f0400d2, float:1.7546235E38)
            r1 = 2130968865(0x7f040121, float:1.7546396E38)
            r2 = 16842752(0x1010000, float:2.3693558E-38)
            r3 = 16842970(0x10100da, float:2.369417E-38)
            r4 = 2130968785(0x7f0400d1, float:1.7546233E38)
            int[] r0 = new int[]{r2, r3, r4, r0, r1}
            p000.kk1.f5964 = r0
            r0 = 2130968634(0x7f04003a, float:1.7545927E38)
            r1 = 2130968635(0x7f04003b, float:1.754593E38)
            r2 = 16842964(0x10100d4, float:2.3694152E-38)
            int[] r0 = new int[]{r2, r0, r1}
            p000.kk1.f5965 = r0
            r0 = 16842995(0x10100f3, float:2.369424E-38)
            r1 = 16842960(0x10100d0, float:2.369414E-38)
            r2 = 16842994(0x10100f2, float:2.3694236E-38)
            int[] r0 = new int[]{r1, r2, r0}
            p000.kk1.f5966 = r0
            return
    }
}
